{
  "gold": {
    "total_quantity": 685338,
    "mentions": 193,
    "contexts": [
      "runes. After movement, shoot shoot move.  Second attack is typically jump attack then immediate meteors. If you can get one shot off in between these attacks go for it, but not at the cost of eating a",
      "runes. Right is my rune set for Shackled. The enchants are better in my best set, but not a ton. Its most rare enchants and the shackled build is more like 4 green, 4 blue (edited) Yeah, Im very well ",
      "runes are appreciated. Would like if it got an explanation as well HeneralDiddoy ARC2 Novice Explorer 81625, 1013 AM Which hero should I star up first? Dracoola or Rolla. I have 6 star helix September",
      "Runes 32400 x2  64,800  Rare Etched Rune 9000 Or Epic Blessing Rune 4050 x2  8,100 (edited) BS how much gems do i need to spend to get a etched with golden tickets PaintDryer PoE Hunting Ace 42725, 10",
      "Rune Fusion , , unknown Player Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level ",
      "etched Nunyaa Junior Archer 71025, 901 PM Thanks so not much point unless you see these coming up which is still low requirements Thanks so not much point unless you see these coming up which is still",
      "etched at L1 so I havent personally tested it in arena to know for sure (edited) 1 50k on top of the free lures ? Josiias F2P Cat MOP PONY Archero 2 Helper 10325, 633 AM I got mythic artifact and 4 bl",
      "etched(pulsing orb) in fishing events (maybe June) except Scythe and archer close range is good  for Help D ARC2 get circle etched(pulsing orb) in fishing events (maybe June) xWake Junior Archer 52525",
      "rune for each skill of that type taken. Zero benefit in gvg and peak because no skills are available. Youll see some dps increase in arena but its pretty random in terms of skills. Youll probably only",
      "rune) correct ERocks Elite Archer 92925, 928 AM thanks! thats very helpful info extremelyaverage Senior Archer 92925, 928 AM and i guess atreus, although its diminished bc it applies atreus before art",
      "runes. Right is my rune set for Shackled. The enchants are better in my best set, but not a ton. Its most rare enchants and the shackled build is more like 4 green, 4 blue (edited) Entropy42 Senior Ar",
      "Runes 32400 x2  64,800  Rare Etched Rune 9000 Or Epic Blessing Rune 4050 x2  8,100 (edited) BS how much gems do i need to spend to get a etched with golden tickets PaintDryer PoE Hunting Ace 42725, 10",
      "rune from ALL 3 PRESETS. For further instruction media , (edited) EpicJapan  for Help D ARC2 Chat Mod 41125, 1101 PM If youre having trouble with fusion, try removing the gearrune from ALL 3 PRESETS. ",
      "rune for each skill of that type taken. Zero benefit in gvg and peak because no skills are available. Youll see some dps increase in arena but its pretty random in terms of skills. Youll probably only",
      "rune tab? DELTADavus Senior Archer 10325, 350 AM lets do it in DMs (edited) 1 十 Father Steve  国语MOD ARC2 Chat Mod 10325, 1033 AM Otta 0 star is great for pve bosses, 2 is for pvp. But now days otta ma",
      "runes are appreciated. Would like if it got an explanation as well HeneralDiddoy ARC2 Novice Explorer 81625, 1013 AM Which hero should I star up first? Dracoola or Rolla. I have 6 star helix September",
      "runes. After movement, shoot shoot move.  Second attack is typically jump attack then immediate meteors. If you can get one shot off in between these attacks go for it, but not at the cost of eating a",
      "runes are appreciated. Would like if it got an explanation as well HeneralDiddoy ARC2 Novice Explorer 81625, 1013 AM Saturday, August 16, 2025 at 1013 AM Which hero should I star up first? Dracoola or",
      "Runes 32400 x2  64,800  Rare Etched Rune 9000 Or Epic Blessing Rune 4050 x2  8,100 (edited) Sunday, April 27, 2025 at 1049 PM BS how much gems do i need to spend to get a etched with golden tickets Pa",
      "Rune Fusion , , unknown Player Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level ",
      "etched Nunyaa Junior Archer 71025, 901 PM Thursday, July 10, 2025 at 901 PM Thanks so not much point unless you see these coming up which is still low requirements Thanks so not much point unless you ",
      "etched at L1 so I havent personally tested it in arena to know for sure (edited) Friday, October 3, 2025 at 556 AM 1 50k on top of the free lures ? Josiias F2P Cat MOP PONY Archero 2 Helper 10325, 633",
      "etched(pulsing orb) in fishing events (maybe June) except Scythe and archer close range is good  for Help D ARC2 get circle etched(pulsing orb) in fishing events (maybe June) xWake Junior Archer 52525",
      "rune for each skill of that type taken. Zero benefit in gvg and peak because no skills are available. Youll see some dps increase in arena but its pretty random in terms of skills. Youll probably only",
      "runes. After movement, shoot shoot move.  Second attack is typically jump attack then immediate meteors. If you can get one shot off in between these attacks go for it, but not at the cost of eating a",
      "Runes 32400 x2  64,800  Rare Etched Rune 9000 Or Epic Blessing Rune 4050 x2  8,100 (edited) Sunday, April 27, 2025 at 1049 PM BS how much gems do i need to spend to get a etched with golden tickets Pa",
      "rune from ALL 3 PRESETS. For further instruction media , (edited) Wednesday, July 2, 2025 at 749 AM EpicJapan  for Help D ARC2 Chat Mod 41125, 1101 PM Friday, April 11, 2025 at 1101 PM If youre having",
      "rune for each skill of that type taken. Zero benefit in gvg and peak because no skills are available. Youll see some dps increase in arena but its pretty random in terms of skills. Youll probably only",
      "runes are appreciated. Would like if it got an explanation as well HeneralDiddoy ARC2 Novice Explorer 81625, 1013 AM Saturday, August 16, 2025 at 1013 AM Which hero should I star up first? Dracoola or",
      "runes. Right is my rune set for Shackled. The enchants are better in my best set, but not a ton. Its most rare enchants and the shackled build is more like 4 green, 4 blue (edited) Entropy42 Senior Ar",
      "etched depends on luck on last tickets September 13, 2025 ssg Novice Explorer 91325, 819 PM What is the total number of baits you can get from a fishing event, including missions, stores! Pontus Chat ",
      "etched depends on luck on last tickets September 13, 2025 ssg Novice Explorer 91325, 819 PM Saturday, September 13, 2025 at 819 PM What is the total number of baits you can get from a fishing event, i",
      "etched with golden tickets PaintDryer PoE Hunting Ace 42725, 1037 PM Around 25k? April 28, 2025 Original message was deleted Pontus Chat Mod 42825, 1252 AM Thats surprising. Around 2 below avg 1 zaddy",
      "etched , 22.8k gems , 596 lures (444 free  152 from gems) , 1946.8 kg , damnn... i wasted 300 gems. forgot we get 2 more baits tmr. (edited) Pontus Chat Mod 43025, 632 PM Wait couldnt you get another ",
      "etched with golden tickets PaintDryer PoE Hunting Ace 42725, 1037 PM Sunday, April 27, 2025 at 1037 PM Around 25k? April 28, 2025 Original message was deleted Pontus Chat Mod 42825, 1252 AM Monday, Ap",
      "etched , 22.8k gems , 596 lures (444 free  152 from gems) , 1946.8 kg , damnn... i wasted 300 gems. forgot we get 2 more baits tmr. (edited) Wednesday, April 30, 2025 at 636 PM Pontus Chat Mod 43025, ",
      "boss and it continued to go up until I was standing basically on top of him I just tested against a boss and it continued to go up until I was standing basically on top of him DELTADavus Senior Archer",
      "level carry over. 1 B3RMAN Senior Archer 7725, 943 PM Demon event Luck level carry over. 1 Demon event Luck level carry over. Demon event Luck level carry over. Sebiias Tryhard Cat MOP Range Master 77",
      "levels, been stuck at 121 for a while I dont understand what you mean. Entering the jungle screen is the only way to see your rating anyway, so this is how it has always been. Mahoney  P90015575 Elite",
      "Chapter AoE  OrbsElemental Seal  Invasion AoE  OrbsOldSprite (If legendary) PVP OldSprite  NewSprite (or Meteor ) randomplaya Nurezu Hunting Ace 92225, 640 PM This is kurdated outdated I think They do",
      "Shackled Jungle? Cruzix Elite Archer 82925, 1254 AM This is what I use. Can switch revive for exp rune if you want. Focus on main weapon skills and pick up circle skills if no better option. .ingame A",
      "boss info below in the comments when you encounter them!! Dont worry about making mistakes because someone will correct them  BOSS LIST  ,  If possible please add the name of the boss as a comment to ",
      "Boss List Game Mechanics May 21, 2025 EpicJapan  for Help D ARC2 Chat Mod 52125, 637 AM Any data or info is welcome Lets make a complete boss list! , Currently, about 13 of it is filled so check it ou",
      "boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star  EasyVictor ARC2 Senior Archer 52025, 947 PM Tuesday, May 20, 2025 at 9",
      "level carry over. 1 B3RMAN Senior Archer 7725, 943 PM Monday, July 7, 2025 at 943 PM Demon event Luck level carry over. 1 Demon event Luck level carry over. Demon event Luck level carry over. Sebiias ",
      "level, your gear or set, even with a suboptimal build, a good main weapon skill selection is gonna deal 70 to 90% of your total damage Tryhard Cat MOP No matter at what level, your gear or set, even w",
      "boss for tower 1050? I think I have to move perpendicular to the direction he jumps on me, bc he must kill all in his jump path. Previous versions of this boss ones seem to just jump high and land in ",
      "boss info below in the comments when you encounter them!! Dont worry about making mistakes because someone will correct them  BOSS LIST  ,  If possible please add the name of the boss as a comment to ",
      "bosses pre-chaotic womtei Novice Explorer Yesterday at 1140 AM Monday, October 6, 2025 at 1140 AM I have oracle m2 and both l3 griffin and dragoon ring. Ive been rocking the oracle with the added stat",
      "Boss List Game Mechanics May 21, 2025 EpicJapan  for Help D ARC2 Chat Mod 52125, 637 AM Wednesday, May 21, 2025 at 637 AM Any data or info is welcome Lets make a complete boss list! , Currently, about",
      "Boss midway checking Boss.xlsx 12.27 KB 1 EpicJapan  for Help D ARC2 Chat Mod 52225, 907 AM 1 Looking better tysm (edited) eXigar BEG Archero 2 Helper 52225, 643 PM Sky  900 1 plant that shoots balls ",
      "boss always spins counterclockwise and shoots counterclockwise at the end of his spin. (Same direction as circles)  For now, not sure of a better way to avoid attacks other than hope he spins and land",
      "Boss midway checking Boss.xlsx 12.27 KB 1 EpicJapan  for Help D ARC2 Chat Mod 52225, 907 AM Thursday, May 22, 2025 at 907 AM 1 Looking better tysm (edited) Thursday, May 22, 2025 at 907 AM eXigar BEG ",
      "boss always spins counterclockwise and shoots counterclockwise at the end of his spin. (Same direction as circles)  For now, not sure of a better way to avoid attacks other than hope he spins and land",
      "boss did that to him He isnt supposed to hit me, what is that!! 1 EasyVictor ARC2 Senior Archer 52225, 738 PM Yeah I guess Ive always had somewhat freeze something so never ran into that Ill have to t",
      "boss did that to him He isnt supposed to hit me, what is that!! 1 EasyVictor ARC2 Senior Archer 52225, 738 PM Thursday, May 22, 2025 at 738 PM Yeah I guess Ive always had somewhat freeze something so ",
      "pvp Sebiias Tryhard Cat MOP Range Master Yesterday at 928 AM Keep upgrading otta nian 4 stars is the goal Every star on nian otta is better than either of the two thor skins Tryhard Cat MOP Keep upgra",
      "pvp aka.  GOATED  ゼヌ Junior Archer 9925, 1137 AM full griffin mythic set up is and broken in pvp full griffin mythic set up is and broken in pvp .  GOATED  ゼヌ full griffin mythic set up is and broken ",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "pvp? why is nian otta recommended so much? is otta used in pve or pvp? Shadowfax88 Legendary Archer 1022 AM Tuesday, October 7, 2025 at 1022 AM PvP primarily. His 2 skill is 40% crit rate60% crit dmg ",
      "pvp personally so surely oracle isnt that bad I prioritize PvE over pvp personally so surely oracle isnt that bad RB773 Mythic Archer 10425, 915 PM Saturday, October 4, 2025 at 915 PM the staff is Oct",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "pvp. Chaotic griffin is the best set but a mixed set is even better particularly chaotic oracle chestchaotic griffin amulet combo Oracle is generally the worst pvp set but if you are an oracle user, a",
      "arena becomes unplayable 10 minutes before the daily reset, it is recommended to start playing 20-30 minutes before the reset. You could save your tickets and use them all at once on the last day, but",
      "pvp. Chaotic griffin is the best set but a mixed set is even better particularly chaotic oracle chestchaotic griffin amulet combo Oracle is generally the worst pvp set but if you are an oracle user, a",
      "arena becomes unplayable 10 minutes before the daily reset, it is recommended to start playing 20-30 minutes before the reset. You could save your tickets and use them all at once on the last day, but",
      "PvE. Its 3% dmg of the particular dmg source of the etched rune for each skill of that type taken. Zero benefit in gvg and peak because no skills are available. Youll see some dps increase in arena bu",
      "level doesnt count? neither do mythic2 and mythic4 increases? So then Im assuming that all HP discrepancies between players are due to artifacts only? extremelyaverage Senior Archer 92925, 927 AM corr",
      "level check is so buggy Sletherot Novice Explorer 91025, 821 AM Yeah its horribly fking buggy and not clear AT ALL on how it works or should work. Nothing is more frustrating than missing out on hundr",
      "level of confidence at 99.9% and margin of error at 0.1% (at least) Which means you would need to collect 1 988 550 pull results weekly to prove anything (edited) 1 You have the % available when you p",
      "chapterstowers Please write any boss info below in the comments when you encounter them!! Dont worry about making mistakes because someone will correct them  BOSS LIST  ,  If possible please add the n",
      "bests (edited) If you arent full mythic gear yet, then its better to get keys nani Novice Explorer 711 AM Hmm any clue how the razor starcores for weapons work in the first place? Do you buy the rare ",
      "best way to avoid his 3x charge. This will also keep him in close if you are using circle attackrunes. After movement, shoot shoot move.  Second attack is typically jump attack then immediate meteors.",
      "best you can do extremelyaverage Senior Archer 10125, 1020 AM oh loki? thats as opposed to otta DELTADavus Senior Archer 10125, 1020 AM unless otta 2 then yea, otta 100% D extremelyaverage Senior Arch",
      "best (highest) set of runes. Right is my rune set for Shackled. The enchants are better in my best set, but not a ton. Its most rare enchants and the shackled build is more like 4 green, 4 blue (edite",
      "pve or pvp? why is nian otta recommended so much? is otta used in pve or pvp? Shadowfax88 Legendary Archer 1022 AM Tuesday, October 7, 2025 at 1022 AM PvP primarily. His 2 skill is 40% crit rate60% cr",
      "Chapter 32, wave 30.  Defeated at 150k power  This boss always spins counterclockwise and shoots counterclockwise at the end of his spin. (Same direction as circles)  For now, not sure of a better way",
      "level of confidence at 99.9% and margin of error at 0.1% (at least) Which means you would need to collect 1 988 550 pull results weekly to prove anything (edited) Saturday, September 6, 2025 at 206 PM",
      "chapterstowers Please write any boss info below in the comments when you encounter them!! Dont worry about making mistakes because someone will correct them  BOSS LIST  ,  If possible please add the n",
      "best pvp resoskin even before the potion etched was released 1 Legendary is fairly significant upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it give",
      "best way to avoid his 3x charge. This will also keep him in close if you are using circle attackrunes. After movement, shoot shoot move.  Second attack is typically jump attack then immediate meteors.",
      "best way to avoid his 3x charge. This will also keep him in close if you are using circle attackrunes. After movement, shoot shoot move.  Second attack is typically jump attack then immediate meteors.",
      "pve chapters and tower gameplay having the oracle chest and amulet helps. The chest could even be echo because hp will eventually not matter in chapters BonnyBoy ARC2 Junior Archer 81325, 704 PM Ok fu",
      "chapters and tower gameplay having the oracle chest and amulet helps. The chest could even be echo because hp will eventually not matter in chapters BonnyBoy ARC2 Junior Archer 81325, 704 PM Ok full s",
      "pve chapters and tower gameplay having the oracle chest and amulet helps. The chest could even be echo because hp will eventually not matter in chapters BonnyBoy ARC2 Junior Archer 81325, 704 PM Wedne",
      "chapters and tower gameplay having the oracle chest and amulet helps. The chest could even be echo because hp will eventually not matter in chapters BonnyBoy ARC2 Junior Archer 81325, 704 PM Wednesday",
      "Thor in resonance no, for PvP ur using otta with skin and thor, with helix 6 stars Therefore, duck helix 1 star is good enough and the new helix skin is also fairly good for PvP when they fix it Tryha",
      "otta its just not giving me much. Thats assuming otta affects that bonus. Can anyone confirm? I assume you could tell on elemental crit. October 5, 2025 gryfel Senior Archer 548 AM Is buying epic rod ",
      "Otta is 0-1 is bad 2 very good 3 not worth it D SamCute ARC2 Senior Archer 10325, 345 AM Can you give me advise about my resonance and my rune tab? ARC2 Can you give me advise about my resonance and m",
      "Thor as a resonance because he moves too much and just runs out of the potion spring range too often pimpanzee Junior Archer 92925, 408 PM Well that makes much more sense! The description could be cle",
      "character crit). I havent been able to test meteors because I dont have meteor crit rate enchants Awesomethanu Senior Archer 92625, 1247 PM how do u do the test i have meteor crit rate but low rate Sh",
      "resonance. Cause im always gonna slot Thor in resonance Tryhard Cat MOP Keep upgrading otta nian HundredArms Novice Explorer Yesterday at 931 AM What about after that? Also is nians base skills a must",
      "resonance and my rune tab? ARC2 Can you give me advise about my resonance and my rune tab? DELTADavus Senior Archer 10325, 350 AM lets do it in DMs (edited) 1 十 Father Steve  国语MOD ARC2 Chat Mod 10325",
      "Character , Shards required for 0-8 5050100100150150200300500 For example 200 Shards required for 56 questions Artifact , , Mythic 0-8 -10 Shards 9-14 -20 Shards 15 -30 Shards 50% of the base stats ea",
      "otta as the base hero in pvp? What resonance do you use? I see, so you use otta as the base hero in pvp? What resonance do you use? Shadowfax88 Legendary Archer 1051 AM Tuesday, October 7, 2025 at 105",
      "otta its just not giving me much. Thats assuming otta affects that bonus. Can anyone confirm? I assume you could tell on elemental crit. October 5, 2025 gryfel Senior Archer 10525, 548 AM Sunday, Octo",
      "otta keep moving and only attack during punches cuz his pounce is p fast. does 3 punches where you wanna dodge leftright. the pounce you want to walk away for more time tododge fireballs I forgot what",
      "Helix, what would the best two pvp resonances be between 0 Ottaskin, 0 Thor and 0 DK? I assume Otta should be there but what about the other two? I have ran Thor for the past couple of weeks and it ha",
      "character in resonance slot one. I use Helix with Otta and Thor as resonance mrplonker Novice Explorer 1053 AM Tuesday, October 7, 2025 at 1053 AM Ohh damn I didnt know about that sacred hall thing th",
      "resonance slot one. I use Helix with Otta and Thor as resonance mrplonker Novice Explorer 1053 AM Tuesday, October 7, 2025 at 1053 AM Ohh damn I didnt know about that sacred hall thing thats huge, tha",
      "Character , Shards required for 0-8 5050100100150150200300500 For example 200 Shards required for 56 questions Artifact , , Mythic 0-8 -10 Shards 9-14 -20 Shards 15 -30 Shards 50% of the base stats ea",
      "ring of agony range At mithical 1 June 19, 2025 fylopian STFC Senior Archer 61925, 836 AM im oracle build, with a legendary 2 Beam Staff. For PVP should i still use that or a Dragoon Crossbow Epic 2 f",
      "ring to do it and all hes asking in return is for people to contribute. Its a win-win in any case It wouldnt be the first time Habby provides incorrect data. Im all up for the coachs calculations and ",
      "oracle spear one. You really think i should pass and just get the lower tier skins? i dont have otta unlocked but helix is almost max Sebiias Tryhard Cat MOP Range Master 727 AM Unlocking otta and her",
      "gear are written in such a way to indicate they are global sources, they are actually main weapon Willalt  Elite Archer 10125, 534 AM oh I did not know lucky shadow gives elementals base crit I see. I",
      "gear in the game unless you have maxed leg wep skin Hybridreamer Junior Archer Yesterday at 810 PM Those are strong words lok its one of the most useless gear in the game Hybridreamer Junior Archer Ye",
      "gear - Key ratio Game Mechanics September 2, 2025 Poosti Wiki Contributor 9225, 1035 AM Data collection for S gear to key ratio. Sepetate forms for chroma and mythstone chests below. 5 2 Follow Poosti",
      "gear to key ratio. Sepetate forms for chroma and mythstone chests below. Poosti Wiki Contributor 9225, 1035 AM Data collection for S gear to key ratio. Sepetate forms for chroma and mythstone chests b",
      "GearRune Fusion , , unknown Player Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to le",
      "ring of agony range At mithical 1 June 19, 2025 fylopian STFC Senior Archer 61925, 836 AM Thursday, June 19, 2025 at 836 AM im oracle build, with a legendary 2 Beam Staff. For PVP should i still use t",
      "ring to do it and all hes asking in return is for people to contribute. Its a win-win in any case It wouldnt be the first time Habby provides incorrect data. Im all up for the coachs calculations and ",
      "oracle because u can drop invic potions and those give you a small chance to beat dragoons October 7, 2025 mrplonker Novice Explorer 943 AM Tuesday, October 7, 2025 at 943 AM why is nian otta recommen",
      "oracle RB773 Mythic Archer Yesterday at 1052 AM Monday, October 6, 2025 at 1052 AM meteor split  elem crit  potion spring  sprites awe meteor split  elem crit  potion spring  sprites awe Hybridreamer ",
      "gear are written in such a way to indicate they are global sources, they are actually main weapon Willalt  Elite Archer 10125, 534 AM Wednesday, October 1, 2025 at 534 AM oh I did not know lucky shado",
      "gear in the game unless you have maxed leg wep skin Hybridreamer Senior Archer 10425, 810 PM Saturday, October 4, 2025 at 810 PM Those are strong words lok its one of the most useless gear in the game",
      "gear - Key ratio Game Mechanics September 2, 2025 Poosti Wiki Contributor 9225, 1035 AM Tuesday, September 2, 2025 at 1035 AM Data collection for S gear to key ratio. Sepetate forms for chroma and myt",
      "gear to key ratio. Sepetate forms for chroma and mythstone chests below. Poosti Wiki Contributor 9225, 1035 AM Tuesday, September 2, 2025 at 1035 AM Data collection for S gear to key ratio. Sepetate f",
      "GearRune Fusion , , unknown Player Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to le",
      "Staff. For PVP should i still use that or a Dragoon Crossbow Epic 2 for arena? Exodus the Coach  P90015619 Elite Archer 61925, 922 AM Check pinned msg Arena Build Ask your question there for better he",
      "staff. 1 April 30, 2025 Rods only make it easier to catch. I was informed by habby staff. Zilla Senior Archer 43025, 814 AM Thanks! Pontus Chat Mod 43025, 522 PM Ending at 1303.14 KG -13 Legendary Tic",
      "gear set. ARC2 Is this still valid? Dragoon set is recommended for PvP? Most recommend Griffin I thought. But then some guides say to mix and match some pieces no matter what gear set. Shadowfax88 Leg",
      "Staff. For PVP should i still use that or a Dragoon Crossbow Epic 2 for arena? Exodus the Coach  P90015619 Elite Archer 61925, 922 AM Thursday, June 19, 2025 at 922 AM Check pinned msg Arena Build Ask",
      "staff. 1 April 30, 2025 Rods only make it easier to catch. I was informed by habby staff. Zilla Senior Archer 43025, 814 AM Wednesday, April 30, 2025 at 814 AM Thanks! Pontus Chat Mod 43025, 522 PM We",
      "Staff 52225, 521 AM Thursday, May 22, 2025 at 521 AM hope this help they type column isnt so reliable since i realized there is 2xBoss midway checking Boss.xlsx 12.27 KB 1 EpicJapan  for Help D ARC2 C",
      "gear set. ARC2 Is this still valid? Dragoon set is recommended for PvP? Most recommend Griffin I thought. But then some guides say to mix and match some pieces no matter what gear set. Shadowfax88 Leg",
      "ring is the best for most bosses pre-chaotic womtei Novice Explorer Yesterday at 1140 AM Monday, October 6, 2025 at 1140 AM I have oracle m2 and both l3 griffin and dragoon ring. Ive been rocking the ",
      "skills a must have for resonance. Cause im always gonna slot Thor in resonance What about after that? Also is nians base skills a must have for resonance. Cause im always gonna slot Thor in resonance ",
      "cards but Im not sure if thats the best option. I was looking at the excel sheet with spending values but this doesnt include packs in the events Is buying epic rod pack a good investement of ? Ale ha",
      "card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena,",
      "Skills 71325, 810 AM Kaithulhu ARC2 Chat Mod 71325, 811 AM Thank you for the hard work! Kaithulhu ARC2 Chat Mod 71325, 811 AM Thank you for the hard work! Thank you for the hard work! iso Elite Archer",
      "active parts out of existing guide out and retire that one. someone else can own the FAQs and other misc things around the base strategy. Josiias F2P Cat MOP PONY Archero 2 Helper 91225, 659 AM Yeah, ",
      "cards but Im not sure if thats the best option. I was looking at the excel sheet with spending values but this doesnt include packs in the events Is buying epic rod pack a good investement of ? Ale ha",
      "card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena,",
      "Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level 55. There are two sets of talents, with the second set becoming avai",
      "skill is 40% crit rate60% crit dmg after taking hits which is basically constant in PvP. His skin has a chance to drop a potion on crits which happens so frequently that its basically only limited by ",
      "cards but Im not sure if thats the best option. I was looking at the excel sheet with spending values but this doesnt include packs in the events Is buying epic rod pack a good investement of ? Ale ha",
      "card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena,",
      "Skills 71325, 810 AM Sunday, July 13, 2025 at 810 AM Kaithulhu ARC2 Chat Mod 71325, 811 AM Sunday, July 13, 2025 at 811 AM Thank you for the hard work! Kaithulhu ARC2 Chat Mod 71325, 811 AM Sunday, Ju",
      "active parts out of existing guide out and retire that one. someone else can own the FAQs and other misc things around the base strategy. Josiias F2P Cat MOP PONY Archero 2 Helper 91225, 659 AM Friday",
      "cards but Im not sure if thats the best option. I was looking at the excel sheet with spending values but this doesnt include packs in the events Is buying epic rod pack a good investement of ? Ale ha",
      "card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena,",
      "Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level 55. There are two sets of talents, with the second set becoming avai",
      "skill choices. Entropy42 Senior Archer 81725, 1038 AM The left is my best (highest) set of runes. Right is my rune set for Shackled. The enchants are better in my best set, but not a ton. Its most rar",
      "upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it gives elementals a base crit rate of 10% (i believe but I could be mistaken). Youll most likely hav",
      "level 5 , dont know if you have that kind of budget tho might even be good for PVP extremelyaverage Senior Archer 93025, 1159 AM and otta extremelyaverage Senior Archer 93025, 1159 AM and otta Yes. It",
      "level 5 to send pictures in channels. For more information, please check roles In the meantime, you can post in media and ping me there EpicJapan  for Help D ARC2 Chat Mod 41125, 1101 PM If youre havi",
      "upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it gives elementals a base crit rate of 10% (i believe but I could be mistaken). Youll most likely hav",
      "level 5 to send pictures in channels. For more information, please check roles In the meantime, you can post in media and ping me there EpicJapan  for Help D ARC2 Chat Mod 41125, 1101 PM Friday, April",
      "damage to 122mil so far 1 Thank you .𝐊𝐚𝐫𝐦𝐚𝐭𝐢𝐜. VOID It helped a lot. Went from 40mil damage to 122mil so far Nadnerb Legendary Archer Yesterday at 213 AM nws u need some healing to keep ur hp above 10",
      "damage at point blank Shadowfax88 Legendary Archer 10125, 1001 AM Yes, the base dmg of the claw is higher the closer you are to the enemy ugh so that means regardless, Ill have to go with thor, maybe ",
      "damage dealth to you back to the enemy at ring of agony range At mithical 1 June 19, 2025 fylopian STFC Senior Archer 61925, 836 AM im oracle build, with a legendary 2 Beam Staff. For PVP should i sti",
      "crit (edited) thulhu ARC2 i run xbow so I go meteor  elemental crit (edited) Willalt  Elite Archer 10125, 511 AM how is that going for you? Im planning on this as well currently have 2 blue copies of ",
      "crit rate especially if you dont have pans flute Also, even though the crit ratedmg multis on gear are written in such a way to indicate they are global sources, they are actually main weapon Willalt ",
      "crit (edited) murvy Legendary Archer 10125, 758 AM How much base crit and crit dmg you have? How much base crit and crit dmg you have? Kaithulhu ARC2 Chat Mod 10125, 843 AM no idea thulhu ARC2 no idea",
      "damage. sword is but only if you got the right skil. the strike gains element. for some reason it triggers explosion more. I prefer cats over dogs feet Archer Booster 10525, 659 PM Sunday, October 5, ",
      "damage, its for seal Anything else than main weapon attacks is not good against bosses 1 including meteors Tryhard Cat MOP more diagonals basically triplicates your damage, its for seal Dragon Senior ",
      "crits which happens so frequently that its basically only limited by the cooldown of the skin mrplonker Novice Explorer 1025 AM Tuesday, October 7, 2025 at 1025 AM I see, so you use otta as the base h",
      "crit rate especially if you dont have pans flute Also, even though the crit ratedmg multis on gear are written in such a way to indicate they are global sources, they are actually main weapon Willalt ",
      "crit (edited) murvy Legendary Archer 10125, 758 AM Wednesday, October 1, 2025 at 758 AM How much base crit and crit dmg you have? How much base crit and crit dmg you have? Kaithulhu ARC2 Chat Mod 1012",
      "dragoon gear. Would probably get thors mjolnir skin or the oracle spear one. You really think i should pass and just get the lower tier skins? i dont have otta unlocked but helix is almost max Sebiias",
      "Dragoon build help That being said! Maybe that highlights just how bad Oracle is in Arena September 21, 2025 Balakin1 Senior Archer 92125, 1221 AM yeah its hard to blame the thread there Mahoney  P900",
      "Dragoon set is recommended for PvP? Most recommend Griffin I thought. But then some guides say to mix and match some pieces no matter what gear set. ARC2 Is this still valid? Dragoon set is recommende",
      "pvp Sebiias Tryhard Cat MOP Range Master Yesterday at 928 AM Keep upgrading otta nian Tryhard Cat MOP I see you keep saying both the Thor skins are bad. I was just saving up to buy the first one but n",
      "pvp Shadowfax88 Legendary Archer 10125, 534 AM Its still very good without it. She was the best pvp resoskin even before the potion etched was released 1 Legendary is fairly significant upgrade over e",
      "pvp build so I cant say for sure resilience vs guardian but my gut feeling would lean towards guardian (dont make any decisions off this, use at your own risk. ) (edited) 1 extremelyaverage Senior Arc",
      "Arena September 21, 2025 Balakin1 Senior Archer 92125, 1221 AM yeah its hard to blame the thread there Mahoney  P90015575 Elite Archer 92125, 224 AM I wish all these theorycrafting threads were locked",
      "dragoon set tho 65 Stumpy whats so good about duck helix? Is it an extra revive? Sebiias Tryhard Cat MOP Range Master Yesterday at 758 AM Monday, October 6, 2025 at 758 AM Its cheap and as shadow said",
      "dragoons October 7, 2025 mrplonker Novice Explorer 943 AM Tuesday, October 7, 2025 at 943 AM why is nian otta recommended so much? is otta used in pve or pvp? why is nian otta recommended so much? is ",
      "Dragoon build help That being said! Maybe that highlights just how bad Oracle is in Arena September 21, 2025 Balakin1 Senior Archer 92125, 1221 AM Sunday, September 21, 2025 at 1221 AM yeah its hard t",
      "dragoon ring. Ive been rocking the oracle with the added stats. Should I switch to Griffin for pvp? Marv Senior Archer Yesterday at 1147 AM Monday, October 6, 2025 at 1147 AM yall think its still wort",
      "Dragoon set is recommended for PvP? Most recommend Griffin I thought. But then some guides say to mix and match some pieces no matter what gear set. ARC2 Is this still valid? Dragoon set is recommende",
      "pvp? why is nian otta recommended so much? is otta used in pve or pvp? Shadowfax88 Legendary Archer 1022 AM Tuesday, October 7, 2025 at 1022 AM PvP primarily. His 2 skill is 40% crit rate60% crit dmg ",
      "pvp Shadowfax88 Legendary Archer 10125, 534 AM Wednesday, October 1, 2025 at 534 AM Its still very good without it. She was the best pvp resoskin even before the potion etched was released 1 Legendary",
      "Arena September 21, 2025 Balakin1 Senior Archer 92125, 1221 AM Sunday, September 21, 2025 at 1221 AM yeah its hard to blame the thread there Mahoney  P90015575 Elite Archer 92125, 224 AM Sunday, Septe",
      "dragoon is best for pvp. Chaotic griffin is the best set but a mixed set is even better particularly chaotic oracle chestchaotic griffin amulet combo Oracle is generally the worst pvp set but if you a",
      "dragoon is best for pvp. Chaotic griffin is the best set but a mixed set is even better particularly chaotic oracle chestchaotic griffin amulet combo Oracle is generally the worst pvp set but if you a",
      "dragoon ring. Ive been rocking the oracle with the added stats. Should I switch to Griffin for pvp? Marv Senior Archer Yesterday at 1147 AM Monday, October 6, 2025 at 1147 AM yall think its still wort",
      "pvp? Marv Senior Archer Yesterday at 1147 AM Monday, October 6, 2025 at 1147 AM yall think its still worth to go mixed? I have oracle m2 and both l3 griffin and dragoon",
      "eventually? Sebiias Tryhard Cat MOP Range Master 728 AM each skin is individual between each other and their prices stay the same amount for every purchase mob Novice Explorer 731 AM roger that. appre",
      "event chests day 1 just keep 75 and spend all extras October 2, 2025 Mahoney  P90015575 Elite Archer 10225, 1207 AM Its not only the key amount, but also key replenishment rate October 3, 2025 TodoNuD",
      "event, should I focus on L potion etched too? Or would L aoe, ele crit and meteor be enough? Ottas 2 ability is a main weapon crit ratedmg multi not global just like gear is (edited) Kaithulhu ARC2 Ch",
      "event chests day 1 just keep 75 and spend all extras October 2, 2025 Mahoney  P90015575 Elite Archer 10225, 1207 AM Thursday, October 2, 2025 at 1207 AM Its not only the key amount, but also key reple",
      "eventing me from gaining the 3rd star  EasyVictor ARC2 Senior Archer 52025, 947 PM Tuesday, May 20, 2025 at 947 PM Any other boss you need I have access to? Ask the rest are fairly simple. This one is",
      "events someone from sniping you and dropping you in the rankings after you have improved your rankings. And since the arena becomes unplayable 10 minutes before the daily reset, it is recommended to s",
      "events now) and all messages deleted so you go straight to numero uno 1 We can discuss in archero-2 or whatnot thulhu ARC2 ported over success rate tool to an ok UI. Josiias F2P Cat MOP PONY Archero 2",
      "events someone from sniping you and dropping you in the rankings after you have improved your rankings. And since the arena becomes unplayable 10 minutes before the daily reset, it is recommended to s",
      "events now) and all messages deleted so you go straight to numero uno 1 We can discuss in archero-2 or whatnot thulhu ARC2 ported over success rate tool to an ok UI. Josiias F2P Cat MOP PONY Archero 2",
      "events (maybe June) except Scythe and archer close range is good  for Help D ARC2 get circle etched(pulsing orb) in fishing events (maybe June) xWake Junior Archer 52525, 801 AM Thanks! 1 May 26, 2025",
      "events におん It is necessary to consider that data is statistically unreliable unless it is consecutive data from the same user. Pontus Chat Mod 9325, 1039 PM Its not unreliable just because of differen",
      "event, including missions, stores! Pontus Chat Mod 42725, 1018 PM Tickets  83.35Weight(kg) (edited) Pontus Chat Mod 42725, 1018 PM Tickets  83.35Weight(kg) (edited) Tickets  83.35Weight(kg) (edited) E",
      "events (maybe June) except Scythe and archer close range is good  for Help D ARC2 get circle etched(pulsing orb) in fishing events (maybe June) xWake Junior Archer 52525, 801 AM Sunday, May 25, 2025 a",
      "events におん It is necessary to consider that data is statistically unreliable unless it is consecutive data from the same user. Pontus Chat Mod 9325, 1039 PM Wednesday, September 3, 2025 at 1039 PM Its",
      "event, including missions, stores! Pontus Chat Mod 42725, 1018 PM Sunday, April 27, 2025 at 1018 PM Tickets  83.35Weight(kg) (edited) Tuesday, April 29, 2025 at 911 AM Pontus Chat Mod 42725, 1018 PM S"
    ],
    "confidence_scores": [
      1.0,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.98,
      0.98,
      0.66,
      0.66,
      0.66,
      0.66,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.8799999999999999,
      1.0,
      0.8799999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.8799999999999999,
      0.8799999999999999,
      0.8799999999999999,
      0.8799999999999999,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      0.8799999999999999,
      0.8799999999999999,
      0.8799999999999999,
      0.8799999999999999,
      0.9999999999999999,
      0.8999999999999999,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      0.9999999999999999,
      0.8999999999999999,
      1.0,
      1.0,
      0.9999999999999999,
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      0.7999999999999999,
      0.9999999999999999,
      0.8999999999999999,
      1.0,
      0.7,
      1.0,
      1.0,
      0.9999999999999999,
      0.7999999999999999,
      0.9999999999999999,
      1.0,
      0.8999999999999999,
      1.0,
      0.7,
      1.0,
      1.0,
      0.98,
      0.8799999999999999,
      0.8799999999999999,
      0.98,
      0.8799999999999999,
      0.8799999999999999,
      0.8799999999999999,
      0.66,
      0.9999999999999999,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      0.8999999999999999,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      0.8999999999999999,
      1.0,
      0.9999999999999999,
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      0.9999999999999999,
      0.9999999999999999,
      1.0,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      0.6799999999999999,
      0.6799999999999999,
      0.66,
      0.45999999999999996,
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      0.8799999999999999,
      0.8799999999999999,
      0.8799999999999999,
      0.8799999999999999,
      1.0,
      0.66,
      0.66,
      1.0,
      0.66,
      0.66
    ],
    "sources": [
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "upgrade_requirements.json",
      "upgrade_requirements.json",
      "upgrade_requirements.json",
      "upgrade_requirements.json",
      "upgrade_requirements.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json"
    ],
    "avg_confidence": 0.9557512953367875
  },
  "gems": {
    "total_quantity": 575948,
    "mentions": 59,
    "contexts": [
      "Runes 32400 x2  64,800  Rare Etched Rune 9000 Or Epic Blessing Rune 4050 x2  8,100 (edited) BS how much gems do i need to spend to get a etched with golden tickets PaintDryer PoE Hunting Ace 42725, 10",
      "etched Nunyaa Junior Archer 71025, 901 PM Thanks so not much point unless you see these coming up which is still low requirements Thanks so not much point unless you see these coming up which is still",
      "Runes 32400 x2  64,800  Rare Etched Rune 9000 Or Epic Blessing Rune 4050 x2  8,100 (edited) BS how much gems do i need to spend to get a etched with golden tickets PaintDryer PoE Hunting Ace 42725, 10",
      "runes are appreciated. Would like if it got an explanation as well HeneralDiddoy ARC2 Novice Explorer 81625, 1013 AM Which hero should I star up first? Dracoola or Rolla. I have 6 star helix September",
      "Runes 32400 x2  64,800  Rare Etched Rune 9000 Or Epic Blessing Rune 4050 x2  8,100 (edited) Sunday, April 27, 2025 at 1049 PM BS how much gems do i need to spend to get a etched with golden tickets Pa",
      "etched Nunyaa Junior Archer 71025, 901 PM Thursday, July 10, 2025 at 901 PM Thanks so not much point unless you see these coming up which is still low requirements Thanks so not much point unless you ",
      "Runes 32400 x2  64,800  Rare Etched Rune 9000 Or Epic Blessing Rune 4050 x2  8,100 (edited) Sunday, April 27, 2025 at 1049 PM BS how much gems do i need to spend to get a etched with golden tickets Pa",
      "runes are appreciated. Would like if it got an explanation as well HeneralDiddoy ARC2 Novice Explorer 81625, 1013 AM Saturday, August 16, 2025 at 1013 AM Which hero should I star up first? Dracoola or",
      "etched , 22.8k gems , 596 lures (444 free  152 from gems) , 1946.8 kg , damnn... i wasted 300 gems. forgot we get 2 more baits tmr. (edited) Pontus Chat Mod 43025, 632 PM Wait couldnt you get another ",
      "etched , 22.8k gems , 596 lures (444 free  152 from gems) , 1946.8 kg , damnn... i wasted 300 gems. forgot we get 2 more baits tmr. (edited) Wednesday, April 30, 2025 at 636 PM Pontus Chat Mod 43025, ",
      "level carry over. 1 B3RMAN Senior Archer 7725, 943 PM Demon event Luck level carry over. 1 Demon event Luck level carry over. Demon event Luck level carry over. Sebiias Tryhard Cat MOP Range Master 77",
      "Chapter AoE  OrbsElemental Seal  Invasion AoE  OrbsOldSprite (If legendary) PVP OldSprite  NewSprite (or Meteor ) randomplaya Nurezu Hunting Ace 92225, 640 PM This is kurdated outdated I think They do",
      "level carry over. 1 B3RMAN Senior Archer 7725, 943 PM Monday, July 7, 2025 at 943 PM Demon event Luck level carry over. 1 Demon event Luck level carry over. Demon event Luck level carry over. Sebiias ",
      "level, your gear or set, even with a suboptimal build, a good main weapon skill selection is gonna deal 70 to 90% of your total damage Tryhard Cat MOP No matter at what level, your gear or set, even w",
      "pvp Sebiias Tryhard Cat MOP Range Master Yesterday at 928 AM Keep upgrading otta nian 4 stars is the goal Every star on nian otta is better than either of the two thor skins Tryhard Cat MOP Keep upgra",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "pvp? why is nian otta recommended so much? is otta used in pve or pvp? Shadowfax88 Legendary Archer 1022 AM Tuesday, October 7, 2025 at 1022 AM PvP primarily. His 2 skill is 40% crit rate60% crit dmg ",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "bests (edited) If you arent full mythic gear yet, then its better to get keys nani Novice Explorer 711 AM Hmm any clue how the razor starcores for weapons work in the first place? Do you buy the rare ",
      "pve or pvp? why is nian otta recommended so much? is otta used in pve or pvp? Shadowfax88 Legendary Archer 1022 AM Tuesday, October 7, 2025 at 1022 AM PvP primarily. His 2 skill is 40% crit rate60% cr",
      "best pvp resoskin even before the potion etched was released 1 Legendary is fairly significant upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it give",
      "Thor in resonance no, for PvP ur using otta with skin and thor, with helix 6 stars Therefore, duck helix 1 star is good enough and the new helix skin is also fairly good for PvP when they fix it Tryha",
      "resonance. Cause im always gonna slot Thor in resonance Tryhard Cat MOP Keep upgrading otta nian HundredArms Novice Explorer Yesterday at 931 AM What about after that? Also is nians base skills a must",
      "otta as the base hero in pvp? What resonance do you use? I see, so you use otta as the base hero in pvp? What resonance do you use? Shadowfax88 Legendary Archer 1051 AM Tuesday, October 7, 2025 at 105",
      "character in resonance slot one. I use Helix with Otta and Thor as resonance mrplonker Novice Explorer 1053 AM Tuesday, October 7, 2025 at 1053 AM Ohh damn I didnt know about that sacred hall thing th",
      "resonance slot one. I use Helix with Otta and Thor as resonance mrplonker Novice Explorer 1053 AM Tuesday, October 7, 2025 at 1053 AM Ohh damn I didnt know about that sacred hall thing thats huge, tha",
      "oracle spear one. You really think i should pass and just get the lower tier skins? i dont have otta unlocked but helix is almost max Sebiias Tryhard Cat MOP Range Master 727 AM Unlocking otta and her",
      "gear are written in such a way to indicate they are global sources, they are actually main weapon Willalt  Elite Archer 10125, 534 AM oh I did not know lucky shadow gives elementals base crit I see. I",
      "gear to key ratio. Sepetate forms for chroma and mythstone chests below. Poosti Wiki Contributor 9225, 1035 AM Data collection for S gear to key ratio. Sepetate forms for chroma and mythstone chests b",
      "oracle because u can drop invic potions and those give you a small chance to beat dragoons October 7, 2025 mrplonker Novice Explorer 943 AM Tuesday, October 7, 2025 at 943 AM why is nian otta recommen",
      "gear are written in such a way to indicate they are global sources, they are actually main weapon Willalt  Elite Archer 10125, 534 AM Wednesday, October 1, 2025 at 534 AM oh I did not know lucky shado",
      "gear to key ratio. Sepetate forms for chroma and mythstone chests below. Poosti Wiki Contributor 9225, 1035 AM Tuesday, September 2, 2025 at 1035 AM Data collection for S gear to key ratio. Sepetate f",
      "staff. 1 April 30, 2025 Rods only make it easier to catch. I was informed by habby staff. Zilla Senior Archer 43025, 814 AM Thanks! Pontus Chat Mod 43025, 522 PM Ending at 1303.14 KG -13 Legendary Tic",
      "staff. 1 April 30, 2025 Rods only make it easier to catch. I was informed by habby staff. Zilla Senior Archer 43025, 814 AM Wednesday, April 30, 2025 at 814 AM Thanks! Pontus Chat Mod 43025, 522 PM We",
      "skills a must have for resonance. Cause im always gonna slot Thor in resonance What about after that? Also is nians base skills a must have for resonance. Cause im always gonna slot Thor in resonance ",
      "card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena,",
      "skill is 40% crit rate60% crit dmg after taking hits which is basically constant in PvP. His skin has a chance to drop a potion on crits which happens so frequently that its basically only limited by ",
      "card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena,",
      "upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it gives elementals a base crit rate of 10% (i believe but I could be mistaken). Youll most likely hav",
      "upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it gives elementals a base crit rate of 10% (i believe but I could be mistaken). Youll most likely hav",
      "damage to 122mil so far 1 Thank you .𝐊𝐚𝐫𝐦𝐚𝐭𝐢𝐜. VOID It helped a lot. Went from 40mil damage to 122mil so far Nadnerb Legendary Archer Yesterday at 213 AM nws u need some healing to keep ur hp above 10",
      "crit (edited) thulhu ARC2 i run xbow so I go meteor  elemental crit (edited) Willalt  Elite Archer 10125, 511 AM how is that going for you? Im planning on this as well currently have 2 blue copies of ",
      "crit rate especially if you dont have pans flute Also, even though the crit ratedmg multis on gear are written in such a way to indicate they are global sources, they are actually main weapon Willalt ",
      "damage. sword is but only if you got the right skil. the strike gains element. for some reason it triggers explosion more. I prefer cats over dogs feet Archer Booster 10525, 659 PM Sunday, October 5, ",
      "crits which happens so frequently that its basically only limited by the cooldown of the skin mrplonker Novice Explorer 1025 AM Tuesday, October 7, 2025 at 1025 AM I see, so you use otta as the base h",
      "crit rate especially if you dont have pans flute Also, even though the crit ratedmg multis on gear are written in such a way to indicate they are global sources, they are actually main weapon Willalt ",
      "dragoon gear. Would probably get thors mjolnir skin or the oracle spear one. You really think i should pass and just get the lower tier skins? i dont have otta unlocked but helix is almost max Sebiias",
      "Dragoon set is recommended for PvP? Most recommend Griffin I thought. But then some guides say to mix and match some pieces no matter what gear set. ARC2 Is this still valid? Dragoon set is recommende",
      "pvp Sebiias Tryhard Cat MOP Range Master Yesterday at 928 AM Keep upgrading otta nian Tryhard Cat MOP I see you keep saying both the Thor skins are bad. I was just saving up to buy the first one but n",
      "pvp Shadowfax88 Legendary Archer 10125, 534 AM Its still very good without it. She was the best pvp resoskin even before the potion etched was released 1 Legendary is fairly significant upgrade over e",
      "Arena September 21, 2025 Balakin1 Senior Archer 92125, 1221 AM yeah its hard to blame the thread there Mahoney  P90015575 Elite Archer 92125, 224 AM I wish all these theorycrafting threads were locked",
      "dragoon set tho 65 Stumpy whats so good about duck helix? Is it an extra revive? Sebiias Tryhard Cat MOP Range Master Yesterday at 758 AM Monday, October 6, 2025 at 758 AM Its cheap and as shadow said",
      "dragoons October 7, 2025 mrplonker Novice Explorer 943 AM Tuesday, October 7, 2025 at 943 AM why is nian otta recommended so much? is otta used in pve or pvp? why is nian otta recommended so much? is ",
      "Dragoon set is recommended for PvP? Most recommend Griffin I thought. But then some guides say to mix and match some pieces no matter what gear set. ARC2 Is this still valid? Dragoon set is recommende",
      "pvp? why is nian otta recommended so much? is otta used in pve or pvp? Shadowfax88 Legendary Archer 1022 AM Tuesday, October 7, 2025 at 1022 AM PvP primarily. His 2 skill is 40% crit rate60% crit dmg ",
      "pvp Shadowfax88 Legendary Archer 10125, 534 AM Wednesday, October 1, 2025 at 534 AM Its still very good without it. She was the best pvp resoskin even before the potion etched was released 1 Legendary",
      "Arena September 21, 2025 Balakin1 Senior Archer 92125, 1221 AM Sunday, September 21, 2025 at 1221 AM yeah its hard to blame the thread there Mahoney  P90015575 Elite Archer 92125, 224 AM Sunday, Septe",
      "eventually? Sebiias Tryhard Cat MOP Range Master 728 AM each skin is individual between each other and their prices stay the same amount for every purchase mob Novice Explorer 731 AM roger that. appre",
      "event, should I focus on L potion etched too? Or would L aoe, ele crit and meteor be enough? Ottas 2 ability is a main weapon crit ratedmg multi not global just like gear is (edited) Kaithulhu ARC2 Ch"
    ],
    "confidence_scores": [
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.66,
      0.66,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      0.9999999999999999,
      0.9999999999999999,
      0.9999999999999999,
      0.9999999999999999,
      0.9999999999999999,
      0.8999999999999999,
      1.0,
      0.9999999999999999,
      0.8999999999999999,
      1.0,
      0.8799999999999999,
      0.8799999999999999,
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      0.8999999999999999,
      1.0,
      0.9999999999999999,
      0.8999999999999999,
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      0.9999999999999999,
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      0.9999999999999999,
      0.9999999999999999
    ],
    "sources": [
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "upgrade_requirements.json",
      "upgrade_requirements.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "events_modes.json",
      "events_modes.json"
    ],
    "avg_confidence": 0.9776271186440678
  },
  "lures": {
    "total_quantity": 33214,
    "mentions": 22,
    "contexts": [
      "Runes 32400 x2  64,800  Rare Etched Rune 9000 Or Epic Blessing Rune 4050 x2  8,100 (edited) BS how much gems do i need to spend to get a etched with golden tickets PaintDryer PoE Hunting Ace 42725, 10",
      "Runes 32400 x2  64,800  Rare Etched Rune 9000 Or Epic Blessing Rune 4050 x2  8,100 (edited) BS how much gems do i need to spend to get a etched with golden tickets PaintDryer PoE Hunting Ace 42725, 10",
      "runes are appreciated. Would like if it got an explanation as well HeneralDiddoy ARC2 Novice Explorer 81625, 1013 AM Which hero should I star up first? Dracoola or Rolla. I have 6 star helix September",
      "Runes 32400 x2  64,800  Rare Etched Rune 9000 Or Epic Blessing Rune 4050 x2  8,100 (edited) Sunday, April 27, 2025 at 1049 PM BS how much gems do i need to spend to get a etched with golden tickets Pa",
      "Runes 32400 x2  64,800  Rare Etched Rune 9000 Or Epic Blessing Rune 4050 x2  8,100 (edited) Sunday, April 27, 2025 at 1049 PM BS how much gems do i need to spend to get a etched with golden tickets Pa",
      "runes are appreciated. Would like if it got an explanation as well HeneralDiddoy ARC2 Novice Explorer 81625, 1013 AM Saturday, August 16, 2025 at 1013 AM Which hero should I star up first? Dracoola or",
      "etched with golden tickets PaintDryer PoE Hunting Ace 42725, 1037 PM Around 25k? April 28, 2025 Original message was deleted Pontus Chat Mod 42825, 1252 AM Thats surprising. Around 2 below avg 1 zaddy",
      "etched , 22.8k gems , 596 lures (444 free  152 from gems) , 1946.8 kg , damnn... i wasted 300 gems. forgot we get 2 more baits tmr. (edited) Pontus Chat Mod 43025, 632 PM Wait couldnt you get another ",
      "etched with golden tickets PaintDryer PoE Hunting Ace 42725, 1037 PM Sunday, April 27, 2025 at 1037 PM Around 25k? April 28, 2025 Original message was deleted Pontus Chat Mod 42825, 1252 AM Monday, Ap",
      "etched , 22.8k gems , 596 lures (444 free  152 from gems) , 1946.8 kg , damnn... i wasted 300 gems. forgot we get 2 more baits tmr. (edited) Wednesday, April 30, 2025 at 636 PM Pontus Chat Mod 43025, ",
      "Chapter AoE  OrbsElemental Seal  Invasion AoE  OrbsOldSprite (If legendary) PVP OldSprite  NewSprite (or Meteor ) randomplaya Nurezu Hunting Ace 92225, 640 PM This is kurdated outdated I think They do",
      "level, your gear or set, even with a suboptimal build, a good main weapon skill selection is gonna deal 70 to 90% of your total damage Tryhard Cat MOP No matter at what level, your gear or set, even w",
      "gear to key ratio. Sepetate forms for chroma and mythstone chests below. Poosti Wiki Contributor 9225, 1035 AM Data collection for S gear to key ratio. Sepetate forms for chroma and mythstone chests b",
      "gear to key ratio. Sepetate forms for chroma and mythstone chests below. Poosti Wiki Contributor 9225, 1035 AM Tuesday, September 2, 2025 at 1035 AM Data collection for S gear to key ratio. Sepetate f",
      "staff. 1 April 30, 2025 Rods only make it easier to catch. I was informed by habby staff. Zilla Senior Archer 43025, 814 AM Thanks! Pontus Chat Mod 43025, 522 PM Ending at 1303.14 KG -13 Legendary Tic",
      "staff. 1 April 30, 2025 Rods only make it easier to catch. I was informed by habby staff. Zilla Senior Archer 43025, 814 AM Wednesday, April 30, 2025 at 814 AM Thanks! Pontus Chat Mod 43025, 522 PM We",
      "card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena,",
      "card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena,",
      "Dragoon set is recommended for PvP? Most recommend Griffin I thought. But then some guides say to mix and match some pieces no matter what gear set. ARC2 Is this still valid? Dragoon set is recommende",
      "Arena September 21, 2025 Balakin1 Senior Archer 92125, 1221 AM yeah its hard to blame the thread there Mahoney  P90015575 Elite Archer 92125, 224 AM I wish all these theorycrafting threads were locked",
      "Dragoon set is recommended for PvP? Most recommend Griffin I thought. But then some guides say to mix and match some pieces no matter what gear set. ARC2 Is this still valid? Dragoon set is recommende",
      "Arena September 21, 2025 Balakin1 Senior Archer 92125, 1221 AM Sunday, September 21, 2025 at 1221 AM yeah its hard to blame the thread there Mahoney  P90015575 Elite Archer 92125, 224 AM Sunday, Septe"
    ],
    "confidence_scores": [
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.66,
      0.66,
      0.66,
      0.66,
      1.0,
      1.0,
      1.0,
      1.0,
      0.8799999999999999,
      0.8799999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0
    ],
    "sources": [
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "boss_guides.json",
      "boss_guides.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "talent_cards.json",
      "talent_cards.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json"
    ],
    "avg_confidence": 0.9272727272727272
  },
  "shards": {
    "total_quantity": 41780,
    "mentions": 61,
    "contexts": [
      "Rune Fusion , , unknown Player Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level ",
      "Rune Fusion , , unknown Player Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level ",
      "runes after helix 6 October 2, 2025 Urag Novice Explorer 10225, 523 AM Aight, ty ty fylopian STFC Senior Archer 10225, 1024 AM is it worth it to level up Otta past 2. I can get 5 a week from guild exp",
      "runes are appreciated. Would like if it got an explanation as well HeneralDiddoy ARC2 Novice Explorer 81625, 1013 AM Which hero should I star up first? Dracoola or Rolla. I have 6 star helix September",
      "Rune Fusion , , unknown Player Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level ",
      "Rune Fusion , , unknown Player Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level ",
      "rune shop every week Ty the Squirtle Squirt Elite Archer 10225, 651 PM Thursday, October 2, 2025 at 651 PM Yupp, I grab a good portion of the rune shop every week Yupp, I grab a good portion of the ru",
      "rune tab? DELTADavus Senior Archer 10325, 350 AM Friday, October 3, 2025 at 350 AM lets do it in DMs (edited) Friday, October 3, 2025 at 350 AM 1 十 Father Steve  国语MOD ARC2 Chat Mod 10325, 1033 AM Fri",
      "runes are appreciated. Would like if it got an explanation as well HeneralDiddoy ARC2 Novice Explorer 81625, 1013 AM Saturday, August 16, 2025 at 1013 AM Which hero should I star up first? Dracoola or",
      "boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star  EasyVictor ARC2 Senior Archer 52025, 947 PM Any other boss you need I ",
      "level up Otta past 2. I can get 5 a week from guild expedition Shadowfax88 Legendary Archer 10225, 1042 AM No, not particularly useful. You get an extra 4% crit rate at his 4 passive but I doubt its w",
      "chapters. Just guessing isnt an option, so I just excluded it (edited) For bombs and Jungle giant arrow we dont have the numbers, and I doubt someone will test it as the mode isnt hard as long as you ",
      "boss for tower 1050? I think I have to move perpendicular to the direction he jumps on me, bc he must kill all in his jump path. Previous versions of this boss ones seem to just jump high and land in ",
      "Boss Damage Its the third chart Shultin Its the third chart Shadowfax88 Legendary Archer Yesterday at 1154 PM Monday, October 6, 2025 at 1154 PM Ah, I see. I feel like my testing was showing something",
      "chapters. Just guessing isnt an option, so I just excluded it (edited) Monday, July 14, 2025 at 1058 AM For bombs and Jungle giant arrow we dont have the numbers, and I doubt someone will test it as t",
      "Boss Damage Its the third chart Shultin Its the third chart Shadowfax88 Legendary Archer Yesterday at 1154 PM Monday, October 6, 2025 at 1154 PM Ah, I see. I feel like my testing was showing something",
      "bosses, 2 is for pvp. But now days otta may not be a bad investment cause guild wars giving 5 pieces per week. In months everyone will have 6 otta RB773 Mythic Archer Yesterday at 1009 AM Monday, Octo",
      "pvp wirh what I got ? what people? crustybutt Junior Archer 10325, 342 PM i hear a lot more about oracle with xbow than with claw For the synergy between chaotic griffin neck (drops hearts) and chaoti",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "pvp build so I cant say for sure resilience vs guardian but my gut feeling would lean towards guardian (dont make any decisions off this, use at your own risk. ) (edited) Wednesday, October 1, 2025 at",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "Chapter 32, wave 30.  Defeated at 150k power  This boss always spins counterclockwise and shoots counterclockwise at the end of his spin. (Same direction as circles)  For now, not sure of a better way",
      "Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level 55. There are two sets of talen",
      "Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level 55. There are two sets of talen",
      "pve bosses, 2 is for pvp. But now days otta may not be a bad investment cause guild wars giving 5 pieces per week. In months everyone will have 6 otta extremelyaverage Senior Archer 10325, 1037 AM Fri",
      "Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level 55. There are two sets of talen",
      "Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level 55. There are two sets of talen",
      "otta keep moving and only attack during punches cuz his pounce is p fast. does 3 punches where you wanna dodge leftright. the pounce you want to walk away for more time tododge fireballs I forgot what",
      "Character , Shards required for 0-8 5050100100150150200300500 For example 200 Shards required for 56 questions Artifact , , Mythic 0-8 -10 Shards 9-14 -20 Shards 15 -30 Shards 50% of the base stats ea",
      "Otta is 0-1 is bad 2 very good 3 not worth it D SamCute ARC2 Senior Archer 10325, 345 AM Friday, October 3, 2025 at 345 AM Can you give me advise about my resonance and my rune tab? ARC2 Can you give ",
      "characters? And I get that we wont know until someone physically tries it does that include rune enchantments? yeah assist 2. So global crit would be your base artifacts and does not include weapon cr",
      "resonance and my rune tab? ARC2 Can you give me advise about my resonance and my rune tab? DELTADavus Senior Archer 10325, 350 AM Friday, October 3, 2025 at 350 AM lets do it in DMs (edited) Friday, O",
      "Character , Shards required for 0-8 5050100100150150200300500 For example 200 Shards required for 56 questions Artifact , , Mythic 0-8 -10 Shards 9-14 -20 Shards 15 -30 Shards 50% of the base stats ea",
      "oracle amulet, griffin ring, oracle chest, dragoon helm, oracle boots (all M0-M2) Can I ask why griffin ring with xbow? Can xbow crit? Can I ask why griffin ring with xbow? Can xbow crit? Shadowfax88 ",
      "gear in the game unless you have maxed leg wep skin Hybridreamer Junior Archer Yesterday at 810 PM Those are strong words lok its one of the most useless gear in the game Hybridreamer Junior Archer Ye",
      "GearRune Fusion , , unknown Player Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to le",
      "GearRune Fusion , , unknown Player Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to le",
      "oracle chest to replace my griffin piece. Debating if i should replace the helm too RB773 Mythic Archer 10125, 813 PM Wednesday, October 1, 2025 at 813 PM If you have mythic circle runes, I think the ",
      "gear in the game unless you have maxed leg wep skin Hybridreamer Senior Archer 10425, 810 PM Saturday, October 4, 2025 at 810 PM Those are strong words lok its one of the most useless gear in the game",
      "GearRune Fusion , , unknown Player Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to le",
      "GearRune Fusion , , unknown Player Level , , Spreasheet for Required XP Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to le",
      "Skills 71325, 810 AM Kaithulhu ARC2 Chat Mod 71325, 811 AM Thank you for the hard work! Kaithulhu ARC2 Chat Mod 71325, 811 AM Thank you for the hard work! Thank you for the hard work! iso Elite Archer",
      "passive but I doubt its worth it for the extra 250 shards it would cost. If you already have the etched and blessings runes that you need, it would basically be the equivalent of 900 enchant rolls fro",
      "talent cards at each milestone   40  45  50  55    582k  682k  782k  2285k   archero-2 (edited) 4 Follow June 1, 2025 Pontus Chat Mod 6125, 734 AM  for Help D 0 also requires 50 shards (should probabl",
      "talent cards at each milestone   40  45  50  55    582k  682k  782k  2285k   archero-2 (edited) Pontus Chat Mod 6125, 734 AM  for Help D 0 also requires 50 shards (should probably include that) Pontus",
      "Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level 55. There are two sets of talents, with the second set becoming avai",
      "Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level 55. There are two sets of talents, with the second set becoming avai",
      "Skills 71325, 810 AM Sunday, July 13, 2025 at 810 AM Kaithulhu ARC2 Chat Mod 71325, 811 AM Sunday, July 13, 2025 at 811 AM Thank you for the hard work! Kaithulhu ARC2 Chat Mod 71325, 811 AM Sunday, Ju",
      "talent cards at each milestone   40  45  50  55    582k  682k  782k  2285k   archero-2 (edited) Tuesday, July 15, 2025 at 504 AM 4 Follow Add this post to your channel list and receive notifications a",
      "talent cards at each milestone   40  45  50  55    582k  682k  782k  2285k   archero-2 (edited) Tuesday, July 15, 2025 at 504 AM Pontus Chat Mod 6125, 734 AM Sunday, June 1, 2025 at 734 AM  for Help D",
      "Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level 55. There are two sets of talents, with the second set becoming avai",
      "Talent , , Spreasheet for Required GoldPlayer Level Additional talent cards can be unlocked at every 5-level milestone, up to level 55. There are two sets of talents, with the second set becoming avai",
      "level 55. There are two sets of talents, with the second set becoming available at level 35. Below is the cost to fully max talent cards at each milestone   40  45  50  55    582k  682k  782k  2285k  ",
      "level 55. There are two sets of talents, with the second set becoming available at level 35. Below is the cost to fully max talent cards at each milestone   40  45  50  55    582k  682k  782k  2285k  ",
      "level 5 , dont know if you have that kind of budget tho might even be good for PVP October 6, 2025 NEW Ty the Squirtle Squirt Elite Archer Yesterday at 459 PM Monday, October 6, 2025 at 459 PM Any new",
      "level 55. There are two sets of talents, with the second set becoming available at level 35. Below is the cost to fully max talent cards at each milestone   40  45  50  55    582k  682k  782k  2285k  ",
      "damage to 122mil so far 1 Thank you .𝐊𝐚𝐫𝐦𝐚𝐭𝐢𝐜. VOID It helped a lot. Went from 40mil damage to 122mil so far Nadnerb Legendary Archer Yesterday at 213 AM nws u need some healing to keep ur hp above 10",
      "crit rate at his 4 passive but I doubt its worth it for the extra 250 shards it would cost. If you already have the etched and blessings runes that you need, it would basically be the equivalent of 90",
      "pvp build question. What would be better for griffin build. 7 star helix with max ducklix skin, 2 star otta with max nian skin, and 6 star thor. Or 6 star thor with 0 star old skin not new, 2 star ott",
      "pvp build so I cant say for sure resilience vs guardian but my gut feeling would lean towards guardian (dont make any decisions off this, use at your own risk. ) (edited) Wednesday, October 1, 2025 at",
      "eventing me from gaining the 3rd star  EasyVictor ARC2 Senior Archer 52025, 947 PM Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from"
    ],
    "confidence_scores": [
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.8999999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.8999999999999999,
      0.8999999999999999,
      1.0,
      0.8999999999999999,
      0.8999999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      0.8999999999999999,
      1.0,
      1.0,
      1.0,
      0.7,
      1.0,
      0.9999999999999999,
      1.0,
      0.7,
      1.0,
      1.0,
      1.0,
      0.7,
      0.7,
      0.7,
      1.0,
      1.0,
      0.7,
      0.7,
      0.7,
      1.0,
      0.7,
      0.7,
      1.0,
      0.7,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0
    ],
    "sources": [
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "upgrade_requirements.json",
      "upgrade_requirements.json",
      "upgrade_requirements.json",
      "upgrade_requirements.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "events_modes.json"
    ],
    "avg_confidence": 0.9360655737704919
  },
  "cores": {
    "total_quantity": 1284,
    "mentions": 60,
    "contexts": [
      "Etched Meteor split Sprites awe Elemental crit 1 1 Left side Flamenox Frostshock Giant meteor Meteor potion Right side Frostshock Healing sprite Star of time Star of fury Blessings Lucky shadow Revive",
      "etched Nunyaa Junior Archer 71025, 901 PM Thanks so not much point unless you see these coming up which is still low requirements Thanks so not much point unless you see these coming up which is still",
      "runes meputia Senior Archer 10525, 733 PM Sunday, October 5, 2025 at 733 PM hi guys, for skins, what is the prio for dragoon set for pvp? (otta skin for potione etched or xbow skin) hi guys, for skins",
      "etched Nunyaa Junior Archer 71025, 901 PM Thursday, July 10, 2025 at 901 PM Thanks so not much point unless you see these coming up which is still low requirements Thanks so not much point unless you ",
      "runes for.strike see that explosion damage. sword is but only if you got the right skil. the strike gains element. for some reason it triggers explosion more. I prefer cats over dogs feet Archer Boost",
      "runes and enchants, or would a Meteor build perform better with elemental runes and meteorele crit enchants Which build for arena ? Best enchants Arrow Rain 30% Crit Dmg red.  Sharp arrow 2 bounce6%kr",
      "etched or xbow skin) hi guys, for skins, what is the prio for dragoon set for pvp? (otta skin for potione etched or xbow skin) FreeKilling ARC2 Senior Archer 10525, 735 PM Sunday, October 5, 2025 at 7",
      "level, itd be Tryhard Cat MOP no, mix set is also better for PvP M1LO ARC2 Senior Archer 802 AM Thanks bro , the dragoon hunt begins Ill survey around for the runes build Awesomethanu Senior Archer 82",
      "level carry over. 1 B3RMAN Senior Archer 7725, 943 PM Demon event Luck level carry over. 1 Demon event Luck level carry over. Demon event Luck level carry over. Sebiias Tryhard Cat MOP Range Master 77",
      "level I swapped in my griffin amulet for oracle amulet and I did better in arena Sebiias Tryhard Cat MOP Range Master 10525, 909 AM Sunday, October 5, 2025 at 909 AM about that but it would require yo",
      "level carry over. 1 B3RMAN Senior Archer 7725, 943 PM Monday, July 7, 2025 at 943 PM Demon event Luck level carry over. 1 Demon event Luck level carry over. Demon event Luck level carry over. Sebiias ",
      "pvp right ARC2 Cool , so mix set good for pve but then full dragoon good for pvp right Sebiias Tryhard Cat MOP Range Master 753 AM no, mix set is also better for PvP Full dragoon is better than full o",
      "pvp Sebiias Tryhard Cat MOP Range Master Yesterday at 928 AM Keep upgrading otta nian 4 stars is the goal Every star on nian otta is better than either of the two thor skins Tryhard Cat MOP Keep upgra",
      "Arena, the one that revives first loses unless the other one doesnt proc the revive at all Ty the Squirtle Squirt Elite Archer 92425, 201 AM I mean ya its not insane or anything. The max level for it ",
      "pvp right ARC2 Cool , so mix set good for pve but then full dragoon good for pvp right Sebiias Tryhard Cat MOP Range Master 753 AM no, mix set is also better for PvP Full dragoon is better than full o",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "Pvp beeing griffin Amulett and Ring. Also oracle chest Iirc murvy Legendary Archer 10525, 903 AM Sunday, October 5, 2025 at 903 AM Tryhard Cat MOP  Pvp beeing griffin Amulett and Ring. Also oracle che",
      "pvp? why is nian otta recommended so much? is otta used in pve or pvp? Shadowfax88 Legendary Archer 1022 AM Tuesday, October 7, 2025 at 1022 AM PvP primarily. His 2 skill is 40% crit rate60% crit dmg ",
      "Pvp beeing griffin Amulett and Ring. Also oracle chest Iirc murvy Legendary Archer 10525, 903 AM Sunday, October 5, 2025 at 903 AM Tryhard Cat MOP  Pvp beeing griffin Amulett and Ring. Also oracle che",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "Arena and it helps me stay alive in gvg thulhu ARC2 i run xbow so I go meteor  elemental crit (edited) murvy Legendary Archer 10125, 758 AM How much base crit and crit dmg you have? How much base crit",
      "Arena and it helps me stay alive in gvg thulhu ARC2 i run xbow so I go meteor  elemental crit (edited) murvy Legendary Archer 10125, 758 AM Wednesday, October 1, 2025 at 758 AM How much base crit and ",
      "pve ? Or must have bounce ? ARC2 How is full dragoon set doing in pve ? Sebiias Tryhard Cat MOP Range Master 729 AM Bad, it needs to be mixed with oracle pieces to be the best gear set Tryhard Cat MOP",
      "bests (edited) If you arent full mythic gear yet, then its better to get keys nani Novice Explorer 711 AM Hmm any clue how the razor starcores for weapons work in the first place? Do you buy the rare ",
      "Pvepvp wise Well mythic pvp just full dragon Tryhard Cat MOP Were talking about mythic Shadowfax88 Legendary Archer 10525, 907 AM Sunday, October 5, 2025 at 907 AM I swapped in my griffin amulet for o",
      "pve or pvp? why is nian otta recommended so much? is otta used in pve or pvp? Shadowfax88 Legendary Archer 1022 AM Tuesday, October 7, 2025 at 1022 AM PvP primarily. His 2 skill is 40% crit rate60% cr",
      "best pvp resoskin even before the potion etched was released 1 Legendary is fairly significant upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it give",
      "Thor in resonance no, for PvP ur using otta with skin and thor, with helix 6 stars Therefore, duck helix 1 star is good enough and the new helix skin is also fairly good for PvP when they fix it Tryha",
      "resonance guy, since hes to level and his skills. Especially with legendary revive you can burn down someone else, its a trump card for if both of you revive really. September 24, 2025 the Squirtle Sq",
      "resonance. Cause im always gonna slot Thor in resonance Tryhard Cat MOP Keep upgrading otta nian HundredArms Novice Explorer Yesterday at 931 AM What about after that? Also is nians base skills a must",
      "character to use as the resonance guy, since hes to level and his skills. Especially with legendary revive you can burn down someone else, its a trump card for if both of you revive really. September ",
      "otta skin for potione etched or xbow skin) hi guys, for skins, what is the prio for dragoon set for pvp? (otta skin for potione etched or xbow skin) FreeKilling ARC2 Senior Archer 10525, 735 PM Sunday",
      "otta as the base hero in pvp? What resonance do you use? I see, so you use otta as the base hero in pvp? What resonance do you use? Shadowfax88 Legendary Archer 1051 AM Tuesday, October 7, 2025 at 105",
      "resonance slot one. I use Helix with Otta and Thor as resonance mrplonker Novice Explorer 1053 AM Tuesday, October 7, 2025 at 1053 AM Ohh damn I didnt know about that sacred hall thing thats huge, tha",
      "griffin Amulett and Ring. Also oracle chest Iirc murvy Legendary Archer 903 AM Tryhard Cat MOP  Pvp beeing griffin Amulett and Ring. Also oracle chest Sebiias Tryhard Cat MOP Range Master 904 AM on ch",
      "crossbow skins are the best? Demon Junior Archer Yesterday at 202 PM Any thoughts on which of the 2 crossbow skins are the best? Any thoughts on which of the 2 crossbow skins are the best? The legenda",
      "gear set Tryhard Cat MOP Bad, it needs to be mixed with oracle pieces to be the best gear set M1LO ARC2 Senior Archer 743 AM Ah I see , what are the mixed set pieces ? ARC2 Ah I see , what are the mix",
      "gear are written in such a way to indicate they are global sources, they are actually main weapon Willalt  Elite Archer 10125, 534 AM oh I did not know lucky shadow gives elementals base crit I see. I",
      "weapon ability meputia Senior Archer 10525, 704 PM Sunday, October 5, 2025 at 704 PM yes but its too rare to gett htat meputia Senior Archer 10525, 715 PM Sunday, October 5, 2025 at 715 PM wasted etch",
      "gear set murvy Legendary Archer 10525, 855 AM Sunday, October 5, 2025 at 855 AM Amulett, ring, chest? Boots too? Sebiias Tryhard Cat MOP Range Master 10525, 856 AM Sunday, October 5, 2025 at 856 AM ye",
      "gear are written in such a way to indicate they are global sources, they are actually main weapon Willalt  Elite Archer 10125, 534 AM Wednesday, October 1, 2025 at 534 AM oh I did not know lucky shado",
      "dragoon? but we need the potion meteor on left? for auto loot no? ARC2 max otta skin first meputia Senior Archer 10525, 750 PM Sunday, October 5, 2025 at 750 PM how many skins do we need to max it? ho",
      "skills. Especially with legendary revive you can burn down someone else, its a trump card for if both of you revive really. September 24, 2025 the Squirtle Squirt Especially with legendary revive you ",
      "card for if both of you revive really. September 24, 2025 the Squirtle Squirt Especially with legendary revive you can burn down someone else, its a trump card for if both of you revive really. RB773 ",
      "ability meputia Senior Archer 10525, 704 PM Sunday, October 5, 2025 at 704 PM yes but its too rare to gett htat meputia Senior Archer 10525, 715 PM Sunday, October 5, 2025 at 715 PM wasted etched rune",
      "upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it gives elementals a base crit rate of 10% (i believe but I could be mistaken). Youll most likely hav",
      "upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it gives elementals a base crit rate of 10% (i believe but I could be mistaken). Youll most likely hav",
      "damage to 122mil so far 1 Thank you .𝐊𝐚𝐫𝐦𝐚𝐭𝐢𝐜. VOID It helped a lot. Went from 40mil damage to 122mil so far Nadnerb Legendary Archer Yesterday at 213 AM nws u need some healing to keep ur hp above 10",
      "Crit Dmg red.  Sharp arrow 2 bounce6%krit480dmg Nothing special Bouncing between Master  Transcendent right now. Meteor is amazing in Peak  GvG but im not sure about my Arena Build. Should I keep inve",
      "crit (edited) murvy Legendary Archer 10125, 758 AM How much base crit and crit dmg you have? How much base crit and crit dmg you have? Kaithulhu ARC2 Chat Mod 10125, 843 AM no idea thulhu ARC2 no idea",
      "damage. sword is but only if you got the right skil. the strike gains element. for some reason it triggers explosion more. I prefer cats over dogs feet Archer Booster 10525, 659 PM Sunday, October 5, ",
      "crit (edited) murvy Legendary Archer 10125, 758 AM Wednesday, October 1, 2025 at 758 AM How much base crit and crit dmg you have? How much base crit and crit dmg you have? Kaithulhu ARC2 Chat Mod 1012",
      "arena Poosti Wiki Contributor 922 AM Yeah its better for sure, especially if u have thor Ring depends on where u are in pvp FIFTY Junior Archer 1148 AM Which build for arena ? Best enchants Arrow Rain",
      "pvp Shadowfax88 Legendary Archer 10125, 534 AM Its still very good without it. She was the best pvp resoskin even before the potion etched was released 1 Legendary is fairly significant upgrade over e",
      "dragoon set for pvp? (otta skin for potione etched or xbow skin) hi guys, for skins, what is the prio for dragoon set for pvp? (otta skin for potione etched or xbow skin) FreeKilling ARC2 Senior Arche",
      "pvp Shadowfax88 Legendary Archer 10125, 534 AM Wednesday, October 1, 2025 at 534 AM Its still very good without it. She was the best pvp resoskin even before the potion etched was released 1 Legendary",
      "dragoon set for pvp? (otta skin for potione etched or xbow skin) hi guys, for skins, what is the prio for dragoon set for pvp? (otta skin for potione etched or xbow skin) FreeKilling ARC2 Senior Arche",
      "dragoon? but we need the potion meteor on left? for auto loot no? ARC2 max otta skin first meputia Senior Archer 10525, 750 PM Sunday, October 5, 2025 at 750 PM how many skins do we need to max it? ho",
      "event? any advice appreciated Pampis44 Junior Archer 10125, 927 AM I am in a similar situation as you. Fishing is definitely 1 event for me to spend my gems on. Other than that I mostly buy keys and a",
      "event? any advice appreciated Pampis44 Junior Archer 10125, 927 AM Wednesday, October 1, 2025 at 927 AM I am in a similar situation as you. Fishing is definitely 1 event for me to spend my gems on. Ot"
    ],
    "confidence_scores": [
      1.0,
      1.0,
      0.7,
      1.0,
      0.8999999999999999,
      1.0,
      0.6799999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.7,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.8799999999999999,
      0.8799999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      0.7,
      0.9999999999999999,
      0.8999999999999999,
      0.8999999999999999,
      0.9999999999999999,
      0.9999999999999999,
      1.0,
      0.8999999999999999,
      1.0,
      0.8999999999999999,
      0.8999999999999999,
      1.0,
      0.8999999999999999,
      0.6799999999999999,
      0.7,
      0.8999999999999999,
      0.7,
      0.9999999999999999,
      0.9999999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.8999999999999999,
      1.0,
      0.6799999999999999,
      0.6799999999999999,
      0.6799999999999999,
      0.6799999999999999
    ],
    "sources": [
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "upgrade_requirements.json",
      "upgrade_requirements.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "events_modes.json",
      "events_modes.json"
    ],
    "avg_confidence": 0.9239999999999999
  },
  "keys": {
    "total_quantity": 13400,
    "mentions": 47,
    "contexts": [
      "etched Nunyaa Junior Archer 71025, 901 PM Thanks so not much point unless you see these coming up which is still low requirements Thanks so not much point unless you see these coming up which is still",
      "runes  enchants you have on them are worth to have all of them or if you have one much stronger than the others Kieerooon Junior Archer 92725, 1254 AM Is Thor worth it on F2P? Or should I go for artef",
      "etched Nunyaa Junior Archer 71025, 901 PM Thursday, July 10, 2025 at 901 PM Thanks so not much point unless you see these coming up which is still low requirements Thanks so not much point unless you ",
      "runes and enchants, or would a Meteor build perform better with elemental runes and meteorele crit enchants Which build for arena ? Best enchants Arrow Rain 30% Crit Dmg red.  Sharp arrow 2 bounce6%kr",
      "level carry over. 1 B3RMAN Senior Archer 7725, 943 PM Demon event Luck level carry over. 1 Demon event Luck level carry over. Demon event Luck level carry over. Sebiias Tryhard Cat MOP Range Master 77",
      "bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depends on your luck, can v",
      "level carry over. 1 B3RMAN Senior Archer 7725, 943 PM Monday, July 7, 2025 at 943 PM Demon event Luck level carry over. 1 Demon event Luck level carry over. Demon event Luck level carry over. Sebiias ",
      "boss dmg not the strongest Ty the Squirtle Squirt Elite Archer 10525, 1233 AM Sunday, October 5, 2025 at 1233 AM Leaderboards are class specific so I dont get the question, unless you mean honor stele",
      "bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depends on your luck, can v",
      "bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depends on your luck, can v",
      "pvp Sebiias Tryhard Cat MOP Range Master Yesterday at 928 AM Keep upgrading otta nian 4 stars is the goal Every star on nian otta is better than either of the two thor skins Tryhard Cat MOP Keep upgra",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "pvp? why is nian otta recommended so much? is otta used in pve or pvp? Shadowfax88 Legendary Archer 1022 AM Tuesday, October 7, 2025 at 1022 AM PvP primarily. His 2 skill is 40% crit rate60% crit dmg ",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "Arena 5 tickets Kill bosses 3 tickets Kill minions 6 tickets 50 Keys 12 tickets 50 Wishes 12 tickets 80 Shovels 20 tickets 5k Gems 10 tickets Total 95 free tickets , Average currency per ticket depend",
      "bests (edited) If you arent full mythic gear yet, then its better to get keys nani Novice Explorer 711 AM Hmm any clue how the razor starcores for weapons work in the first place? Do you buy the rare ",
      "pve or pvp? why is nian otta recommended so much? is otta used in pve or pvp? Shadowfax88 Legendary Archer 1022 AM Tuesday, October 7, 2025 at 1022 AM PvP primarily. His 2 skill is 40% crit rate60% cr",
      "best pvp resoskin even before the potion etched was released 1 Legendary is fairly significant upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it give",
      "Rolla and dont move. In my opinion the Squirtle Squirt Me, a Druid who also hasnt gone lower than 230 (edited) Poosti Wiki Contributor 1101 AM Use Rolla and dont move. In my opinion Poosti Wiki Contri",
      "Thor in resonance no, for PvP ur using otta with skin and thor, with helix 6 stars Therefore, duck helix 1 star is good enough and the new helix skin is also fairly good for PvP when they fix it Tryha",
      "resonance. Cause im always gonna slot Thor in resonance Tryhard Cat MOP Keep upgrading otta nian HundredArms Novice Explorer Yesterday at 931 AM What about after that? Also is nians base skills a must",
      "otta get out of the top25 are druids good damage dealers? camm OH Senior Archer 10525, 1230 AM Sunday, October 5, 2025 at 1230 AM Theres multiple 500m druids on the leaderboard, just gotta get out of ",
      "otta as the base hero in pvp? What resonance do you use? I see, so you use otta as the base hero in pvp? What resonance do you use? Shadowfax88 Legendary Archer 1051 AM Tuesday, October 7, 2025 at 105",
      "resonance slot one. I use Helix with Otta and Thor as resonance mrplonker Novice Explorer 1053 AM Tuesday, October 7, 2025 at 1053 AM Ohh damn I didnt know about that sacred hall thing thats huge, tha",
      "gear ? October 4, 2025 Nadnerb Legendary Archer Yesterday at 131 AM tracking pierce ering diag arrows ebeam .𝐊𝐚𝐫𝐦𝐚𝐭𝐢𝐜. VOID Senior Archer Yesterday at 132 AM The usual stuff for dmg then Alright, hope",
      "dragoon leg3 no skin oracle mythic1 with purple skin? Gabriel Dolce Senior Archer 92825, 539 PM Sunday, September 28, 2025 at 539 PM Im interested about this too. If someone has an answer Funny Boy Bi",
      "gear, and runes? Ive been trying different things, but I havent come to a concrete conclusion October 4, 2025 RB773 Mythic Archer 10425, 1242 AM Saturday, October 4, 2025 at 1242 AM chaotic dragoon we",
      "actively fix it or compensate Playmaker150 ARC2 Novice Explorer Yesterday at 649 PM is bomb sprite stronger than melee sprite? Archer Junior Archer Yesterday at 734 PM are druids good damage dealers? ",
      "talent setup for solitary? For potions. (edited) Ty the Squirtle Squirt Elite Archer Yesterday at 825 AM Whatever the guy in first place uses elidir Senior Archer Yesterday at 1018 AM Probably not goo",
      "talent point investment for Ebonrot stage clearing? OH Theres multiple 500m druids on the leaderboard, just gotta get out of the top25 Archer Senior Archer 10525, 926 PM Sunday, October 5, 2025 at 926",
      "upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it gives elementals a base crit rate of 10% (i believe but I could be mistaken). Youll most likely hav",
      "upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it gives elementals a base crit rate of 10% (i believe but I could be mistaken). Youll most likely hav",
      "damage to 122mil so far 1 Thank you .𝐊𝐚𝐫𝐦𝐚𝐭𝐢𝐜. VOID It helped a lot. Went from 40mil damage to 122mil so far Nadnerb Legendary Archer Yesterday at 213 AM nws u need some healing to keep ur hp above 10",
      "crit (edited) murvy Legendary Archer 10125, 758 AM How much base crit and crit dmg you have? How much base crit and crit dmg you have? Kaithulhu ARC2 Chat Mod 10125, 843 AM no idea thulhu ARC2 no idea",
      "damage. sword is but only if you got the right skil. the strike gains element. for some reason it triggers explosion more. I prefer cats over dogs feet Archer Booster 10525, 659 PM Sunday, October 5, ",
      "crit (edited) murvy Legendary Archer 10125, 758 AM Wednesday, October 1, 2025 at 758 AM How much base crit and crit dmg you have? How much base crit and crit dmg you have? Kaithulhu ARC2 Chat Mod 1012",
      "PvP and the leg skin is broken in PvE atm, but its really expensive to upgrade.. Gabriel Dolce Senior Archer 92225, 503 AM thanks. better to get thor skin or oracle spear epic gear ? I think the epic ",
      "pvp Shadowfax88 Legendary Archer 10125, 534 AM Its still very good without it. She was the best pvp resoskin even before the potion etched was released 1 Legendary is fairly significant upgrade over e",
      "pvp i just got thor. Should i run it with freeze shot or demon shield i am a full elemental rune build but im not sure if the frost adds enough to be better than shield Baseball Archer Booster 10125, ",
      "pvp Shadowfax88 Legendary Archer 10125, 534 AM Wednesday, October 1, 2025 at 534 AM Its still very good without it. She was the best pvp resoskin even before the potion etched was released 1 Legendary",
      "event Luck level carry over. 1 Demon event Luck level carry over. Sebiias Tryhard Cat MOP Range Master 7725, 1000 PM yeah July 10, 2025  for Help D ARC2 3k for task but Fishing Event Guide (Anglers B ",
      "event Luck level carry over. 1 Demon event Luck level carry over. Sebiias Tryhard Cat MOP Range Master 7725, 1000 PM Monday, July 7, 2025 at 1000 PM yeah July 10, 2025  for Help D ARC2 3k for task but",
      "event? any advice appreciated Pampis44 Junior Archer 10125, 927 AM I am in a similar situation as you. Fishing is definitely 1 event for me to spend my gems on. Other than that I mostly buy keys and a",
      "event? any advice appreciated Pampis44 Junior Archer 10125, 927 AM Wednesday, October 1, 2025 at 927 AM I am in a similar situation as you. Fishing is definitely 1 event for me to spend my gems on. Ot"
    ],
    "confidence_scores": [
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.8799999999999999,
      0.8799999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      1.0,
      0.8799999999999999,
      0.8799999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      0.9999999999999999,
      1.0,
      0.9999999999999999,
      0.9999999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.9999999999999999,
      0.9999999999999999,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      1.0,
      0.8999999999999999,
      0.8999999999999999,
      0.6799999999999999,
      0.6799999999999999
    ],
    "sources": [
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "rune_mechanics.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "boss_guides.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pvp_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "pve_strategies.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "character_stats.json",
      "gear_details.json",
      "gear_details.json",
      "gear_details.json",
      "talent_cards.json",
      "talent_cards.json",
      "talent_cards.json",
      "upgrade_requirements.json",
      "upgrade_requirements.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "damage_calculations.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "dragoon_guides.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json",
      "events_modes.json"
    ],
    "avg_confidence": 0.9719148936170211
  }
}