{
  "name": "Events & Game Modes",
  "description": "Shackled Jungle, events, special modes, schedules",
  "priority": "high",
  "data": [
    {
      "content": "event comes around again in about 4 weeks because it sounds like their may be a new character added then 1 September 29, 2025 fylopian STFC Senior Archer 9/29/25, 4:26 PM Is sprite’s awe good because of the legendary skill? Never seem to get much sprite dmg (epic) STFC Is sprite’s awe good because of the legendary skill? Never seem to get much sprite dmg (epic) Shadowfax88 Legendary Archer 9/29/25, 4:38 PM Yes, it's mostly because of the legendary skill. Unless you get laser sprite skill, than even just the extra clone is useful (especially if you also have sprite multishot) 1 October 1, 2025 Baseball Archer Booster 10/1/25, 7:19 PM For pvp i just got thor. Should i run it with freeze shot or demon shield i am a full elemental rune build but im not sure if the frost adds enough to be better than shield For pvp i just got thor. Should i run it with freeze shot or demon shield i am a full elemental rune build but im not sure if the frost adds enough to be better than shield RB773 Mythic Archer 10/1/25, 8:18 PM Atreus in Arena for sure. in GvG it depends but I don't see why you would run rolla anyways Baseball Archer Booster 10/1/25, 8:40 PM kk thx October 3, 2025 Gabriel Dolce Senior Archer 10/3/25, 1:46 AM Any advice on what I should use/change for pvp ? Dolce Any advice on what I should use/change for pvp ? BigRed Junior Archer 10/3/25, 11:32 AM Have you shifted from Oracle to Dragoon? What chests are you pulling? If yes, once you get Xbow to Legendary +3, I'd swap in the Drag Xbow, boots, helm and move from sprites to meteor build. I'd probaly leave things as they are though absent any equipment/rune upgrades. Have you shifted from Oracle to Dragoon? What chests are you pulling? If yes, once you get Xbow to Legendary +3, I'd swap in the Drag Xbow, boots, helm and move from sprites to meteor build. I'd probaly leave things as they are though absent any equipment/rune upgrades. Gabriel Dolce Senior Archer 10/3/25, 11:33 AM Yep, from oracle to dragoon. Opening dragoon chests. That’s what I’m going to do, thanks MX4 Novice Explorer 10/3/25, 5:04 PM What do you guys think that would be the best build for the peak arena? The 3 best characters, gear, and runes? I've been trying different things, but I haven't come to a concrete conclusion… October 4, 2025 RB773 Mythic Archer Yesterday at 12:42 AM chaotic dragoon weapon, helm, boots, griffin amulet, ring, oracle armor for 2 in front or claw with oracle helm if you have mythic circles Markb9094 Junior Archer Yesterday at 3:29 AM Is bounce really basically the best \"overall general\" #1 enchant for oracles in pvp gvg and peak? Ive seen some say it hasnt done much dmg for them. How good is bounce for oracles in pve? chaotic dragoon weapon, helm, boots, griffin amulet, ring, oracle armor MX4 Novice Explorer Yesterday at 7:57 AM I am using Helix with deciveness and circles (I don’t have griffin), Atreus with mixed set (dragoon and oracle) with meteors and potions, and Drac with the same build as Atreus. Helix close range, Atreus and Drac far I am using Helix with deciveness and circles (I don’t have griffin), Atreus with mixed set (dragoon and oracle) with meteors and potions, and Drac with the same build as Atreus. Helix close range, Atreus and Drac far RB773 Mythic Archer Yesterday at 8:25 AM without Thor and at least mythic griffin amulet, it's not even worth to go close 1 Shadowfax88 Legendary Archer Yesterday at 8:35 AM And depending on how much better your other gear is, it's probably not worth the extra fusion points And depending on how much better your other gear is, it's probably not worth the extra fusion points MX4 Novice Explorer Yesterday at 10:29 AM Makes sense. I added you too. I wonder if we could chat about the build? Shadowfax88 Legendary Archer Yesterday at 10:38 AM Sure October 5, 2025 Novaveteran Senior Archer 4:34 AM So I'm using a mix of dragoon and 2-3 red pieces of oracle. Using the meteor build. But even when having 1700k power and legendary +2 and +3 runes, i get destroyed by a just legendary griffin 1000k power person fylopian STFC Senior Archer 11:47 AM What rune should I use here for arena? I’m 6 star helix, with 6 star helix skin, Thor 0 and otta 2, with otta nian skin 0 I use oracle gear Dragoon Monobrow DCDL Novice Explorer 9/22/25, 4:03 AM Any other pieces or full dragoon? For pvp… thanks Dragoon Monobrow DCDL Novice Explorer 9/22/25, 4:03 AM Any other pieces or full dragoon? For pvp… thanks Any other pieces or full dragoon? For pvp… thanks DCDL Any other pieces or full dragoon? For pvp… thanks RB773 Mythic Archer 9/22/25, 4:04 AM I am full Dragoon atm. 1 DCDL Any other pieces or full dragoon? For pvp… thanks RB773 Mythic Archer 9/22/25, 4:04 AM I am full Dragoon atm. 1 Any other pieces or full dragoon? For pvp… thanks I am full Dragoon atm. I am full Dragoon atm. Monobrow DCDL Novice Explorer 9/22/25, 4:04 AM And if you could swap any bits? Griff neck mb? I am full Dragoon atm. Monobrow DCDL Novice Explorer 9/22/25, 4:04 AM And if you could swap any bits? Griff neck mb? I am full Dragoon atm. And if you could swap any bits? Griff neck mb? RB773 Mythic Archer 9/22/25, 4:05 AM I would swap plenty, but I find it expensive to mix sets. (edited) 1 1 RB773 Mythic Archer 9/22/25, 4:05 AM I would swap plenty, but I find it expensive to mix sets. (edited) 1 1 I would swap plenty, but I find it expensive to mix sets. (edited) I think the epic oracle skin is good for PvP and the leg skin is broken in PvE atm, but it's really expensive to upgrade.. Gabriel Dolce Senior Archer 9/22/25, 5:03 AM thanks. better to get thor skin or oracle spear epic gear ? I think the epic oracle skin is good for PvP and the leg skin is broken in PvE atm, but it's really expensive to upgrade.. Gabriel Dolce Senior Archer 9/22/25, 5:03 AM thanks. better to get thor skin or oracle spear epic gear ? I think the epic oracle skin is good for PvP and the leg skin is broken in PvE atm, but it's really expensive to upgrade.. thanks. better to get thor skin or oracle spear epic gear ? October 4, 2025 Nadnerb Legendary Archer Yesterday at 1:31 AM tracking pierce ering diag arrows ebeam ☽.⋆𝐊𝐚𝐫𝐦𝐚𝐭𝐢𝐜⋆.☾ VOID Senior Archer Yesterday at 1:32 AM The usual stuff for dmg then Alright, hopefully this'll work better yes if u running blood route i run like 3pts into dmg reduction and healh. 9 pts into crit rate max crit dmg and rest into final dmg ☽.⋆𝐊𝐚𝐫𝐦𝐚𝐭𝐢𝐜⋆.☾ VOID Senior Archer Yesterday at 2:12 AM It helped a lot. Went from 40mil damage to 122mil so far 1 Thank you @☽.⋆𝐊𝐚𝐫𝐦𝐚𝐭𝐢𝐜⋆.☾ VOID It helped a lot. Went from 40mil damage to 122mil so far Nadnerb Legendary Archer Yesterday at 2:13 AM nws u need some healing to keep ur hp above 10 to keep the blood skill active ☽.⋆𝐊𝐚𝐫𝐦𝐚𝐭𝐢𝐜⋆.☾ VOID Senior Archer Yesterday at 2:15 AM Yep I've kept that in mind I've noticed that this is like something you have to be so precise with. Get all the right skills or I'm better off starting over Nadnerb Legendary Archer Yesterday at 2:16 AM yep might as well its quicker ☽.⋆𝐊𝐚𝐫𝐦𝐚𝐭𝐢𝐜⋆.☾ VOID Senior Archer Yesterday at 2:17 AM Yep KidCanada2975 KTOD Junior Archer Yesterday at 8:16 AM What have you guys found to generally be the best talent setup for solitary? For potions. (edited) Ty the Squirtle Squirt Elite Archer Yesterday at 8:25 AM Whatever the guy in first place uses elidir Senior Archer Yesterday at 10:18 AM Probably not good enough for 30th but finally a pb Druid Probably not good enough for 30th but finally a pb murvy Legendary Archer Yesterday at 10:59 AM What Kind of druid build? elidir Senior Archer Yesterday at 11:01 AM sprite -ice, multi, split -clone on hit, bomb sprite -laser, less than 3 buffs -match main weapon attk speed 1 you can find it on most top of the leaderboard builds ᲼᲼Favon MAYO Elite Archer Yesterday at 12:42 PM Is there a generally considered \"best place\" to farm Gloom Shards to hit the weekly ? softcorecinnamon Senior Archer Yesterday at 4:32 PM I dont get how the top players on the board have so many shards to spend. I still can't hit the same level of things as them that they show in the season tab with maxed out rewards",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "event Luck level carry over. 1 Demon event Luck level carry over. Sebiias Tryhard Cat MOP Range Master 7/7/25, 10:00 PM yeah July 10, 2025 | for Help :D ARC2 3k for task but ⁠Fishing Event Guide (Angler's B… for etched Nunyaa Junior Archer 7/10/25, 9:01 PM Thanks so not much point unless you see these coming up which is still low requirements Thanks so not much point unless you see these coming up which is still low requirements EpicJapan | for Help :D ARC2 Chat Mod 7/10/25, 9:03 PM ye July 12, 2025 silingmaanghang 7/12/25, 3:37 AM can someone update this for the current event??? can someone update this for the current event??? Shadowfax88 Legendary Archer 7/12/25, 5:20 AM It's already there... the current event is lucky treasure wheel can someone update this for the current event??? Sebiias Tryhard Cat MOP Range Master 7/12/25, 6:08 AM Its the same July 20, 2025 Pontus Chat Mod 7/20/25, 8:25 AM Sorry, accidentally pinged you in here instead of the normal thread EJ July 29, 2025 Bearon ES Junior Archer 7/29/25, 6:28 PM is this up to date ES is this up to date Sebiias Tryhard Cat MOP Range Master 7/29/25, 7:06 PM yeah Bearon ES Junior Archer 7/29/25, 7:31 PM ty! tea🍵 Archer Booster 7/29/25, 9:13 PM | for Help :D pls update vibrant voyage Vibrant Voyage Task list , Free pack: +7 tickets Login: +5 tickets Seal: +5 tickets Gold Cave: +5 tickets : +5 tickets Arena: +5 tickets Kill bosses: +3 tickets Kill minions: +6 tickets 50 Keys: +12 tickets 50 Wishes: +12 tickets 80 Shovels: +20 tickets 5k Gems: +10 tickets Total: 95 free tickets , Average currency per ticket: depends on your luck, can vary a lot apparently , Information taken from this same thread, if there is something wrong, please @ me with the correct info to fix it. Credits to Tryhard Cat MOP Vibrant voyage + Fishing event 3,000 / 80 / 50 + 50 keys/wishes + 80 Shovels August is going to be tough. 160 shovels and 100 keys needed omgawd 2 August 3, 2025 🍵 Vibrant voyage + Fishing event 3,000 / 80 / 50 + 50 keys/wishes + 80 Shovels August is going to be tough. 160 shovels and 100 keys needed omgawd Poosti Wiki Contributor 8/3/25, 4:49 AM Bruh I have 0 shovels Where yall getting these Bruh I have 0 shovels tea🍵 Archer Booster 8/3/25, 4:52 AM push sky tower 🍵 push sky tower Poosti Wiki Contributor 8/3/25, 4:52 AM 🫩 tea🍵 Archer Booster 8/3/25, 4:52 AM and treasure island 100k points i saved 400 dice and managed to roll treasure island 3 time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "event worth while? August 27, 2025 Julius Senior Archer 8/27/25, 12:40 AM Hi any info regarding other world thor event ? Hi any info regarding other world thor event ? Cruzix Elite Archer 8/27/25, 1:46 AM What info do you want exactly Julius Senior Archer 8/27/25, 1:51 AM like what to be save up like what to be save up 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 8/27/25, 2:11 AM It's the same as this one :)) Julius Senior Archer 8/27/25, 2:14 AM ahhhh i see okay! September 1, 2025 hopesix OG Senior Archer 9/1/25, 12:33 AM How do I access that guide on mobile sorry OG How do I access that guide on mobile sorry Sebiias Tryhard Cat MOP Range Master 9/1/25, 6:18 AM check pinned September 12, 2025 EviL | 7.4% Oracle User ARC2 Archer Booster 9/12/25, 12:40 PM . epex ⲦⲞⅪⅭ Senior Archer 9/12/25, 11:43 PM I’m so cooked bro I accidentally spent 1k on shovels September 13, 2025 Megalolek Junior Archer 9/13/25, 4:34 AM 1k€ or 1k gems? 1k€ or 1k gems? epex ⲦⲞⅪⅭ Senior Archer 9/13/25, 10:34 AM 1k gems that I would’ve rather spent on lures EviL | 7.4% Oracle User ARC2 Archer Booster 9/13/25, 10:36 AM Megalolek Junior Archer 9/13/25, 1:08 PM 1k gems means nothing xd sadly.... September 30, 2025 | 7.4% Oracle User ARC2 Click to see attachment gryfel Senior Archer 9/30/25, 9:30 AM ⁠[Eternal Lode] Still Missing Mo… Please 🆙️ if you want more shovels October 3, 2025 RB773 Mythic Archer 10/3/25, 9:29 PM anyone know how high are the keys and gems tasks in this new event? shovels are 80 and wishes are 50 anyone know how high are the keys and gems tasks in this new event? Shadowfax88 Legendary Archer 10/3/25, 9:33 PM Keys are 50 Gems are 5k RB773 Mythic Archer 10/3/25, 9:34 PM thanks gryfel Senior Archer 10/3/25, 11:53 PM 50 wishes if we are counting October 4, 2025 envenom1414 Elite Archer Yesterday at 12:38 AM 80 shovels 1 October 5, 2025 80 shovels ANakav3v Senior Archer 3:15 AM for real 80 shovels...? for real 80 shovels...? envenom1414 Elite Archer 3:37 AM Unfortunately yeah 1 for real 80 shovels...? gryfel Senior Archer 8:04 AM Please like if you also hate it ⁠[Events] Delete Moonshade Myth… 1 for real 80 shovels...? gryfel Senior Archer 8:06 AM ⁠[Eternal Lode] Still Missing Mo… This if you want to complain about missing shovels they promised 1 ANakav3v Senior Archer 8:09 AM liked B3RMAN Senior Archer 7/7/25, 9:43 PM Demon event Luck level carry over. 1 B3RMAN Senior Archer 7/7/25, 9:43 PM Demon event Luck level carry over. 1 Demon event Luck level carry over. Demon event Luck level carry over. Sebiias Tryhard Cat MOP Range Master 7/7/25, 10:00 PM yeah Demon event Luck level carry over. Sebiias Tryhard Cat MOP Range Master 7/7/25, 10:00 PM yeah Demon event Luck level carry over. | for Help :D ARC2 3k for task but ⁠Fishing Event Guide (Angler's B… for etched Nunyaa Junior Archer 7/10/25, 9:01 PM Thanks so not much point unless you see these coming up which is still low requirements | for Help :D ARC2 3k for task but ⁠Fishing Event Guide (Angler's B… for etched Nunyaa Junior Archer 7/10/25, 9:01 PM Thanks so not much point unless you see these coming up which is still low requirements 3k for task but ⁠Fishing Event Guide (Angler's B… for etched Thanks so not much point unless you see these coming up which is still low requirements Thanks so not much point unless you see these coming up which is still low requirements EpicJapan | for Help :D ARC2 Chat Mod 7/10/25, 9:03 PM ye Thanks so not much point unless you see these coming up which is still low requirements EpicJapan | for Help :D ARC2 Chat Mod 7/10/25, 9:03 PM ye Thanks so not much point unless you see these coming up which is still low requirements silingmaanghang 7/12/25, 3:37 AM can someone update this for the current event??? silingmaanghang 7/12/25, 3:37 AM can someone update this for the current event??? can someone update this for the current event??? can someone update this for the current event??? Shadowfax88 Legendary Archer 7/12/25, 5:20 AM It's already there... the current event is lucky treasure wheel October 4, 2025 Tryhard Cat MOP I see you keep saying both the Thor skins are bad. I was just saving up to buy the first one but now I’m not sure. What skins would you recommend? I have nian Otta unlocked and I’m using helix in pvp Sebiias Tryhard Cat MOP Range Master Yesterday at 9:28 AM Keep upgrading otta nian 4 stars is the goal Every star on nian otta is better than either of the two thor skins Tryhard Cat MOP Keep upgrading otta nian HundredArms Novice Explorer Yesterday at 9:31 AM What about after that? Also is nians base skills a must have for resonance. Cause im always gonna slot Thor in resonance What about after that? Also is nians base skills a must have for resonance. Cause im always gonna slot Thor in resonance Sebiias Tryhard Cat MOP Range Master Yesterday at 9:45 AM no, for PvP ur using otta with skin and thor, with helix 6 stars Therefore, duck helix 1 star is good enough and the new helix skin is also fairly good for PvP when they fix it Tryhard Cat MOP no, for PvP ur using otta with skin and thor, with helix 6 stars Therefore, duck helix 1 star is good enough and the new helix skin is also fairly good for PvP when they fix it Shadowfax88 Legendary Archer Yesterday at 9:54 AM What's the issue with it? That you attack your own bunnies? But after they die who gets the healing? You or your opponent? What's the issue with it? That you attack your own bunnies? But after they die who gets the healing? You or your opponent? Sebiias Tryhard Cat MOP Range Master Yesterday at 9:55 AM Yeah you attack your own hares, I have a video of such thing not happening but for some reason now it does 1 You get the healing RB773 Mythic Archer Yesterday at 9:55 AM it's probably a bug that will be fixed, but we don't know if it will be fixed in a few days or a few months... what I also want to know is if attacks bounce from hare back to character, cuz that could backfire in some cases and you get attacked 2 or 3 time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "event to unlock either one legendary hero skin or one legendary weapon skin which should i get? if im going to be able to get enough starcores from this event to unlock either one legendary hero skin or one legendary weapon skin which should i get? Sebiias Tryhard Cat MOP Range Master 6:59 AM neither, otta nian skin and duck helix are the bests (edited) If you aren't full mythic gear yet, then its better to get keys nani Novice Explorer 7:11 AM Hmm any clue how the razor starcores for weapons work in the first place? Do you buy the rare and it requires more to upgrade eventually? Tryhard Cat MOP If you aren't full mythic gear yet, then its better to get keys mob Novice Explorer 7:19 AM im full mythic+3 (weapons+1) in oracle and mythic crossbow but no mythic other dragoon gear. Would probably get thors mjolnir skin or the oracle spear one. You really think i should pass and just get the lower tier skins? i dont have otta unlocked but helix is almost max Hmm any clue how the razor starcores for weapons work in the first place? Do you buy the rare and it requires more to upgrade eventually? mob Novice Explorer 7:20 AM assumed once you buy it you could just use it straight away? assumed once you buy it you could just use it straight away? nani Novice Explorer 7:21 AM Can I just save up and straight up buy the epic skin and skip the rare skin? I'm still new ish so I doubt I will get anymore starcores anytime",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "eventually? Sebiias Tryhard Cat MOP Range Master 7:28 AM each skin is individual between each other and their prices stay the same amount for every purchase mob Novice Explorer 7:31 AM roger that. appreciate the advice. Also all the like 'heart eyes' stuff is just decorative right? roger that. appreciate the advice. Also all the like 'heart eyes' stuff is just decorative right? Sebiias Tryhard Cat MOP Range Master 7:31 AM yeah 1 Tryhard Cat MOP each skin is individual between each other and their prices stay the same amount for every purchase nani Novice Explorer 7:37 AM Ahhh thanks man, yeah someone told me to buy razor cores in a previous event maybe I should of got the other cores. Thanks for the help Sebiias Tryhard Cat MOP Range Master 7:37 AM whoever told you that they're wrong terrible decision nani Novice Explorer 7:40 AM Yeah I only got 2 so it's not too much of a big deal, it is what it is Yeah I only got 2 so it's not too much of a big deal, it is what it is Sebiias Tryhard Cat MOP Range Master 7:45 AM oh well its not so bad I guess yeah Now you know nani Novice Explorer 7:52 AM Yeah thanks lucky I saw these messages early Tryhard Cat MOP I see you keep saying both the Thor skins are bad. I was just saving up to buy the first one but now I’m not sure. What skins would you recommend? I have nian Otta unlocked and I’m using helix in pvp Sebiias Tryhard Cat MOP Range Master Yesterday at 9:28 AM Keep upgrading otta nian Tryhard Cat MOP I see you keep saying both the Thor skins are bad. I was just saving up to buy the first one but now I’m not sure. What skins would you recommend? I have nian Otta unlocked and I’m using helix in pvp Sebiias Tryhard Cat MOP Range Master Yesterday at 9:28 AM Keep upgrading otta nian Tryhard Cat MOP I see you keep saying both the Thor skins are bad. I was just saving up to buy the first one but now I’m not sure. What skins would you recommend? I have nian Otta unlocked and I’m using helix in pvp Keep upgrading otta nian 4 stars is the goal 4 stars is the goal 4 stars is the goal Every star on nian otta is better than either of the two thor skins Every star on nian otta is better than either of the two thor skins Every star on nian otta is better than either of the two thor skins Tryhard Cat MOP Keep upgrading otta nian HundredArms Novice Explorer Yesterday at 9:31 AM What about after that? Also is nians base skills a must have for resonance. Cause im always gonna slot Thor in resonance Tryhard Cat MOP Keep upgrading otta nian HundredArms Novice Explorer Yesterday at 9:31 AM What about after that? Also is nians base skills a must have for resonance. Cause im always gonna slot Thor in resonance Keep upgrading otta nian What about after that? Also is nians base skills a must have for resonance. Cause im always gonna slot Thor in resonance What about after that? Also is nians base skills a must have for resonance. Cause im always gonna slot Thor in resonance Sebiias Tryhard Cat MOP Range Master Yesterday at 9:45 AM no, for PvP ur using otta with skin and thor, with helix 6 stars Therefore, duck helix 1 star is good enough and the new helix skin is also fairly good for PvP when they fix it What about after that? Also is nians base skills a must have for resonance. Cause im always gonna slot Thor in resonance Sebiias Tryhard Cat MOP Range Master Yesterday at 9:45 AM no, for PvP ur using otta with skin and thor, with helix 6 stars Therefore, duck helix 1 star is good enough and the new helix skin is also fairly good for PvP when they fix it What about after that? Also is nians base skills a must have for resonance. Cause im always gonna slot Thor in resonance no, for PvP ur using otta with skin and thor, with helix 6 stars Therefore, duck helix 1 star is good enough and the new helix skin is also fairly good for PvP when they fix it Tryhard Cat MOP no, for PvP ur using otta with skin and thor, with helix 6 stars Therefore, duck helix 1 star is good enough and the new helix skin is also fairly good for PvP when they fix it Shadowfax88 Legendary Archer Yesterday at 9:54 AM What's the issue with it? That you attack your own bunnies? But after they die who gets the healing? You or your opponent? October 1, 2025 Willalt 🐬 Elite Archer 10/1/25, 4:55 AM so might as well aim for L potion etched to prepare for then shackled I use AOE and PO anyway so those slots are filled 'thulhu ARC2 only place awe is useful is shackled. RB773 Mythic Archer 10/1/25, 4:56 AM I use it in PvP. Kai'thulhu ARC2 Chat Mod 10/1/25, 5:04 AM i run xbow so I go meteor + elemental crit (edited) 'thulhu ARC2 i run xbow so I go meteor + elemental crit (edited) Willalt 🐬 Elite Archer 10/1/25, 5:11 AM how is that going for you? I'm planning on this as well currently have 2 blue copies of elecrit, just need 1 more 🐬 how is that going for you? I'm planning on this as well Kai'thulhu ARC2 Chat Mod 10/1/25, 5:16 AM not bad. I win some whos about even to me. 1 Willalt 🐬 Elite Archer 10/1/25, 5:16 AM and thats with just epic elecrit right? not sure if L would be worth it Kai'thulhu ARC2 Chat Mod 10/1/25, 5:17 AM I got L. 30% seems nice. 1 Willalt 🐬 Elite Archer 10/1/25, 5:18 AM I assume you use otta reso for pvp? Kai'thulhu ARC2 Chat Mod 10/1/25, 5:25 AM I need 4 gem sacred hall before I can equip skin 1 🐬 and thats with just epic elecrit right? not sure if L would be worth it Shadowfax88 Legendary Archer 10/1/25, 5:25 AM Legendary is fairly significant upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it gives elementals a base crit rate of 10% (i believe but I could be mistaken). You'll most likely have a decently higher global crit damage than crit rate especially if you don't have pans flute Also, even though the crit rate/dmg multis on gear are written in such a way to indicate they are global sources, they are actually main weapon (edited) 🐬 I assume you use otta reso for pvp? Shadowfax88 Legendary Archer 10/1/25, 5:27 AM Otta's 2 ability is a main weapon crit rate/dmg multi not global just like gear is (edited) Pampis44 Junior Archer 10/1/25, 5:27 AM I have L aoe and L ele crit, currently starting to transition from full oracle to mixed dragoon. I was thinking L meteor would be my next target to focus on, but given I have otta skin and should unlock otta next event, should I focus on L potion etched too? Or would L aoe, ele crit and meteor be enough? Otta's 2 ability is a main weapon crit rate/dmg multi not global just like gear is (edited) Kai'thulhu ARC2 Chat Mod 10/1/25, 5:28 AM I dont think its just mw. 'thulhu ARC2 I dont think its just mw. Shadowfax88 Legendary Archer 10/1/25, 5:29 AM It is. It was confirmed by shultin 1 I don't have it so I haven't personally tested it but I have tested gear and those are for sure main weapon only I have L aoe and L ele crit, currently starting to transition from full oracle to mixed dragoon. I was thinking L meteor would be my next target to focus on, but given I have otta skin and should unlock otta next event, should I focus on L potion etched too? Or would L aoe, ele crit and meteor be enough? Kai'thulhu ARC2 Chat Mod 10/1/25, 5:30 AM I prefer meteor over potions. potions is very rng heavy although might be nice for peak 'thulhu ARC2 I prefer meteor over potions. potions is very rng heavy although might be nice for peak Pampis44 Junior Archer 10/1/25, 5:32 AM I see. Is otta skin any good without potion etched? Or is it useless without it? Mostly for pvp Shadowfax88 Legendary Archer 10/1/25, 5:34 AM It's still very good without it. She was the best pvp reso/skin even before the potion etched was released 1 Legendary is fairly significant upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it gives elementals a base crit rate of 10% (i believe but I could be mistaken). You'll most likely have a decently higher global crit damage than crit rate especially if you don't have pans flute Also, even though the crit rate/dmg multis on gear are written in such a way to indicate they are global sources, they are actually main weapon Willalt 🐬 Elite Archer 10/1/25, 5:34 AM oh I did not know lucky shadow gives elementals base crit I see. Is otta skin any good without potion etched? Or is it useless without it? Mostly for pvp Kai'thulhu ARC2 Chat Mod 10/1/25, 5:34 AM im planning on using as soon as I get 4 gems sacred hall but that's only cuz I have good enchantments for it. 2 Willalt 🐬 Elite Archer 10/1/25, 5:35 AM I just got 4 gem sacred hall myself but no otta nor otta skin 1 Kai'thulhu ARC2 Chat Mod 10/1/25, 5:38 AM let's trade 1 tyler7950 Junior Archer 10/1/25, 5:52 AM ITS ALMOST TIME",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "event chests day 1 just keep 75 and spend all extras October 2, 2025 Mahoney | P90015575 Elite Archer 10/2/25, 12:07 AM It's not only the key amount, but also key replenishment rate October 3, 2025 TodoNuDeMeias Senior Archer 10/3/25, 5:42 AM How do we feel about the updates of the etcheds? Is leg 1 worth? How do we feel about the updates of the etcheds? Shadowfax88 Legendary Archer 10/3/25, 5:55 AM Mostly just useful in PvE. It's +3% dmg of the particular dmg source of the etched rune for each skill of that type taken. Zero benefit in gvg and peak because no skills are available. You'll see some dps increase in arena but it's pretty random in terms of skills. You'll probably only see 2-3 skills of a particular type (if that). But I don't have any etched at L1 so I haven't personally tested it in arena to know for sure (edited) 1 50k on top of the free lures ? 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 10/3/25, 6:33 AM I got mythic artifact and 4 blessings with 45k gems + free lures Is leg 1 worth? 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 10/3/25, 6:35 AM What Shadofax said. If you have all legendaries you need, you can build up your most important ones with free etcheds but I wouldn't spend on it 1 extremelyaverage Senior Archer 10/3/25, 7:55 AM I’ve been thinking about it and I think I’m still going to go for mythic artifacts in fishing for now. I really want sprite assist l2 but until I get otta it’s just not giving me much. That’s assuming otta affects that bonus. Can anyone confirm? I assume you could tell on elemental crit. October 5, 2025 gryfel Senior Archer 5:48 AM Is buying epic rod pack a good investement of $? Ale have some aurocite thinking I will use it on monthly cards but I'm not sure if thats the best option. I was looking at the excel sheet with spending values but this doesn't include packs in the events Is buying epic rod pack a good investement of $? Ale have some aurocite thinking I will use it on monthly cards but I'm not sure if thats the best option. I was looking at the excel sheet with spending values but this doesn't include packs in the events Sebiias Tryhard Cat MOP Range Master 6:58 AM yes, pretty much the best pack in the event Willalt 🐬 Elite Archer 10/1/25, 4:55 AM so might as well aim for L potion etched to prepare for then Willalt 🐬 Elite Archer 10/1/25, 4:55 AM so might as well aim for L potion etched to prepare for then so might as well aim for L potion etched to prepare for then shackled I use AOE and PO anyway so those slots are filled shackled I use AOE and PO anyway so those slots are filled shackled I use AOE and PO anyway so those slots are filled 'thulhu ARC2 only place awe is useful is shackled. RB773 Mythic Archer 10/1/25, 4:56 AM I use it in PvP. 'thulhu ARC2 only place awe is useful is shackled. RB773 Mythic Archer 10/1/25, 4:56 AM I use it in PvP. only place awe is useful is shackled. I use it in PvP. Kai'thulhu ARC2 Chat Mod 10/1/25, 5:04 AM i run xbow so I go meteor + elemental crit (edited) Kai'thulhu ARC2 Chat Mod 10/1/25, 5:04 AM i run xbow so I go meteor + elemental crit (edited) i run xbow so I go meteor + elemental crit (edited) 'thulhu ARC2 i run xbow so I go meteor + elemental crit (edited) Willalt 🐬 Elite Archer 10/1/25, 5:11 AM how is that going for you? I'm planning on this as well 'thulhu ARC2 i run xbow so I go meteor + elemental crit (edited) Willalt 🐬 Elite Archer 10/1/25, 5:11 AM how is that going for you? I'm planning on this as well i run xbow so I go meteor + elemental crit (edited) how is that going for you? I'm planning on this as well currently have 2 blue copies of elecrit, just need 1 more currently have 2 blue copies of elecrit, just need 1 more May 20, 2025 ARC2 Spinning Flower (Other) Chapter 32, wave 30. • Defeated at 150k power • This boss always spins counterclockwise and shoots counterclockwise at the end of his spin. (Same direction as circles) • For now, not sure of a better way to avoid attacks other than hope he spins and lands farther away from you to; first, dodge the charge, then dodge his shots. After shooting, he pretty much preps his charge again. • Think the only solid hope is freezes, shields, and something auto attack like circles since he’s always close range from charging. EpicJapan | for Help :D ARC2 Chat Mod 5/20/25, 9:45 PM tysm added to the list EasyVictor ARC2 Senior Archer 5/20/25, 9:47 PM Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ ARC2 Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ EpicJapan | for Help :D ARC2 Chat Mod 5/20/25, 9:48 PM maybe not for now? I woudl appreciate all available info though tysm 1 May 21, 2025 EasyVictor ARC2 Senior Archer 5/21/25, 12:20 AM Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. , (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape but the orientation does not matter. -also after each movement, get one or two shots off, but never three, it’s too risky. • Using the triangle method is the best way to avoid his 3x charge. This will also keep him in close if you are using circle attack/runes. After movement, shoot shoot move. • Second attack is typically jump attack then immediate meteors. If you can get one shot off in between these attacks go for it, but not at the cost of eating a meteor. After the meteors fall, shoot shoot move. • Lastly, you have the flame shot that splits into 6. The triangle method is perfect to avoid this because it may be a charge. Avoid the flame, possibly shoot, move to avoid the flame spread, shoot again. Rinse and repeat ARC2 Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape EpicJapan | for Help :D ARC2 Chat Mod 5/21/25, 1:23 AM ty' May 22, 2025 EasyVictor ARC2 Senior Archer 5/22/25, 7:02 PM Stone Golem • This boss has 3 different attacks. A rolling bowling boulder attack that eventually splits into 6. The big boulder will also track/follow. , (If this big boulder hits a wall, it will not split and will disappear) A triple rock split. , (Edit) Lastly, he also shoots 5 fast boulders at that are mostly guaranteed hits if you are close to him. , (If you freeze or paralyze him, he will never throw these) • This boss will always throw with his right arm. • My trick is to stand mostly in between him in the center and the wall. This is in the hopes when he tosses the boulder, it will cancel. If it’s the triple rock split you’re still good to go. , • The biggest point is to always rotate to dodge in a counterclockwise direction. This is to have to better chance of dodging the tosses. If you dodge clockwise, you run a much bigger risk of taking a bolder or rock throw. , (edited) 1 1 ARC2 Stone Golem • This boss has 3 different attacks. A rolling bowling boulder attack that eventually splits into 6. The big boulder will also track/follow. (If this big boulder hits a wall, it will not split and will disappear) A triple rock split. (Edit) Lastly, he also shoots 5 fast boulders at that are mostly guaranteed hits if you are close to him. Sebiias Tryhard Cat MOP Range Master 5/22/25, 7:29 PM this boss has 3 attacks, it also shoots 5 fast boulders at you that are guaranteed hit if you are close to him, but if you freeze or paralyze him, he will never throw those 1 Tryhard Cat MOP this boss has 3 attacks, it also shoots 5 fast boulders at you that are guaranteed hit if you are close to him, but if you freeze or paralyze him, he will never throw those EasyVictor ARC2 Senior Archer 5/22/25, 7:34 PM Ok I did have freeze (ice attack and circles). Editing now. (edited) Sebiias Tryhard Cat MOP Range Master 5/22/25, 7:34 PM I told the same strat to a friend long ago and he freaked out when the boss did that to him \"He isn't supposed to hit me, what is that!!\" 1 EasyVictor ARC2 Senior Archer 5/22/25, 7:38 PM Yeah I guess I’ve always had somewhat freeze something so never ran into that I’ll have to try that next time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "eventing me from gaining the 3rd star ⭐️ EasyVictor ARC2 Senior Archer 5/20/25, 9:47 PM Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ ARC2 Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ EpicJapan | for Help :D ARC2 Chat Mod 5/20/25, 9:48 PM maybe not for now? I woudl appreciate all available info though tysm 1 ARC2 Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ EpicJapan | for Help :D ARC2 Chat Mod 5/20/25, 9:48 PM maybe not for now? I woudl appreciate all available info though tysm 1 Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ maybe not for now? I woudl appreciate all available info though tysm EasyVictor ARC2 Senior Archer 5/21/25, 12:20 AM Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. , (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape but the orientation does not matter. -also after each movement, get one or two shots off, but never three, it’s too risky. • Using the triangle method is the best way to avoid his 3x charge. This will also keep him in close if you are using circle attack/runes. After movement, shoot shoot move. • Second attack is typically jump attack then immediate meteors. If you can get one shot off in between these attacks go for it, but not at the cost of eating a meteor. After the meteors fall, shoot shoot move. • Lastly, you have the flame shot that splits into 6. The triangle method is perfect to avoid this because it may be a charge. Avoid the flame, possibly shoot, move to avoid the flame spread, shoot again. Rinse and repeat EasyVictor ARC2 Senior Archer 5/21/25, 12:20 AM Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. , (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape but the orientation does not matter. -also after each movement, get one or two shots off, but never three, it’s too risky. • Using the triangle method is the best way to avoid his 3x charge. This will also keep him in close if you are using circle attack/runes. After movement, shoot shoot move. • Second attack is typically jump attack then immediate meteors. If you can get one shot off in between these attacks go for it, but not at the cost of eating a meteor. After the meteors fall, shoot shoot move. • Lastly, you have the flame shot that splits into 6. The triangle method is perfect to avoid this because it may be a charge. Avoid the flame, possibly shoot, move to avoid the flame spread, shoot again. Rinse and repeat Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. , (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape but the orientation does not matter. -also after each movement, get one or two shots off, but never three, it’s too risky. • Using the triangle method is the best way to avoid his 3x charge. This will also keep him in close if you are using circle attack/runes. After movement, shoot shoot move. • Second attack is typically jump attack then immediate meteors. If you can get one shot off in between these attacks go for it, but not at the cost of eating a meteor. After the meteors fall, shoot shoot move. • Lastly, you have the flame shot that splits into 6. The triangle method is perfect to avoid this because it may be a charge. Avoid the flame, possibly shoot, move to avoid the flame spread, shoot again. Rinse and repeat ARC2 Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape EpicJapan | for Help :D ARC2 Chat Mod 5/21/25, 1:23 AM ty' ARC2 Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape EpicJapan | for Help :D ARC2 Chat Mod 5/21/25, 1:23 AM ty' Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape EasyVictor ARC2 Senior Archer 5/22/25, 7:02 PM Stone Golem • This boss has 3 different attacks. A rolling bowling boulder attack that eventually splits into 6. The big boulder will also track/follow. , (If this big boulder hits a wall, it will not split and will disappear) A triple rock split. , (Edit) Lastly, he also shoots 5 fast boulders at that are mostly guaranteed hits if you are close to him. , (If you freeze or paralyze him, he will never throw these) • This boss will always throw with his right arm. • My trick is to stand mostly in between him in the center and the wall. This is in the hopes when he tosses the boulder, it will cancel. If it’s the triple rock split you’re still good to go. , • The biggest point is to always rotate to dodge in a counterclockwise direction. This is to have to better chance of dodging the tosses. If you dodge clockwise, you run a much bigger risk of taking a bolder or rock throw. , (edited) 1 1 September 30, 2025 My pve set is xbow, oracle amulet, griffin ring, oracle chest, dragoon helm, oracle boots (all M0-M2) frog Senior Archer 9/30/25, 5:21 PM What a My pve set is xbow, oracle amulet, griffin ring, oracle chest, dragoon helm, oracle boots (all M0-M2) MX4 Novice Explorer 9/30/25, 6:20 PM Can I ask why griffin ring with xbow? Can xbow crit? Can I ask why griffin ring with xbow? Can xbow crit? Shadowfax88 Legendary Archer 9/30/25, 6:41 PM All main weapons can crit. It's the just the xbow's explosion that doesn't crit but the base arrow damage does (edited) But also because mythic oracle ring isn't that great either Shadowfax88 Legendary Archer 9/30/25, 6:51 PM You end up doing a lot of main weapon damage in chapters and seal/guild boss so in my experience the extra crit is better than the slightly higher attack speed. Especially because the oracle boots give and extra +48% crit damage You end up doing a lot of main weapon damage in chapters and seal/guild boss so in my experience the extra crit is better than the slightly higher attack speed. Especially because the oracle boots give and extra +48% crit damage MX4 Novice Explorer 9/30/25, 7:30 PM Makes sense, appreciate! Tryhard Cat MOP L+3 xbow is better than M+2 spear M0 xbow is better than M+3 spear M+2 xbow is better than M+4 spear M+3 xbow is almost bettee than chaotic spear, but M+4 xbow is Caspase Senior Archer 9/30/25, 7:38 PM Someone should pin this October 3, 2025 crustybutt Junior Archer 10/3/25, 5:51 AM Why do people go mixed oracle xbow is it bette than going mixed oracle with griffin Why do people go mixed oracle xbow is it bette than going mixed oracle with griffin RB773 Mythic Archer 10/3/25, 6:06 AM what people? Why do people go mixed oracle xbow is it bette than going mixed oracle with griffin BigRed Junior Archer 10/3/25, 10:51 AM For the synergy between chaotic griffin neck (drops hearts) and chaotic oracle chest (hearts make you invincible) Чико Сенко Novice Explorer 10/3/25, 11:57 AM Can someone help me build better runes n hesr for pvp wirh what I got ? what people? crustybutt Junior Archer 10/3/25, 3:42 PM i hear a lot more about oracle with xbow than with claw For the synergy between chaotic griffin neck (drops hearts) and chaotic oracle chest (hearts make you invincible) crustybutt Junior Archer 10/3/25, 3:43 PM u saying claw better? u saying claw better? BigRed Junior Archer 10/3/25, 4:59 PM You could probably argue whether xbow or claw is BIS for PvP, but there’s no doubt BIS includes griffin neck and oracle chest (at chaotic) October 4, 2025 Petrichor PVZ Senior Archer Yesterday at 12:53 AM Is dragoon ring or oracle ring better? I’m guessing dragoon for pvp But what about chapters and seal RB773 Mythic Archer Yesterday at 12:56 AM griffin ring is the best for most bosses pre-chaotic dragoon and oracle ring are not very impactful oracle at chaotic You could probably argue whether xbow or claw is BIS for PvP, but there’s no doubt BIS includes griffin neck and oracle chest (at chaotic) crustybutt Junior Archer Yesterday at 4:23 AM i see but then u would gotta set distance to close right and at that point just go claw and at that point just go claw RB773 Mythic Archer Yesterday at 4:44 AM not really, xbow still deals more damage even when set to close but if you want to tank more at chaotic, claw is better crustybutt Junior Archer Yesterday at 4:46 AM hm okay thanks Fluky Senior Archer Yesterday at 8:52 AM Do griffin ring and helm have a min distance for bonus to activate? Do griffin ring and helm have a min distance for bonus to activate? Shadowfax88 Legendary Archer Yesterday at 8:58 AM Yes, same distance as RoA (7m) but griffin helm gets higher as you get closer. Ring is just on how many enemies are within that distance Fluky Senior Archer Yesterday at 8:59 AM So its 7m and closer alright thanks dragoon and oracle ring are not very impactful Petrichor PVZ Senior Archer Yesterday at 8:59 AM between the two what would be better? don't have any griffin unfortunately So its 7m and closer alright thanks Shadowfax88 Legendary Archer Yesterday at 9:03 AM Yes PVZ between the two what would be better? don't have any griffin unfortunately Shadowfax88 Legendary Archer Yesterday at 9:04 AM It depends if you have Thor or how good you are at stutter stepping It depends if you have Thor or how good you are at stutter stepping Petrichor PVZ Senior Archer Yesterday at 9:04 AM ah, no thor and I can't stutter step PVZ ah, no thor and I can't stutter step Shadowfax88 Legendary Archer Yesterday at 9:37 AM In that case it depends on which is a higher rarity in PvE because the extra attack is beneficial but you'd also benefit some from the atk speed boost of oracle ring In that case it depends on which is a higher rarity in PvE because the extra attack is beneficial but you'd also benefit some from the atk speed boost of oracle ring Petrichor PVZ Senior Archer Yesterday at 9:38 AM They both at mythic Shadowfax88 Legendary Archer Yesterday at 9:38 AM I've never really used dragoon ring so I don't know how useful it actually is but I can't imagine very much. I do personally prefer griffin ring Petrichor PVZ Senior Archer Yesterday at 9:38 AM Ahh fair PVZ between the two what would be better? don't have any griffin unfortunately RB773 Mythic Archer Yesterday at 9:42 AM It's very hard to test this, but I would say, if you stutter step, go for dragoon, if you don't, go for oracle.. babpls Novice Explorer Yesterday at 12:00 PM why are oracle boots recommended for pve? aren’t mythic dragoon boots good for the dodge? why are oracle boots recommended for pve? aren’t mythic dragoon boots good for the dodge? Shadowfax88 Legendary Archer Yesterday at 12:02 PM Because the idea is not to get hit at all and the extra crit dmg from the oracle boots is fairly useful (edited) 1 But if you struggle dodging projectiles, the dragoon boots may be better Hybridreamer Junior Archer Yesterday at 12:58 PM If I'm starting to push for mixed set. Should I go for mythic oracle spear or xbow first before I have dragoon helm If I'm starting to push for mixed set. Should I go for mythic oracle spear or xbow first before I have dragoon helm WetTissue69 Senior Archer Yesterday at 1:17 PM Xbow 1 Hybridreamer Junior Archer Yesterday at 1:19 PM thanks If I'm starting to push for mixed set. Should I go for mythic oracle spear or xbow first before I have dragoon helm RB773 Mythic Archer Yesterday at 7:58 PM you don't need staff for anything it's one of the most useless gear in the game unless you have maxed leg wep skin Hybridreamer Junior Archer Yesterday at 8:10 PM Those are strong words lok it's one of the most useless gear in the game Hybridreamer Junior Archer Yesterday at 8:22 PM I prioritize PvE over pvp personally so surely oracle isn't that bad I prioritize PvE over pvp personally so surely oracle isn't that bad RB773 Mythic Archer Yesterday at 9:15 PM the staff is My pve set is xbow, oracle amulet, griffin ring, oracle chest, dragoon helm, oracle boots (all M0-M2) frog Senior Archer 9/30/25, 5:21 PM What a My pve set is xbow, oracle amulet, griffin ring, oracle chest, dragoon helm, oracle boots (all M0-M2) frog Senior Archer 9/30/25, 5:21 PM What a My pve set is xbow, oracle amulet, griffin ring, oracle chest, dragoon helm, oracle boots (all M0-M2) What a My pve set is xbow, oracle amulet, griffin ring, oracle chest, dragoon helm, oracle boots (all M0-M2) MX4 Novice Explorer 9/30/25, 6:20 PM Can I ask why griffin ring with xbow? Can xbow crit? My pve set is xbow, oracle amulet, griffin ring, oracle chest, dragoon helm, oracle boots (all M0-M2) MX4 Novice Explorer 9/30/25, 6:20 PM Can I ask why griffin ring with xbow? Can xbow crit? My pve set is xbow, oracle amulet, griffin ring, oracle chest, dragoon helm, oracle boots (all M0-M2) Can I ask why griffin ring with xbow? Can xbow crit? Can I ask why griffin ring with xbow? Can xbow crit? Shadowfax88 Legendary Archer 9/30/25, 6:41 PM All main weapons can crit. It's the just the xbow's explosion that doesn't crit but the base arrow damage does (edited) Can I ask why griffin ring with xbow? Can xbow crit? Shadowfax88 Legendary Archer 9/30/25, 6:41 PM All main weapons can crit. It's the just the xbow's explosion that doesn't crit but the base arrow damage does (edited) Can I ask why griffin ring with xbow? Can xbow crit? All main weapons can crit. It's the just the xbow's explosion that doesn't crit but the base arrow damage does (edited) But also because mythic oracle ring isn't that great either But also because mythic oracle ring isn't that great either But also because mythic oracle ring isn't that great either Shadowfax88 Legendary Archer 9/30/25, 6:51 PM You end up doing a lot of main weapon damage in chapters and seal/guild boss so in my experience the extra crit is better than the slightly higher attack speed. Especially because the oracle boots give and extra +48% crit damage Shadowfax88 Legendary Archer 9/30/25, 6:51 PM You end up doing a lot of main weapon damage in chapters and seal/guild boss so in my experience the extra crit is better than the slightly higher attack speed. Especially because the oracle boots give and extra +48% crit damage You end up doing a lot of main weapon damage in chapters and seal/guild boss so in my experience the extra crit is better than the slightly higher attack speed. Especially because the oracle boots give and extra +48% crit damage You end up doing a lot of main weapon damage in chapters and seal/guild boss so in my experience the extra crit is better than the slightly higher attack speed. Especially because the oracle boots give and extra +48% crit damage MX4 Novice Explorer 9/30/25, 7:30 PM Makes sense, appreciate! September 30, 2025 extremelyaverage Senior Archer 9/30/25, 11:59 AM and otta Yes. It can RB773 Mythic Archer 9/30/25, 8:28 PM does that make Drac good In Peak/GvG or still bad? Yes. It can RB773 Mythic Archer 9/30/25, 8:28 PM thx softcorecinnamon Senior Archer 9/30/25, 9:09 PM Asking a pvp build question. What would be better for griffin build. 7 star helix with max ducklix skin, 2 star otta with max nian skin, and 6 star thor. Or 6 star thor with 0 star old skin not new, 2 star otta with max nian skin, and 1 star dk no skin. Asking a pvp build question. What would be better for griffin build. 7 star helix with max ducklix skin, 2 star otta with max nian skin, and 6 star thor. Or 6 star thor with 0 star old skin not new, 2 star otta with max nian skin, and 1 star dk no skin. RB773 Mythic Archer 9/30/25, 9:50 PM 2nd option for Arena and Peak for GvG ... probably the 1st option actually for griffin 2nd option in all PvP the Squirtle Squirt For pve anyways. PvP I guess Loki as the base would be good at 8 star softcorecinnamon Senior Archer 9/30/25, 10:15 PM If loki skin worked he would be in pvp Asking a pvp build question. What would be better for griffin build. 7 star helix with max ducklix skin, 2 star otta with max nian skin, and 6 star thor. Or 6 star thor with 0 star old skin not new, 2 star otta with max nian skin, and 1 star dk no skin. Ty the Squirtle Squirt Elite Archer 9/30/25, 10:24 PM I would imagine option 2 in all PvP circumstances is better. But you would have to go to vip land to really know 6 star Thor isn’t a normal character to have October 1, 2025 the Squirtle Squirt I would imagine option 2 in all PvP circumstances is better. But you would have to go to vip land to really know Exodus the Coach | P90015619 Elite Archer 10/1/25, 6:12 AM Yea my guildmates has thor 8 its crazy 1 the Coach | P90015619 Yea my guildmates has thor 8 its crazy murvy Legendary Archer 10/1/25, 7:56 AM Damn Urag Novice Explorer 10/1/25, 8:29 PM im on a point that as F2P which character and skin need to focus. all my rares has 3 stars. Have 0 epics characters besides Rolla Otta with Nian Skin and Atreus at 0 maybe, focus on Helix until 8 maybe, focus on Helix until 8 RB773 Mythic Archer 10/1/25, 8:46 PM ye maybe, focus on Helix until 8 Ty the Squirtle Squirt Elite Archer 10/1/25, 9:15 PM Helix at least until 6, 8 is good but expensive. Thor the goat. Otta up to 2 star then stop. Insert Nyanja 6 star for pve if you really want, but prob just use your guild coins on blessed runes after helix 6 October 2, 2025 Urag Novice Explorer 10/2/25, 5:23 AM Aight, ty ty fylopian STFC Senior Archer 10/2/25, 10:24 AM is it worth it to level up Otta past 2. I can get 5 a week from guild expedition Shadowfax88 Legendary Archer 10/2/25, 10:42 AM No, not particularly useful. You get an extra +4% crit rate at his 4 passive but I doubt it's worth it for the extra 250 shards it would cost. If you already have the etched and blessings runes that you need, it would basically be the equivalent of 900 enchant rolls from the shop which is probably much better than leveling otta (edited) Ty the Squirtle Squirt Elite Archer 10/2/25, 11:06 AM Ya leveling otta past 2 can be one of the last things you do Sebiias Tryhard Cat MOP Range Master 10/2/25, 11:35 AM 3 stars is just resonance, 4 stars is +4% crit rate which is basically a flute and 5 stars is not bad but the time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "event (edited) July 16, 2025 Kay Novice Explorer 7/16/25, 10:27 AM i have a few questions is if anyone can help answer is the damage formula computing overall dmg or main weapon damage? does the formula vary across the different damage categories? How would +30% main weapon dmg be computed? – boost on base ATK stats or base weapon ATK stats or ? +30% on the end dmg figure doesn’t make sense to me as that includes crit and other additives (edited) is the damage formula computing overall dmg or main weapon damage? does the formula vary across the different damage categories? How would +30% main weapon dmg be computed? – boost on base ATK stats or base weapon ATK stats or ? +30% on the end dmg figure doesn’t make sense to me as that includes crit and other additives fierywind 7/16/25, 9:42 PM it's written as a main weapon damage formula, but the same formula (or at least variations of it) is used to compute all damage - for the 30% main weapon damage, it would go in category D 1 which means it will be additive with front arrow and any other main weapon damage modifiers 1 July 17, 2025 klumbzy [-301] Archer Booster 7/17/25, 8:43 AM But luck does indirectly increase chances to get higher rarity skills if you have rabbit foot rune equipped [-301] But luck does indirectly increase chances to get higher rarity skills if you have rabbit foot rune equipped Sebiias Tryhard Cat MOP Range Master 7/17/25, 8:54 AM Rabbit's foot acts the same way with or without luck, rabbit's foot increases chances for blue skills in 20% by decreasing chances of green skills in 20%, luck doesn't do anything Tryhard Cat MOP Rabbit's foot acts the same way with or without luck, rabbit's foot increases chances for blue skills in 20% by decreasing chances of green skills in 20%, luck doesn't do anything klumbzy [-301] Archer Booster 7/17/25, 9:20 AM Huh. Good to know. Myrda Junior Archer 7/17/25, 10:01 AM Does anyone know the increase in atk speed/ crit rate that frenzy potion gives Does anyone know the increase in atk speed/ crit rate that frenzy potion gives Poosti Wiki Contributor 7/17/25, 10:44 AM !skills Poosti !skills Sapphire Bots APP 7/17/25, 10:44 AM ⁠unknown Poosti Wiki Contributor 7/17/25, 10:44 AM ^ September 29, 2025 Reein Novice Explorer 9/29/25, 7:04 PM Any1 knows which is better? Main weapon dmg +30% (mythic) or main weapon crit rate +15% (legendary) on full mythic oracle set RB773 Mythic Archer 9/29/25, 10:29 PM you can test it by doing a boss practice run without picking any skills it depends on how much crit you have already October 3, 2025 fierywind THIS IS A WORK IN PROGRESS If you spot any errors, pm me. This is the result of about a month of testing from myself, , and -user . The focus was on damage numbers and skills, but work is being done on runes, attack speed, etc. Eventually the goal is to be able to create a dps calculator where you select a series of toggles repsenting your runes, gear, artifacts, skills etc and you'll see how much of a dps increase a given skill choice is. If anyone thinks of good questions to add to the FAQ, lmk. lilian122 Senior Archer 10/3/25, 5:53 AM does it still updating? does it still updating? renox Legendary Archer 10/3/25, 6:03 AM not really there's only gonna be update to devil skill pool, to reflect the [not so recent anymore] change in the game, but that's about it Zizmir Junior Archer 6/1/25, 4:52 AM Ik was just joking about his pfp bias xd 1 Zizmir Junior Archer 6/1/25, 4:52 AM Ik was just joking about his pfp bias xd 1 Ik was just joking about his pfp bias xd Jemdhar 6/1/25, 4:53 AM also tracking slows down youre projrctiles, which makes smaller erings (with swift arrow) hit more often cuz they have more \"time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "events XD (edited) Sunday, October 5, 2025 at 7:58 PM You'Re Viewing Older Messages Jump To Present Tryhard Cat MOP Bad, it needs to be mixed with oracle pieces to be the best gear set murvy Legendary Archer 10/5/25, 8:55 AM Sunday, October 5, 2025 at 8:55 AM Amulett, ring, chest? Boots too? Tryhard Cat MOP Bad, it needs to be mixed with oracle pieces to be the best gear set murvy Legendary Archer 10/5/25, 8:55 AM Sunday, October 5, 2025 at 8:55 AM Amulett, ring, chest? Boots too? Bad, it needs to be mixed with oracle pieces to be the best gear set Amulett, ring, chest? Boots too? Sebiias Tryhard Cat MOP Range Master 10/5/25, 8:56 AM Sunday, October 5, 2025 at 8:56 AM yeah boots too 1 Sebiias Tryhard Cat MOP Range Master 10/5/25, 8:56 AM Sunday, October 5, 2025 at 8:56 AM yeah boots too 1 yeah boots too murvy Legendary Archer 10/5/25, 8:56 AM Sunday, October 5, 2025 at 8:56 AM Pvp beeing griffin Amulett and Ring. Also oracle chest murvy Legendary Archer 10/5/25, 8:56 AM Sunday, October 5, 2025 at 8:56 AM Pvp beeing griffin Amulett and Ring. Also oracle chest Pvp beeing griffin Amulett and Ring. Also oracle chest murvy Legendary Archer 10/5/25, 9:03 AM Sunday, October 5, 2025 at 9:03 AM Tryhard Cat MOP ^ murvy Legendary Archer 10/5/25, 9:03 AM Sunday, October 5, 2025 at 9:03 AM Tryhard Cat MOP ^ Tryhard Cat MOP ^ Pvp beeing griffin Amulett and Ring. Also oracle chest Sebiias Tryhard Cat MOP Range Master 10/5/25, 9:04 AM Sunday, October 5, 2025 at 9:04 AM on chaotic Pvp beeing griffin Amulett and Ring. Also oracle chest Sebiias Tryhard Cat MOP Range Master 10/5/25, 9:04 AM Sunday, October 5, 2025 at 9:04 AM on chaotic Pvp beeing griffin Amulett and Ring. Also oracle chest September 25, 2025 ⲦⲞⅪⅭ Yes in vip murvy Legendary Archer 9/25/25, 10:00 AM Thursday, September 25, 2025 at 10:00 AM Can you share? ⲦⲞⅪⅭ Yes in vip Ty the Squirtle Squirt Elite Archer 9/25/25, 10:09 AM Thursday, September 25, 2025 at 10:09 AM Well that is ridiculously stupid Not even dropping the calendar for players anymore is a joke. No wonder everyone’s server is dead epex ⲦⲞⅪⅭ Senior Archer 9/25/25, 10:18 AM Thursday, September 25, 2025 at 10:18 AM Forwarded 2 the Squirtle Squirt Not even dropping the calendar for players anymore is a joke. No wonder everyone’s server is dead epex ⲦⲞⅪⅭ Senior Archer 9/25/25, 10:20 AM Thursday, September 25, 2025 at 10:20 AM Maybe they just post it a few days later here If not thats extremly dumb since everyone will know anyway ⲦⲞⅪⅭ Maybe they just post it a few days later here Ty the Squirtle Squirt Elite Archer 9/25/25, 10:23 AM Thursday, September 25, 2025 at 10:23 AM When did you get it there? People have been requesting for months to have it a week before the new month here. To see they have it done but just screw that off is annoying as hell. Another easy way they could’ve shown good faith with the community for free just on fylopian STFC Senior Archer 9/25/25, 10:52 AM Thursday, September 25, 2025 at 10:52 AM would there be ideal runes to pair with the nian otta skin? I have the potion etched rune. Like giant meteor? October 4, 2025 Fandral - 2M ARC2 Legendary Archer 10/4/25, 12:02 AM Saturday, October 4, 2025 at 12:02 AM Are epic skins still better than leg ? Dr. Latias | -1116 Rank 1 Mythic Archer 10/4/25, 3:41 AM Saturday, October 4, 2025 at 3:41 AM Yes October 5, 2025 randomperson08363 Junior Archer 10/5/25, 6:16 AM Sunday, October 5, 2025 at 6:16 AM I see that nobody posted anything on the epic oracle skin yet. It looks like a decent boost for pvp I prefer cats over dogs feet Archer Booster 10/5/25, 7:11 AM Sunday, October 5, 2025 at 7:11 AM its somewhat effective against griffins prefer cats over dogs feet its somewhat effective against griffins randomperson08363 Junior Archer 10/5/25, 7:44 AM Sunday, October 5, 2025 at 7:44 AM Because they lag a bit? The reduction in attack speed looks good vs all on paper, since you basically negate a helix power up I prefer cats over dogs feet Archer Booster 10/5/25, 7:57 AM Sunday, October 5, 2025 at 7:57 AM also movement they’re slowed down and take more time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "event to save up for the leg bow, or should I just spend on keys? I'm f2p dragoon. Is it worth getting razor cores in every event to save up for the leg bow, or should I just spend on keys? Ty the Squirtle Squirt Elite Archer 10/5/25, 11:25 PM Sunday, October 5, 2025 at 11:25 PM Definitely not at all, the current dragoon skins are mid at best. Though character skins are good and worth saving cores for, over getting just keys. Stu Novice Explorer 10/5/25, 11:26 PM Sunday, October 5, 2025 at 11:26 PM Thanks. Still waiting to unlock thor at which point I've heard his old skin isn't great. Not sure if his new one is worth it or not Thanks. Still waiting to unlock thor at which point I've heard his old skin isn't great. Not sure if his new one is worth it or not Ty the Squirtle Squirt Elite Archer 10/5/25, 11:27 PM Sunday, October 5, 2025 at 11:27 PM No idea on the new one, haven’t seen any gameplay. The old one is a little dmg boost but ya boy crazy. Better than the bow skins tho But there are other character skins that are much better, ie ducklix and nian otta for PvP and even ice diva for pve for utility over a dmg boost. epic 0 is very good at both PvP and PvE, leg scales well and is broken in PvE $65 Stumpy Archer Booster 10/5/25, 11:29 PM Sunday, October 5, 2025 at 11:29 PM What do you mean with \"0\"? RB773 Mythic Archer 10/5/25, 11:33 PM Sunday, October 5, 2025 at 11:33 PM 0 stars the Squirtle Squirt But there are other character skins that are much better, ie ducklix and nian otta for PvP and even ice diva for pve for utility over a dmg boost. Stu Novice Explorer 10/5/25, 11:40 PM Sunday, October 5, 2025 at 11:40 PM Yeah annoyingly I bought 2 razor starcores last event and 0 skin ones but I'll get ducklix and keys with the rest October 6, 2025 Yeah annoyingly I bought 2 razor starcores last event and 0 skin ones but I'll get ducklix and keys with the rest Ty the Squirtle Squirt Elite Archer Yesterday at 12:15 AM Monday, October 6, 2025 at 12:15 AM Grab 4 more and just get the epic skin. Everyone who got it says the base level is all you need It’s not great but it’s better than the legendary for it….or you can just save the 2 for when they do release more weapon skins whenever cooncheese888 Novice Explorer Yesterday at 12:25 AM Monday, October 6, 2025 at 12:25 AM hey guys just joined and wanna ask should I save for one of the thor skins or the oracle skin as I'm on 0 currency for both of them and just started the game (I have thor) hey guys just joined and wanna ask should I save for one of the thor skins or the oracle skin as I'm on 0 currency for both of them and just started the game (I have thor) RB773 Mythic Archer Yesterday at 1:43 AM Monday, October 6, 2025 at 1:43 AM epic 0 weapon skin first epic 0 weapon skin first cooncheese888 Novice Explorer Yesterday at 1:47 AM Monday, October 6, 2025 at 1:47 AM ty epic 0 is very good at both PvP and PvE, leg scales well and is broken in PvE maxkelth Senior Archer Yesterday at 11:52 PM Monday, October 6, 2025 at 11:52 PM What means broken? Not working? October 7, 2025 What means broken? Not working? Shadowfax88 Legendary Archer 12:04 AM Tuesday, October 7, 2025 at 12:04 AM In this case, it's slang for works very well 1 epic 0 is very good at both PvP and PvE, leg scales well and is broken in PvE randomperson08363 Junior Archer 3:16 AM Tuesday, October 7, 2025 at 3:16 AM how is it broken? is it true at 0 as well? how is it broken? is it true at 0 as well? RB773 Mythic Archer 3:31 AM Tuesday, October 7, 2025 at 3:31 AM it scales very well at high stars and deals a lot of damage ⲦⲞⅪⅭ Yes in vip murvy Legendary Archer 9/25/25, 10:00 AM Thursday, September 25, 2025 at 10:00 AM Can you share? ⲦⲞⅪⅭ Yes in vip murvy Legendary Archer 9/25/25, 10:00 AM Thursday, September 25, 2025 at 10:00 AM Can you share? Can you share? ⲦⲞⅪⅭ Yes in vip Ty the Squirtle Squirt Elite Archer 9/25/25, 10:09 AM Thursday, September 25, 2025 at 10:09 AM Well that is ridiculously stupid ⲦⲞⅪⅭ Yes in vip Ty the Squirtle Squirt Elite Archer 9/25/25, 10:09 AM Thursday, September 25, 2025 at 10:09 AM Well that is ridiculously stupid Well that is ridiculously stupid Not even dropping the calendar for players anymore is a joke. No wonder everyone’s server is dead Not even dropping the calendar for players anymore is a joke. No wonder everyone’s server is dead Not even dropping the calendar for players anymore is a joke. No wonder everyone’s server is dead epex ⲦⲞⅪⅭ Senior Archer 9/25/25, 10:18 AM Thursday, September 25, 2025 at 10:18 AM Forwarded epex ⲦⲞⅪⅭ Senior Archer 9/25/25, 10:18 AM Thursday, September 25, 2025 at 10:18 AM Forwarded the Squirtle Squirt Not even dropping the calendar for players anymore is a joke. No wonder everyone’s server is dead epex ⲦⲞⅪⅭ Senior Archer 9/25/25, 10:20 AM Thursday, September 25, 2025 at 10:20 AM Maybe they just post it a few days later here September 28, 2025 Funny Boy Big question guys, dragoon leg+3 no skin oracle mythic+1 with purple skin? Gabriel Dolce Senior Archer 9/28/25, 5:39 PM Sunday, September 28, 2025 at 5:39 PM I’m interested about this too. If someone has an answer Dolce Hello guys. I’m here for a question. I got my second Aeon core. Already have Thor, what should I get next ? Atreus ? Shadowfax88 Legendary Archer 9/28/25, 11:12 PM Sunday, September 28, 2025 at 11:12 PM Hand to say. If you have the patience, honestly, I would probably save the aeon core for when this event comes around again in about 4 weeks because it sounds like their may be a new character added then 1 September 29, 2025 fylopian STFC Senior Archer 9/29/25, 4:26 PM Monday, September 29, 2025 at 4:26 PM Is sprite’s awe good because of the legendary skill? Never seem to get much sprite dmg (epic) STFC Is sprite’s awe good because of the legendary skill? Never seem to get much sprite dmg (epic) Shadowfax88 Legendary Archer 9/29/25, 4:38 PM Monday, September 29, 2025 at 4:38 PM Yes, it's mostly because of the legendary skill. Unless you get laser sprite skill, than even just the extra clone is useful (especially if you also have sprite multishot) 1 October 1, 2025 Baseball Archer Booster 10/1/25, 7:19 PM Wednesday, October 1, 2025 at 7:19 PM For pvp i just got thor. Should i run it with freeze shot or demon shield i am a full elemental rune build but im not sure if the frost adds enough to be better than shield For pvp i just got thor. Should i run it with freeze shot or demon shield i am a full elemental rune build but im not sure if the frost adds enough to be better than shield RB773 Mythic Archer 10/1/25, 8:18 PM Wednesday, October 1, 2025 at 8:18 PM Atreus in Arena for sure. in GvG it depends but I don't see why you would run rolla anyways Baseball Archer Booster 10/1/25, 8:40 PM Wednesday, October 1, 2025 at 8:40 PM kk thx October 3, 2025 Gabriel Dolce Senior Archer 10/3/25, 1:46 AM Friday, October 3, 2025 at 1:46 AM Any advice on what I should use/change for pvp ? Dolce Any advice on what I should use/change for pvp ? BigRed Junior Archer 10/3/25, 11:32 AM Friday, October 3, 2025 at 11:32 AM Have you shifted from Oracle to Dragoon? What chests are you pulling? If yes, once you get Xbow to Legendary +3, I'd swap in the Drag Xbow, boots, helm and move from sprites to meteor build. I'd probaly leave things as they are though absent any equipment/rune upgrades. Have you shifted from Oracle to Dragoon? What chests are you pulling? If yes, once you get Xbow to Legendary +3, I'd swap in the Drag Xbow, boots, helm and move from sprites to meteor build. I'd probaly leave things as they are though absent any equipment/rune upgrades. Gabriel Dolce Senior Archer 10/3/25, 11:33 AM Friday, October 3, 2025 at 11:33 AM Yep, from oracle to dragoon. Opening dragoon chests. That’s what I’m going to do, thanks MX4 Novice Explorer 10/3/25, 5:04 PM Friday, October 3, 2025 at 5:04 PM What do you guys think that would be the best build for the peak arena? The 3 best characters, gear, and runes? I've been trying different things, but I haven't come to a concrete conclusion… October 4, 2025 RB773 Mythic Archer 10/4/25, 12:42 AM Saturday, October 4, 2025 at 12:42 AM chaotic dragoon weapon, helm, boots, griffin amulet, ring, oracle armor for 2 in front or claw with oracle helm if you have mythic circles Markb9094 Junior Archer 10/4/25, 3:29 AM Saturday, October 4, 2025 at 3:29 AM Is bounce really basically the best \"overall general\" #1 enchant for oracles in pvp gvg and peak? Ive seen some say it hasnt done much dmg for them. How good is bounce for oracles in pve? chaotic dragoon weapon, helm, boots, griffin amulet, ring, oracle armor MX4 Novice Explorer 10/4/25, 7:57 AM Saturday, October 4, 2025 at 7:57 AM I am using Helix with deciveness and circles (I don’t have griffin), Atreus with mixed set (dragoon and oracle) with meteors and potions, and Drac with the same build as Atreus. Helix close range, Atreus and Drac far I am using Helix with deciveness and circles (I don’t have griffin), Atreus with mixed set (dragoon and oracle) with meteors and potions, and Drac with the same build as Atreus. Helix close range, Atreus and Drac far RB773 Mythic Archer 10/4/25, 8:25 AM Saturday, October 4, 2025 at 8:25 AM without Thor and at least mythic griffin amulet, it's not even worth to go close 1 Shadowfax88 Legendary Archer 10/4/25, 8:35 AM Saturday, October 4, 2025 at 8:35 AM And depending on how much better your other gear is, it's probably not worth the extra fusion points And depending on how much better your other gear is, it's probably not worth the extra fusion points MX4 Novice Explorer 10/4/25, 10:29 AM Saturday, October 4, 2025 at 10:29 AM Makes sense. I added you too. I wonder if we could chat about the build? Shadowfax88 Legendary Archer 10/4/25, 10:38 AM Saturday, October 4, 2025 at 10:38 AM Sure October 5, 2025 Novaveteran Senior Archer 10/5/25, 4:34 AM Sunday, October 5, 2025 at 4:34 AM So I'm using a mix of dragoon and 2-3 red pieces of oracle. Using the meteor build. But even when having 1700k power and legendary +2 and +3 runes, i get destroyed by a just legendary griffin 1000k power person fylopian STFC Senior Archer 10/5/25, 11:47 AM Sunday, October 5, 2025 at 11:47 AM What rune should I use here for arena? I’m 6 star helix, with 6 star helix skin, Thor 0 and otta 2, with otta nian skin 0 I use oracle gear October 6, 2025 NEW So I'm using a mix of dragoon and 2-3 red pieces of oracle. Using the meteor build. But even when having 1700k power and legendary +2 and +3 runes, i get destroyed by a just legendary griffin 1000k power person TodoNuDeMeias Senior Archer Yesterday at 4:29 AM Monday, October 6, 2025 at 4:29 AM Runes? Gear levels? Runes? Gear levels? Novaveteran Senior Archer Yesterday at 4:33 AM Monday, October 6, 2025 at 4:33 AM Nah my gear lvl is higher, and my runes are way higher, ill try and see if i can find him again and show TodoNuDeMeias Senior Archer Yesterday at 4:36 AM Monday, October 6, 2025 at 4:36 AM Maybe enchantments Or somehow reso? STFC What rune should I use here for arena? I’m 6 star helix, with 6 star helix skin, Thor 0 and otta 2, with otta nian skin 0 I use oracle gear Shadowfax88 Legendary Archer Yesterday at 4:46 AM Monday, October 6, 2025 at 4:46 AM Double sprite etched. If you level up otta's skin, you could also possibly run a sword build (edited) Monday, October 6, 2025 at 4:47 AM Funny Boy Big question guys, dragoon leg+3 no skin oracle mythic+1 with purple skin? Gabriel Dolce Senior Archer 9/28/25, 5:39 PM Sunday, September 28, 2025 at 5:39 PM I’m interested about this too. If someone has an answer Funny Boy Big question guys, dragoon leg+3 no skin oracle mythic+1 with purple skin? Gabriel Dolce Senior Archer 9/28/25, 5:39 PM Sunday, September 28, 2025 at 5:39 PM I’m interested about this too. If someone has an answer Big question guys, dragoon leg+3 no skin oracle mythic+1 with purple skin? I’m interested about this too. If someone has an answer Dolce Hello guys. I’m here for a question. I got my second Aeon core. Already have Thor, what should I get next ? Atreus ? Shadowfax88 Legendary Archer 9/28/25, 11:12 PM Sunday, September 28, 2025 at 11:12 PM Hand to say. If you have the patience, honestly, I would probably save the aeon core for when this event comes around again in about 4 weeks because it sounds like their may be a new character added then 1 Dolce Hello guys. I’m here for a question. I got my second Aeon core. Already have Thor, what should I get next ? Atreus ? Shadowfax88 Legendary Archer 9/28/25, 11:12 PM Sunday, September 28, 2025 at 11:12 PM Hand to say. If you have the patience, honestly, I would probably save the aeon core for when this event comes around again in about 4 weeks because it sounds like their may be a new character added then 1 Hello guys. I’m here for a question. I got my second Aeon core. Already have Thor, what should I get next ? Atreus ? Hand to say. If you have the patience, honestly, I would probably save the aeon core for when this event comes around again in about 4 weeks because it sounds like their may be a new character added then fylopian STFC Senior Archer 9/29/25, 4:26 PM Monday, September 29, 2025 at 4:26 PM Is sprite’s awe good because of the legendary skill? Never seem to get much sprite dmg (epic) fylopian STFC Senior Archer 9/29/25, 4:26 PM Monday, September 29, 2025 at 4:26 PM Is sprite’s awe good because of the legendary skill? Never seem to get much sprite dmg (epic) Is sprite’s awe good because of the legendary skill? Never seem to get much sprite dmg (epic) STFC Is sprite’s awe good because of the legendary skill? Never seem to get much sprite dmg (epic) Shadowfax88 Legendary Archer 9/29/25, 4:38 PM Monday, September 29, 2025 at 4:38 PM Yes, it's mostly because of the legendary skill. Unless you get laser sprite skill, than even just the extra clone is useful (especially if you also have sprite multishot) 1 STFC Is sprite’s awe good because of the legendary skill? Never seem to get much sprite dmg (epic) Shadowfax88 Legendary Archer 9/29/25, 4:38 PM Monday, September 29, 2025 at 4:38 PM Yes, it's mostly because of the legendary skill. Unless you get laser sprite skill, than even just the extra clone is useful (especially if you also have sprite multishot) 1 Is sprite’s awe good because of the legendary skill? Never seem to get much sprite dmg (epic) Yes, it's mostly because of the legendary skill. Unless you get laser sprite skill, than even just the extra clone is useful (especially if you also have sprite multishot) Baseball Archer Booster 10/1/25, 7:19 PM Wednesday, October 1, 2025 at 7:19 PM For pvp i just got thor. Should i run it with freeze shot or demon shield i am a full elemental rune build but im not sure if the frost adds enough to be better than shield Baseball Archer Booster 10/1/25, 7:19 PM Wednesday, October 1, 2025 at 7:19 PM For pvp i just got thor. Should i run it with freeze shot or demon shield i am a full elemental rune build but im not sure if the frost adds enough to be better than shield For pvp i just got thor. Should i run it with freeze shot or demon shield i am a full elemental rune build but im not sure if the frost adds enough to be better than shield For pvp i just got thor. Should i run it with freeze shot or demon shield i am a full elemental rune build but im not sure if the frost adds enough to be better than shield RB773 Mythic Archer 10/1/25, 8:18 PM Wednesday, October 1, 2025 at 8:18 PM Atreus in Arena for sure. October 4, 2025 Archer Senior Archer 10/4/25, 7:35 PM Saturday, October 4, 2025 at 7:35 PM can't find any on leaderboard only alchemist October 5, 2025 are druids good damage dealers? camm OH Senior Archer 10/5/25, 12:30 AM Sunday, October 5, 2025 at 12:30 AM There’s multiple 500m+ druids on the leaderboard, just gotta get out of the top25 Ty the Squirtle Squirt Elite Archer 10/5/25, 12:33 AM Sunday, October 5, 2025 at 12:33 AM Leaderboards are class specific so I don’t get the question, unless you mean honor stele. Also Druids are the fastest clear class but boss dmg not the strongest the Squirtle Squirt Leaderboards are class specific so I don’t get the question, unless you mean honor stele. Also Druids are the fastest clear class but boss dmg not the strongest camm OH Senior Archer 10/5/25, 12:43 AM Sunday, October 5, 2025 at 12:43 AM There’s global leaderboard too OH There’s global leaderboard too Ty the Squirtle Squirt Elite Archer 10/5/25, 12:45 AM Sunday, October 5, 2025 at 12:45 AM Where? camm OH Senior Archer 10/5/25, 12:46 AM Sunday, October 5, 2025 at 12:46 AM “Honor Ranking” right next to the class leaderboards OH “Honor Ranking” right next to the class leaderboards Ty the Squirtle Squirt Elite Archer 10/5/25, 12:47 AM Sunday, October 5, 2025 at 12:47 AM I mean I put “unless you mean honor stele” in my first response camm OH Senior Archer 10/5/25, 12:48 AM Sunday, October 5, 2025 at 12:48 AM I mean that’s been the entire topic of discussion Class specific leaderboards are also server regional so he might not have a 500m+ Druid in his ladder Ty the Squirtle Squirt Elite Archer 10/5/25, 12:50 AM Sunday, October 5, 2025 at 12:50 AM True, the class specific ones are the only ones that give anything though…. And I gave a response for if he did mean the honor stele Druid is the fastest class not the highest dmg class Mahoney | P90015575 Elite Archer 10/5/25, 2:45 AM Sunday, October 5, 2025 at 2:45 AM Reverse psychology: go for swords next season for much easier top places 1 Fluky Senior Archer 10/5/25, 5:00 AM Sunday, October 5, 2025 at 5:00 AM What does punishment potion do? Fluky Senior Archer 10/5/25, 5:07 AM Sunday, October 5, 2025 at 5:07 AM Also what stat influence meteor damage? the Squirtle Squirt Leaderboards are class specific so I don’t get the question, unless you mean honor stele. Also Druids are the fastest clear class but boss dmg not the strongest Poosti Wiki Contributor 10/5/25, 10:57 AM Sunday, October 5, 2025 at 10:57 AM Me druid who cant clear under 2:30 Click to see attachment Ty the Squirtle Squirt Elite Archer 10/5/25, 10:57 AM Sunday, October 5, 2025 at 10:57 AM Me, a Druid who also hasn’t gone lower than 2:30 (edited) Sunday, October 5, 2025 at 10:58 AM Click to see attachment Vegetables Junior Archer 10/5/25, 11:01 AM Sunday, October 5, 2025 at 11:01 AM Use Rolla and don’t move. In my opinion the Squirtle Squirt Me, a Druid who also hasn’t gone lower than 2:30 (edited) Poosti Wiki Contributor 10/5/25, 11:01 AM Sunday, October 5, 2025 at 11:01 AM Use Rolla and don’t move. In my opinion Poosti Wiki Contributor 10/5/25, 11:02 AM Sunday, October 5, 2025 at 11:02 AM Whats ur lowest Whats ur lowest Vegetables Junior Archer 10/5/25, 11:02 AM Sunday, October 5, 2025 at 11:02 AM 2:26 That strat had me #2 on speed on day 1 though. Haven’t grinded as much since then 2:26 Poosti Wiki Contributor 10/5/25, 11:17 AM Sunday, October 5, 2025 at 11:17 AM Ill listen to u big dawg NEW nani Novice Explorer 10/5/25, 4:19 PM Sunday, October 5, 2025 at 4:19 PM Anyone know fastest way to grind the weekly limit of resources I prefer cats over dogs feet Archer Booster 10/5/25, 4:25 PM Sunday, October 5, 2025 at 4:25 PM do the highest ebonrot chapter nani Novice Explorer 10/5/25, 4:29 PM Sunday, October 5, 2025 at 4:29 PM That's the only way ay, what if you sometime",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "event Luck level carry over. 1 Demon event Luck level carry over. Sebiias Tryhard Cat MOP Range Master 7/7/25, 10:00 PM Monday, July 7, 2025 at 10:00 PM yeah July 10, 2025 | for Help :D ARC2 3k for task but ⁠Fishing Event Guide (Angler's B… for etched Nunyaa Junior Archer 7/10/25, 9:01 PM Thursday, July 10, 2025 at 9:01 PM Thanks so not much point unless you see these coming up which is still low requirements Thanks so not much point unless you see these coming up which is still low requirements EpicJapan | for Help :D ARC2 Chat Mod 7/10/25, 9:03 PM Thursday, July 10, 2025 at 9:03 PM ye July 12, 2025 silingmaanghang 7/12/25, 3:37 AM Saturday, July 12, 2025 at 3:37 AM can someone update this for the current event??? can someone update this for the current event??? Shadowfax88 Legendary Archer 7/12/25, 5:20 AM Saturday, July 12, 2025 at 5:20 AM It's already there... the current event is lucky treasure wheel can someone update this for the current event??? Sebiias Tryhard Cat MOP Range Master 7/12/25, 6:08 AM Saturday, July 12, 2025 at 6:08 AM Its the same July 20, 2025 Pontus Chat Mod 7/20/25, 8:25 AM Sunday, July 20, 2025 at 8:25 AM Sorry, accidentally pinged you in here instead of the normal thread EJ July 29, 2025 Bearon ES Junior Archer 7/29/25, 6:28 PM Tuesday, July 29, 2025 at 6:28 PM is this up to date ES is this up to date Sebiias Tryhard Cat MOP Range Master 7/29/25, 7:06 PM Tuesday, July 29, 2025 at 7:06 PM yeah Bearon ES Junior Archer 7/29/25, 7:31 PM Tuesday, July 29, 2025 at 7:31 PM ty! tea🍵 Archer Booster 7/29/25, 9:13 PM Tuesday, July 29, 2025 at 9:13 PM | for Help :D pls update vibrant voyage Vibrant Voyage Task list , Free pack: +7 tickets Login: +5 tickets Seal: +5 tickets Gold Cave: +5 tickets : +5 tickets Arena: +5 tickets Kill bosses: +3 tickets Kill minions: +6 tickets 50 Keys: +12 tickets 50 Wishes: +12 tickets 80 Shovels: +20 tickets 5k Gems: +10 tickets Total: 95 free tickets , Average currency per ticket: depends on your luck, can vary a lot apparently , Information taken from this same thread, if there is something wrong, please @ me with the correct info to fix it. Credits to Tryhard Cat MOP Vibrant voyage + Fishing event 3,000 / 80 / 50 + 50 keys/wishes + 80 Shovels August is going to be tough. 160 shovels and 100 keys needed omgawd 2 August 3, 2025 🍵 Vibrant voyage + Fishing event 3,000 / 80 / 50 + 50 keys/wishes + 80 Shovels August is going to be tough. 160 shovels and 100 keys needed omgawd Poosti Wiki Contributor 8/3/25, 4:49 AM Sunday, August 3, 2025 at 4:49 AM Bruh I have 0 shovels Where yall getting these Bruh I have 0 shovels tea🍵 Archer Booster 8/3/25, 4:52 AM Sunday, August 3, 2025 at 4:52 AM push sky tower 🍵 push sky tower Poosti Wiki Contributor 8/3/25, 4:52 AM Sunday, August 3, 2025 at 4:52 AM 🫩 tea🍵 Archer Booster 8/3/25, 4:52 AM Sunday, August 3, 2025 at 4:52 AM and treasure island 100k points i saved 400 dice and managed to roll treasure island 3 time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "event worth while? August 27, 2025 Julius Senior Archer 8/27/25, 12:40 AM Wednesday, August 27, 2025 at 12:40 AM Hi any info regarding other world thor event ? Hi any info regarding other world thor event ? Cruzix Elite Archer 8/27/25, 1:46 AM Wednesday, August 27, 2025 at 1:46 AM What info do you want exactly Julius Senior Archer 8/27/25, 1:51 AM Wednesday, August 27, 2025 at 1:51 AM like what to be save up like what to be save up 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 8/27/25, 2:11 AM Wednesday, August 27, 2025 at 2:11 AM It's the same as this one :)) Julius Senior Archer 8/27/25, 2:14 AM Wednesday, August 27, 2025 at 2:14 AM ahhhh i see okay! September 1, 2025 hopesix OG Senior Archer 9/1/25, 12:33 AM Monday, September 1, 2025 at 12:33 AM How do I access that guide on mobile sorry OG How do I access that guide on mobile sorry Sebiias Tryhard Cat MOP Range Master 9/1/25, 6:18 AM Monday, September 1, 2025 at 6:18 AM check pinned September 12, 2025 EviL | 7.4% Oracle User ARC2 Archer Booster 9/12/25, 12:40 PM Friday, September 12, 2025 at 12:40 PM . epex ⲦⲞⅪⅭ Senior Archer 9/12/25, 11:43 PM Friday, September 12, 2025 at 11:43 PM I’m so cooked bro I accidentally spent 1k on shovels September 13, 2025 Megalolek Junior Archer 9/13/25, 4:34 AM Saturday, September 13, 2025 at 4:34 AM 1k€ or 1k gems? 1k€ or 1k gems? epex ⲦⲞⅪⅭ Senior Archer 9/13/25, 10:34 AM Saturday, September 13, 2025 at 10:34 AM 1k gems that I would’ve rather spent on lures EviL | 7.4% Oracle User ARC2 Archer Booster 9/13/25, 10:36 AM Saturday, September 13, 2025 at 10:36 AM Megalolek Junior Archer 9/13/25, 1:08 PM Saturday, September 13, 2025 at 1:08 PM 1k gems means nothing xd sadly.... September 30, 2025 | 7.4% Oracle User ARC2 Click to see attachment gryfel Senior Archer 9/30/25, 9:30 AM Tuesday, September 30, 2025 at 9:30 AM ⁠[Eternal Lode] Still Missing Mo… Please 🆙️ if you want more shovels October 3, 2025 RB773 Mythic Archer 10/3/25, 9:29 PM Friday, October 3, 2025 at 9:29 PM anyone know how high are the keys and gems tasks in this new event? shovels are 80 and wishes are 50 anyone know how high are the keys and gems tasks in this new event? Shadowfax88 Legendary Archer 10/3/25, 9:33 PM Friday, October 3, 2025 at 9:33 PM Keys are 50 Gems are 5k RB773 Mythic Archer 10/3/25, 9:34 PM Friday, October 3, 2025 at 9:34 PM thanks gryfel Senior Archer 10/3/25, 11:53 PM Friday, October 3, 2025 at 11:53 PM 50 wishes if we are counting October 4, 2025 envenom1414 Legendary Archer 10/4/25, 12:38 AM Saturday, October 4, 2025 at 12:38 AM 80 shovels 1 October 5, 2025 80 shovels ANakav3v Senior Archer 10/5/25, 3:15 AM Sunday, October 5, 2025 at 3:15 AM for real 80 shovels...? for real 80 shovels...? envenom1414 Legendary Archer 10/5/25, 3:37 AM Sunday, October 5, 2025 at 3:37 AM Unfortunately yeah 1 for real 80 shovels...? gryfel Senior Archer 10/5/25, 8:04 AM Sunday, October 5, 2025 at 8:04 AM Please like if you also hate it ⁠[Event] Delete Moonshade Myth E… 1 for real 80 shovels...? gryfel Senior Archer 10/5/25, 8:06 AM Sunday, October 5, 2025 at 8:06 AM ⁠[Eternal Lode] Still Missing Mo… This if you want to complain about missing shovels they promised 1 ANakav3v Senior Archer 10/5/25, 8:09 AM Sunday, October 5, 2025 at 8:09 AM liked B3RMAN Senior Archer 7/7/25, 9:43 PM Monday, July 7, 2025 at 9:43 PM Demon event Luck level carry over. 1 B3RMAN Senior Archer 7/7/25, 9:43 PM Monday, July 7, 2025 at 9:43 PM Demon event Luck level carry over. 1 Demon event Luck level carry over. Demon event Luck level carry over. Sebiias Tryhard Cat MOP Range Master 7/7/25, 10:00 PM Monday, July 7, 2025 at 10:00 PM yeah Demon event Luck level carry over. Sebiias Tryhard Cat MOP Range Master 7/7/25, 10:00 PM Monday, July 7, 2025 at 10:00 PM yeah Demon event Luck level carry over. | for Help :D ARC2 3k for task but ⁠Fishing Event Guide (Angler's B… for etched Nunyaa Junior Archer 7/10/25, 9:01 PM Thursday, July 10, 2025 at 9:01 PM Thanks so not much point unless you see these coming up which is still low requirements | for Help :D ARC2 3k for task but ⁠Fishing Event Guide (Angler's B… for etched Nunyaa Junior Archer 7/10/25, 9:01 PM Thursday, July 10, 2025 at 9:01 PM Thanks so not much point unless you see these coming up which is still low requirements 3k for task but ⁠Fishing Event Guide (Angler's B… for etched Thanks so not much point unless you see these coming up which is still low requirements Thanks so not much point unless you see these coming up which is still low requirements EpicJapan | for Help :D ARC2 Chat Mod 7/10/25, 9:03 PM Thursday, July 10, 2025 at 9:03 PM ye Thanks so not much point unless you see these coming up which is still low requirements EpicJapan | for Help :D ARC2 Chat Mod 7/10/25, 9:03 PM Thursday, July 10, 2025 at 9:03 PM ye Thanks so not much point unless you see these coming up which is still low requirements silingmaanghang 7/12/25, 3:37 AM Saturday, July 12, 2025 at 3:37 AM can someone update this for the current event??? silingmaanghang 7/12/25, 3:37 AM Saturday, July 12, 2025 at 3:37 AM can someone update this for the current event??? can someone update this for the current event??? can someone update this for the current event??? Shadowfax88 Legendary Archer 7/12/25, 5:20 AM Saturday, July 12, 2025 at 5:20 AM It's already there... the current event is lucky treasure wheel October 4, 2025 Shadowfax88 Legendary Archer 10/4/25, 10:05 AM Saturday, October 4, 2025 at 10:05 AM I haven't gotten it yet and debating if I should just hang onto my starcores until they fix it softcorecinnamon Senior Archer 10/4/25, 10:35 AM Saturday, October 4, 2025 at 10:35 AM I think hare skin is working as intended. It makes sense as you get the healing. I think hare skin is working as intended. It makes sense as you get the healing. Shadowfax88 Legendary Archer 10/4/25, 11:33 AM Saturday, October 4, 2025 at 11:33 AM Hmmm, why would it draw our own aggro, though? Nothing else we summon works that way Hmmm, why would it draw our own aggro, though? Nothing else we summon works that way softcorecinnamon Senior Archer 10/4/25, 11:35 AM Saturday, October 4, 2025 at 11:35 AM It makes you kill it to heal. That's the only reason. You heal from killing it. It makes sense but I could be wrong. It makes you kill it to heal. That's the only reason. You heal from killing it. It makes sense but I could be wrong. Shadowfax88 Legendary Archer 10/4/25, 11:41 AM Saturday, October 4, 2025 at 11:41 AM Oh, I see. I didn't even think of it like to that. Still feels like too much of a downside, , but who knows. Nothing habby does makes sense anyway so maybe that is what they intended Oh, I see. I didn't even think of it like to that. Still feels like too much of a downside, , but who knows. Nothing habby does makes sense anyway so maybe that is what they intended softcorecinnamon Senior Archer 10/4/25, 11:44 AM Saturday, October 4, 2025 at 11:44 AM I've been wrong alot before so this could be another. It just makes sense to be with a strong upside there is also a negative to it. I've been wrong alot before so this could be another. It just makes sense to be with a strong upside there is also a negative to it. Shadowfax88 Legendary Archer 10/4/25, 11:49 AM Saturday, October 4, 2025 at 11:49 AM You could be right especially because of how much of a boost it would otherwise be to the griffin/oracle combo and people are already complaining about how strong that is Oh, I see. I didn't even think of it like to that. Still feels like too much of a downside, , but who knows. Nothing habby does makes sense anyway so maybe that is what they intended RB773 Mythic Archer 10/4/25, 9:32 PM Saturday, October 4, 2025 at 9:32 PM it's too much of a downside October 5, 2025 mob Novice Explorer 10/5/25, 6:37 AM Sunday, October 5, 2025 at 6:37 AM if im going to be able to get enough starcores from this event to unlock either one legendary hero skin or one legendary weapon skin which should i get? if im going to be able to get enough starcores from this event to unlock either one legendary hero skin or one legendary weapon skin which should i get? Sebiias Tryhard Cat MOP Range Master 10/5/25, 6:59 AM Sunday, October 5, 2025 at 6:59 AM neither, otta nian skin and duck helix are the bests (edited) Sunday, October 5, 2025 at 6:59 AM If you aren't full mythic gear yet, then its better to get keys nani Novice Explorer 10/5/25, 7:11 AM Sunday, October 5, 2025 at 7:11 AM Hmm any clue how the razor starcores for weapons work in the first place? Do you buy the rare and it requires more to upgrade eventually? Tryhard Cat MOP If you aren't full mythic gear yet, then its better to get keys mob Novice Explorer 10/5/25, 7:19 AM Sunday, October 5, 2025 at 7:19 AM im full mythic+3 (weapons+1) in oracle and mythic crossbow but no mythic other dragoon gear. Would probably get thors mjolnir skin or the oracle spear one. You really think i should pass and just get the lower tier skins? i dont have otta unlocked but helix is almost max Hmm any clue how the razor starcores for weapons work in the first place? Do you buy the rare and it requires more to upgrade eventually? mob Novice Explorer 10/5/25, 7:20 AM Sunday, October 5, 2025 at 7:20 AM assumed once you buy it you could just use it straight away? assumed once you buy it you could just use it straight away? nani Novice Explorer 10/5/25, 7:21 AM Sunday, October 5, 2025 at 7:21 AM Can I just save up and straight up buy the epic skin and skip the rare skin? I'm still new ish so I doubt I will get anymore starcores anytime",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "event, should I focus on L potion etched too? Or would L aoe, ele crit and meteor be enough? Otta's 2 ability is a main weapon crit rate/dmg multi not global just like gear is (edited) Kai'thulhu ARC2 Chat Mod 10/1/25, 5:28 AM Wednesday, October 1, 2025 at 5:28 AM I dont think its just mw. 'thulhu ARC2 I dont think its just mw. Shadowfax88 Legendary Archer 10/1/25, 5:29 AM Wednesday, October 1, 2025 at 5:29 AM It is. It was confirmed by shultin 1 I don't have it so I haven't personally tested it but I have tested gear and those are for sure main weapon only I have L aoe and L ele crit, currently starting to transition from full oracle to mixed dragoon. I was thinking L meteor would be my next target to focus on, but given I have otta skin and should unlock otta next event, should I focus on L potion etched too? Or would L aoe, ele crit and meteor be enough? Kai'thulhu ARC2 Chat Mod 10/1/25, 5:30 AM Wednesday, October 1, 2025 at 5:30 AM I prefer meteor over potions. potions is very rng heavy although might be nice for peak 'thulhu ARC2 I prefer meteor over potions. potions is very rng heavy although might be nice for peak Pampis44 Junior Archer 10/1/25, 5:32 AM Wednesday, October 1, 2025 at 5:32 AM I see. Is otta skin any good without potion etched? Or is it useless without it? Mostly for pvp Shadowfax88 Legendary Archer 10/1/25, 5:34 AM Wednesday, October 1, 2025 at 5:34 AM It's still very good without it. She was the best pvp reso/skin even before the potion etched was released 1 Legendary is fairly significant upgrade over epic for elemental crit. Also running lucky shadow is pretty helpful with it because it gives elementals a base crit rate of 10% (i believe but I could be mistaken). You'll most likely have a decently higher global crit damage than crit rate especially if you don't have pans flute Also, even though the crit rate/dmg multis on gear are written in such a way to indicate they are global sources, they are actually main weapon Willalt 🐬 Elite Archer 10/1/25, 5:34 AM Wednesday, October 1, 2025 at 5:34 AM oh I did not know lucky shadow gives elementals base crit I see. Is otta skin any good without potion etched? Or is it useless without it? Mostly for pvp Kai'thulhu ARC2 Chat Mod 10/1/25, 5:34 AM Wednesday, October 1, 2025 at 5:34 AM im planning on using as soon as I get 4 gems sacred hall but that's only cuz I have good enchantments for it. 2 Willalt 🐬 Elite Archer 10/1/25, 5:35 AM Wednesday, October 1, 2025 at 5:35 AM I just got 4 gem sacred hall myself but no otta nor otta skin 1 Kai'thulhu ARC2 Chat Mod 10/1/25, 5:38 AM Wednesday, October 1, 2025 at 5:38 AM let's trade 1 tyler7950 Junior Archer 10/1/25, 5:52 AM Wednesday, October 1, 2025 at 5:52 AM ITS ALMOST TIME",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "event chests day 1 just keep 75 and spend all extras October 2, 2025 Mahoney | P90015575 Elite Archer 10/2/25, 12:07 AM Thursday, October 2, 2025 at 12:07 AM It's not only the key amount, but also key replenishment rate October 3, 2025 TodoNuDeMeias Senior Archer 10/3/25, 5:42 AM Friday, October 3, 2025 at 5:42 AM How do we feel about the updates of the etcheds? Is leg 1 worth? How do we feel about the updates of the etcheds? Shadowfax88 Legendary Archer 10/3/25, 5:55 AM Friday, October 3, 2025 at 5:55 AM Mostly just useful in PvE. It's +3% dmg of the particular dmg source of the etched rune for each skill of that type taken. Zero benefit in gvg and peak because no skills are available. You'll see some dps increase in arena but it's pretty random in terms of skills. You'll probably only see 2-3 skills of a particular type (if that). But I don't have any etched at L1 so I haven't personally tested it in arena to know for sure (edited) Friday, October 3, 2025 at 5:56 AM 1 50k on top of the free lures ? 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 10/3/25, 6:33 AM Friday, October 3, 2025 at 6:33 AM I got mythic artifact and 4 blessings with 45k gems + free lures Is leg 1 worth? 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 10/3/25, 6:35 AM Friday, October 3, 2025 at 6:35 AM What Shadofax said. If you have all legendaries you need, you can build up your most important ones with free etcheds but I wouldn't spend on it 1 extremelyaverage Senior Archer 10/3/25, 7:55 AM Friday, October 3, 2025 at 7:55 AM I’ve been thinking about it and I think I’m still going to go for mythic artifacts in fishing for now. I really want sprite assist l2 but until I get otta it’s just not giving me much. That’s assuming otta affects that bonus. Can anyone confirm? I assume you could tell on elemental crit. October 5, 2025 gryfel Senior Archer 10/5/25, 5:48 AM Sunday, October 5, 2025 at 5:48 AM Is buying epic rod pack a good investement of $? Ale have some aurocite thinking I will use it on monthly cards but I'm not sure if thats the best option. I was looking at the excel sheet with spending values but this doesn't include packs in the events Is buying epic rod pack a good investement of $? Ale have some aurocite thinking I will use it on monthly cards but I'm not sure if thats the best option. I was looking at the excel sheet with spending values but this doesn't include packs in the events Sebiias Tryhard Cat MOP Range Master 10/5/25, 6:58 AM Sunday, October 5, 2025 at 6:58 AM yes, pretty much the best pack in the event 1 Willalt 🐬 Elite Archer 10/1/25, 4:55 AM Wednesday, October 1, 2025 at 4:55 AM so might as well aim for L potion etched to prepare for then Willalt 🐬 Elite Archer 10/1/25, 4:55 AM Wednesday, October 1, 2025 at 4:55 AM so might as well aim for L potion etched to prepare for then so might as well aim for L potion etched to prepare for then shackled I use AOE and PO anyway so those slots are filled shackled I use AOE and PO anyway so those slots are filled shackled I use AOE and PO anyway so those slots are filled 'thulhu ARC2 only place awe is useful is shackled. RB773 Mythic Archer 10/1/25, 4:56 AM Wednesday, October 1, 2025 at 4:56 AM I use it in PvP. 'thulhu ARC2 only place awe is useful is shackled. RB773 Mythic Archer 10/1/25, 4:56 AM Wednesday, October 1, 2025 at 4:56 AM I use it in PvP. only place awe is useful is shackled. I use it in PvP. Kai'thulhu ARC2 Chat Mod 10/1/25, 5:04 AM Wednesday, October 1, 2025 at 5:04 AM i run xbow so I go meteor + elemental crit (edited) Wednesday, October 1, 2025 at 5:04 AM Kai'thulhu ARC2 Chat Mod 10/1/25, 5:04 AM Wednesday, October 1, 2025 at 5:04 AM i run xbow so I go meteor + elemental crit (edited) Wednesday, October 1, 2025 at 5:04 AM i run xbow so I go meteor + elemental crit (edited) Wednesday, October 1, 2025 at 5:04 AM 'thulhu ARC2 i run xbow so I go meteor + elemental crit (edited) Willalt 🐬 Elite Archer 10/1/25, 5:11 AM Wednesday, October 1, 2025 at 5:11 AM how is that going for you? I'm planning on this as well 'thulhu ARC2 i run xbow so I go meteor + elemental crit (edited) Willalt 🐬 Elite Archer 10/1/25, 5:11 AM Wednesday, October 1, 2025 at 5:11 AM how is that going for you? I'm planning on this as well i run xbow so I go meteor + elemental crit (edited) how is that going for you? I'm planning on this as well currently have 2 blue copies of elecrit, just need 1 more currently have 2 blue copies of elecrit, just need 1 more May 20, 2025 ARC2 Spinning Flower (Other) Chapter 32, wave 30. • Defeated at 150k power • This boss always spins counterclockwise and shoots counterclockwise at the end of his spin. (Same direction as circles) • For now, not sure of a better way to avoid attacks other than hope he spins and lands farther away from you to; first, dodge the charge, then dodge his shots. After shooting, he pretty much preps his charge again. • Think the only solid hope is freezes, shields, and something auto attack like circles since he’s always close range from charging. EpicJapan | for Help :D ARC2 Chat Mod 5/20/25, 9:45 PM Tuesday, May 20, 2025 at 9:45 PM tysm added to the list EasyVictor ARC2 Senior Archer 5/20/25, 9:47 PM Tuesday, May 20, 2025 at 9:47 PM Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ ARC2 Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ EpicJapan | for Help :D ARC2 Chat Mod 5/20/25, 9:48 PM Tuesday, May 20, 2025 at 9:48 PM maybe not for now? I woudl appreciate all available info though tysm 1 May 21, 2025 EasyVictor ARC2 Senior Archer 5/21/25, 12:20 AM Wednesday, May 21, 2025 at 12:20 AM Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. , (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape but the orientation does not matter. -also after each movement, get one or two shots off, but never three, it’s too risky. • Using the triangle method is the best way to avoid his 3x charge. This will also keep him in close if you are using circle attack/runes. After movement, shoot shoot move. • Second attack is typically jump attack then immediate meteors. If you can get one shot off in between these attacks go for it, but not at the cost of eating a meteor. After the meteors fall, shoot shoot move. • Lastly, you have the flame shot that splits into 6. The triangle method is perfect to avoid this because it may be a charge. Avoid the flame, possibly shoot, move to avoid the flame spread, shoot again. Rinse and repeat ARC2 Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape EpicJapan | for Help :D ARC2 Chat Mod 5/21/25, 1:23 AM Wednesday, May 21, 2025 at 1:23 AM ty' May 22, 2025 EasyVictor ARC2 Senior Archer 5/22/25, 7:02 PM Thursday, May 22, 2025 at 7:02 PM Stone Golem • This boss has 3 different attacks. A rolling bowling boulder attack that eventually splits into 6. The big boulder will also track/follow. , (If this big boulder hits a wall, it will not split and will disappear) A triple rock split. , (Edit) Lastly, he also shoots 5 fast boulders at that are mostly guaranteed hits if you are close to him. , (If you freeze or paralyze him, he will never throw these) • This boss will always throw with his right arm. • My trick is to stand mostly in between him in the center and the wall. This is in the hopes when he tosses the boulder, it will cancel. If it’s the triple rock split you’re still good to go. , • The biggest point is to always rotate to dodge in a counterclockwise direction. This is to have to better chance of dodging the tosses. If you dodge clockwise, you run a much bigger risk of taking a bolder or rock throw. , (edited) Thursday, May 22, 2025 at 7:37 PM 1 1 ARC2 Stone Golem • This boss has 3 different attacks. A rolling bowling boulder attack that eventually splits into 6. The big boulder will also track/follow. (If this big boulder hits a wall, it will not split and will disappear) A triple rock split. (Edit) Lastly, he also shoots 5 fast boulders at that are mostly guaranteed hits if you are close to him. Sebiias Tryhard Cat MOP Range Master 5/22/25, 7:29 PM Thursday, May 22, 2025 at 7:29 PM this boss has 3 attacks, it also shoots 5 fast boulders at you that are guaranteed hit if you are close to him, but if you freeze or paralyze him, he will never throw those 1 Tryhard Cat MOP this boss has 3 attacks, it also shoots 5 fast boulders at you that are guaranteed hit if you are close to him, but if you freeze or paralyze him, he will never throw those EasyVictor ARC2 Senior Archer 5/22/25, 7:34 PM Thursday, May 22, 2025 at 7:34 PM Ok I did have freeze (ice attack and circles). Editing now. (edited) Thursday, May 22, 2025 at 7:35 PM Sebiias Tryhard Cat MOP Range Master 5/22/25, 7:34 PM Thursday, May 22, 2025 at 7:34 PM I told the same strat to a friend long ago and he freaked out when the boss did that to him \"He isn't supposed to hit me, what is that!!\" 1 EasyVictor ARC2 Senior Archer 5/22/25, 7:38 PM Thursday, May 22, 2025 at 7:38 PM Yeah I guess I’ve always had somewhat freeze something so never ran into that I’ll have to try that next time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "eventing me from gaining the 3rd star ⭐️ EasyVictor ARC2 Senior Archer 5/20/25, 9:47 PM Tuesday, May 20, 2025 at 9:47 PM Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ ARC2 Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ EpicJapan | for Help :D ARC2 Chat Mod 5/20/25, 9:48 PM Tuesday, May 20, 2025 at 9:48 PM maybe not for now? I woudl appreciate all available info though tysm 1 ARC2 Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ EpicJapan | for Help :D ARC2 Chat Mod 5/20/25, 9:48 PM Tuesday, May 20, 2025 at 9:48 PM maybe not for now? I woudl appreciate all available info though tysm 1 Any other boss you need I have access to? Ask the rest are fairly simple. This one is the only one preventing me from gaining the 3rd star ⭐️ maybe not for now? I woudl appreciate all available info though tysm EasyVictor ARC2 Senior Archer 5/21/25, 12:20 AM Wednesday, May 21, 2025 at 12:20 AM Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. , (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape but the orientation does not matter. -also after each movement, get one or two shots off, but never three, it’s too risky. • Using the triangle method is the best way to avoid his 3x charge. This will also keep him in close if you are using circle attack/runes. After movement, shoot shoot move. • Second attack is typically jump attack then immediate meteors. If you can get one shot off in between these attacks go for it, but not at the cost of eating a meteor. After the meteors fall, shoot shoot move. • Lastly, you have the flame shot that splits into 6. The triangle method is perfect to avoid this because it may be a charge. Avoid the flame, possibly shoot, move to avoid the flame spread, shoot again. Rinse and repeat EasyVictor ARC2 Senior Archer 5/21/25, 12:20 AM Wednesday, May 21, 2025 at 12:20 AM Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. , (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape but the orientation does not matter. -also after each movement, get one or two shots off, but never three, it’s too risky. • Using the triangle method is the best way to avoid his 3x charge. This will also keep him in close if you are using circle attack/runes. After movement, shoot shoot move. • Second attack is typically jump attack then immediate meteors. If you can get one shot off in between these attacks go for it, but not at the cost of eating a meteor. After the meteors fall, shoot shoot move. • Lastly, you have the flame shot that splits into 6. The triangle method is perfect to avoid this because it may be a charge. Avoid the flame, possibly shoot, move to avoid the flame spread, shoot again. Rinse and repeat Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. , (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape but the orientation does not matter. -also after each movement, get one or two shots off, but never three, it’s too risky. • Using the triangle method is the best way to avoid his 3x charge. This will also keep him in close if you are using circle attack/runes. After movement, shoot shoot move. • Second attack is typically jump attack then immediate meteors. If you can get one shot off in between these attacks go for it, but not at the cost of eating a meteor. After the meteors fall, shoot shoot move. • Lastly, you have the flame shot that splits into 6. The triangle method is perfect to avoid this because it may be a charge. Avoid the flame, possibly shoot, move to avoid the flame spread, shoot again. Rinse and repeat ARC2 Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape EpicJapan | for Help :D ARC2 Chat Mod 5/21/25, 1:23 AM Wednesday, May 21, 2025 at 1:23 AM ty' ARC2 Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape EpicJapan | for Help :D ARC2 Chat Mod 5/21/25, 1:23 AM Wednesday, May 21, 2025 at 1:23 AM ty' Flame Demon • This boss will have 3 different attacks: 3x charges. , Jump charge followed immediately by random falling meteors. , Flame Shoot attack that will split into 6 smaller flames that spread outward. (Typically this is the order of attacks, however, he can skip or repeat) • My method (like with most bosses) is to think of the triangle shape EasyVictor ARC2 Senior Archer 5/22/25, 7:02 PM Thursday, May 22, 2025 at 7:02 PM Stone Golem • This boss has 3 different attacks. A rolling bowling boulder attack that eventually splits into 6. The big boulder will also track/follow. , (If this big boulder hits a wall, it will not split and will disappear) A triple rock split. , (Edit) Lastly, he also shoots 5 fast boulders at that are mostly guaranteed hits if you are close to him. , (If you freeze or paralyze him, he will never throw these) • This boss will always throw with his right arm. • My trick is to stand mostly in between him in the center and the wall. This is in the hopes when he tosses the boulder, it will cancel. If it’s the triple rock split you’re still good to go. , • The biggest point is to always rotate to dodge in a counterclockwise direction. This is to have to better chance of dodging the tosses. If you dodge clockwise, you run a much bigger risk of taking a bolder or rock throw. , (edited) Thursday, May 22, 2025 at 7:37 PM 1 1 October 4, 2025 Fluky Senior Archer 10/4/25, 8:52 AM Saturday, October 4, 2025 at 8:52 AM Do griffin ring and helm have a min distance for bonus to activate? Do griffin ring and helm have a min distance for bonus to activate? Shadowfax88 Legendary Archer 10/4/25, 8:58 AM Saturday, October 4, 2025 at 8:58 AM Yes, same distance as RoA (7m) but griffin helm gets higher as you get closer. Ring is just on how many enemies are within that distance Fluky Senior Archer 10/4/25, 8:59 AM Saturday, October 4, 2025 at 8:59 AM So its 7m and closer alright thanks dragoon and oracle ring are not very impactful Petrichor PVZ Senior Archer 10/4/25, 8:59 AM Saturday, October 4, 2025 at 8:59 AM between the two what would be better? don't have any griffin unfortunately So its 7m and closer alright thanks Shadowfax88 Legendary Archer 10/4/25, 9:03 AM Saturday, October 4, 2025 at 9:03 AM Yes PVZ between the two what would be better? don't have any griffin unfortunately Shadowfax88 Legendary Archer 10/4/25, 9:04 AM Saturday, October 4, 2025 at 9:04 AM It depends if you have Thor or how good you are at stutter stepping It depends if you have Thor or how good you are at stutter stepping Petrichor PVZ Senior Archer 10/4/25, 9:04 AM Saturday, October 4, 2025 at 9:04 AM ah, no thor and I can't stutter step PVZ ah, no thor and I can't stutter step Shadowfax88 Legendary Archer 10/4/25, 9:37 AM Saturday, October 4, 2025 at 9:37 AM In that case it depends on which is a higher rarity in PvE because the extra attack is beneficial but you'd also benefit some from the atk speed boost of oracle ring In that case it depends on which is a higher rarity in PvE because the extra attack is beneficial but you'd also benefit some from the atk speed boost of oracle ring Petrichor PVZ Senior Archer 10/4/25, 9:38 AM Saturday, October 4, 2025 at 9:38 AM They both at mythic Shadowfax88 Legendary Archer 10/4/25, 9:38 AM Saturday, October 4, 2025 at 9:38 AM I've never really used dragoon ring so I don't know how useful it actually is but I can't imagine very much. I do personally prefer griffin ring Petrichor PVZ Senior Archer 10/4/25, 9:38 AM Saturday, October 4, 2025 at 9:38 AM Ahh fair PVZ between the two what would be better? don't have any griffin unfortunately RB773 Mythic Archer 10/4/25, 9:42 AM Saturday, October 4, 2025 at 9:42 AM It's very hard to test this, but I would say, if you stutter step, go for dragoon, if you don't, go for oracle.. babpls Novice Explorer 10/4/25, 12:00 PM Saturday, October 4, 2025 at 12:00 PM why are oracle boots recommended for pve? aren’t mythic dragoon boots good for the dodge? why are oracle boots recommended for pve? aren’t mythic dragoon boots good for the dodge? Shadowfax88 Legendary Archer 10/4/25, 12:02 PM Saturday, October 4, 2025 at 12:02 PM Because the idea is not to get hit at all and the extra crit dmg from the oracle boots is fairly useful (edited) Saturday, October 4, 2025 at 12:02 PM 1 But if you struggle dodging projectiles, the dragoon boots may be better Hybridreamer Senior Archer 10/4/25, 12:58 PM Saturday, October 4, 2025 at 12:58 PM If I'm starting to push for mixed set. Should I go for mythic oracle spear or xbow first before I have dragoon helm If I'm starting to push for mixed set. Should I go for mythic oracle spear or xbow first before I have dragoon helm WetTissue69 Senior Archer 10/4/25, 1:17 PM Saturday, October 4, 2025 at 1:17 PM Xbow 1 Hybridreamer Senior Archer 10/4/25, 1:19 PM Saturday, October 4, 2025 at 1:19 PM thanks If I'm starting to push for mixed set. Should I go for mythic oracle spear or xbow first before I have dragoon helm RB773 Mythic Archer 10/4/25, 7:58 PM Saturday, October 4, 2025 at 7:58 PM you don't need staff for anything it's one of the most useless gear in the game unless you have maxed leg wep skin Hybridreamer Senior Archer 10/4/25, 8:10 PM Saturday, October 4, 2025 at 8:10 PM Those are strong words lok it's one of the most useless gear in the game Hybridreamer Senior Archer 10/4/25, 8:22 PM Saturday, October 4, 2025 at 8:22 PM I prioritize PvE over pvp personally so surely oracle isn't that bad I prioritize PvE over pvp personally so surely oracle isn't that bad RB773 Mythic Archer 10/4/25, 9:15 PM Saturday, October 4, 2025 at 9:15 PM the staff is October 6, 2025 NEW Hybridreamer Senior Archer Yesterday at 10:30 AM Monday, October 6, 2025 at 10:30 AM what rune setup should we go for with xbow+ oracle Working on getting dragoon helm next but for now using destruction what rune setup should we go for with xbow+ oracle RB773 Mythic Archer Yesterday at 10:52 AM Monday, October 6, 2025 at 10:52 AM meteor split / elem crit / potion spring / sprite's awe meteor split / elem crit / potion spring / sprite's awe Hybridreamer Senior Archer Yesterday at 11:05 AM Monday, October 6, 2025 at 11:05 AM And then for the normal runes I assume. All the meteors, main weapon , and flamenox? And then for the normal runes I assume. All the meteors, main weapon , and flamenox? RB773 Mythic Archer Yesterday at 11:05 AM Monday, October 6, 2025 at 11:05 AM I only use sharp arrow in GvG and Peak, for the bounce. Hybridreamer Senior Archer Yesterday at 11:05 AM Monday, October 6, 2025 at 11:05 AM I don't have bounce yet sadly 1 RB773 Mythic Archer Yesterday at 11:06 AM Monday, October 6, 2025 at 11:06 AM and I use both frostshock runes Hybridreamer Senior Archer Yesterday at 11:06 AM Monday, October 6, 2025 at 11:06 AM My sharp has 15% weapon dmg RB773 Mythic Archer Yesterday at 11:06 AM Monday, October 6, 2025 at 11:06 AM ye, I don't really deal main wep damage.. Hybridreamer Senior Archer Yesterday at 11:07 AM Monday, October 6, 2025 at 11:07 AM Interesting thanks! 1 I should prob run frostshock now that I think about it since I use thor Unfortunate since my best enchants are on flamenox 1 Maybe this is a sign RB773 Mythic Archer Yesterday at 11:11 AM Monday, October 6, 2025 at 11:11 AM the unique is the best, but nice one Hybridreamer Senior Archer Yesterday at 11:13 AM Monday, October 6, 2025 at 11:13 AM I gotta get bounce first. Xbow feels rough without bounce right now At least in pve stuff RB773 Mythic Archer Yesterday at 11:21 AM Monday, October 6, 2025 at 11:21 AM ye, we need the bounce griffin ring is the best for most bosses pre-chaotic womtei Novice Explorer Yesterday at 11:40 AM Monday, October 6, 2025 at 11:40 AM I have oracle m+2 and both l3 griffin and dragoon ring. I've been rocking the oracle with the added stats. Should I switch to Griffin for pvp? Marv Senior Archer Yesterday at 11:47 AM Monday, October 6, 2025 at 11:47 AM yall think it’s still worth to go mixed? I have oracle m+2 and both l3 griffin and dragoon ring. I've been rocking the oracle with the added stats. Should I switch to Griffin for pvp? Shadowfax88 Legendary Archer Yesterday at 11:49 AM Monday, October 6, 2025 at 11:49 AM Not for arena or peak for sure. You'd lose out on way too much atk by dropping from M2 to L3 yall think it’s still worth to go mixed? Shadowfax88 Legendary Archer Yesterday at 11:50 AM Monday, October 6, 2025 at 11:50 AM You could but up to you. I did and feel like it was a huge benefit but only you can make that decision for you You could but up to you. I did and feel like it was a huge benefit but only you can make that decision for you Marv Senior Archer Yesterday at 11:50 AM Monday, October 6, 2025 at 11:50 AM just looking for a 2nd opinion to see if i’m too far gone You'Re Viewing Older Messages Jump To Present Fluky Senior Archer 10/4/25, 8:52 AM Saturday, October 4, 2025 at 8:52 AM Do griffin ring and helm have a min distance for bonus to activate? Fluky Senior Archer 10/4/25, 8:52 AM Saturday, October 4, 2025 at 8:52 AM Do griffin ring and helm have a min distance for bonus to activate? Do griffin ring and helm have a min distance for bonus to activate? Do griffin ring and helm have a min distance for bonus to activate? Shadowfax88 Legendary Archer 10/4/25, 8:58 AM Saturday, October 4, 2025 at 8:58 AM Yes, same distance as RoA (7m) but griffin helm gets higher as you get closer. Ring is just on how many enemies are within that distance Do griffin ring and helm have a min distance for bonus to activate? Shadowfax88 Legendary Archer 10/4/25, 8:58 AM Saturday, October 4, 2025 at 8:58 AM Yes, same distance as RoA (7m) but griffin helm gets higher as you get closer. Ring is just on how many enemies are within that distance Do griffin ring and helm have a min distance for bonus to activate? Yes, same distance as RoA (7m) but griffin helm gets higher as you get closer. Ring is just on how many enemies are within that distance Fluky Senior Archer 10/4/25, 8:59 AM Saturday, October 4, 2025 at 8:59 AM So its 7m and closer alright thanks Fluky Senior Archer 10/4/25, 8:59 AM Saturday, October 4, 2025 at 8:59 AM So its 7m and closer alright thanks So its 7m and closer alright thanks dragoon and oracle ring are not very impactful Petrichor PVZ Senior Archer 10/4/25, 8:59 AM Saturday, October 4, 2025 at 8:59 AM between the two what would be better? don't have any griffin unfortunately dragoon and oracle ring are not very impactful Petrichor PVZ Senior Archer 10/4/25, 8:59 AM Saturday, October 4, 2025 at 8:59 AM between the two what would be better? don't have any griffin unfortunately dragoon and oracle ring are not very impactful between the two what would be better? don't have any griffin unfortunately So its 7m and closer alright thanks Shadowfax88 Legendary Archer 10/4/25, 9:03 AM Saturday, October 4, 2025 at 9:03 AM Yes So its 7m and closer alright thanks Shadowfax88 Legendary Archer 10/4/25, 9:03 AM Saturday, October 4, 2025 at 9:03 AM Yes So its 7m and closer alright thanks PVZ between the two what would be better? don't have any griffin unfortunately Shadowfax88 Legendary Archer 10/4/25, 9:04 AM Saturday, October 4, 2025 at 9:04 AM It depends if you have Thor or how good you are at stutter stepping 23 Follow Add this post to your channel list and receive notifications about it. Jump To Top October 2, 2025 fylopian STFC Senior Archer 10/2/25, 6:51 PM Thursday, October 2, 2025 at 6:51 PM Yup I do that. Working to get third slot Will be a while yet Ty the Squirtle Squirt Elite Archer 10/2/25, 6:51 PM Thursday, October 2, 2025 at 6:51 PM Yupp, I grab a good portion of the rune shop every week Just to fill out all mine but that’s a preference thing The etched are good I think October 4, 2025 FIFTY Junior Archer 10/4/25, 7:00 AM Saturday, October 4, 2025 at 7:00 AM For PvP: Full Focus on otta 2 (already have 0 with Nian) + Guild Shop or buy demon blood & Demon Eye first ? For PvP: Full Focus on otta 2 (already have 0 with Nian) + Guild Shop or buy demon blood & Demon Eye first ? Ty the Squirtle Squirt Elite Archer 10/4/25, 8:12 AM Saturday, October 4, 2025 at 8:12 AM Otta 2 first the Squirtle Squirt Otta 2 first FIFTY Junior Archer 10/4/25, 8:19 AM Saturday, October 4, 2025 at 8:19 AM Thanks 1 nighty Archer Booster 10/4/25, 8:30 AM Saturday, October 4, 2025 at 8:30 AM What’s the best combination for PvP overall? What’s the best combination for PvP overall? Ty the Squirtle Squirt Elite Archer 10/4/25, 8:35 AM Saturday, October 4, 2025 at 8:35 AM For characters specifically, assuming you are reasonably budgeted, helix as the base with 2 otta and dk whatever star u can get as resonance. If u whale out insert whatever combo of all 3 legendary characters here Though if you are on a reasonable budget I would grab Thor before dk, he makes the rest of the game way more fun. And he’s still good for PvP, though not as good as dk nighty Archer Booster 10/4/25, 8:46 AM Saturday, October 4, 2025 at 8:46 AM I don’t really feel dk somehow I think Thor is stronger but that’s jus my feeling tho, What’s about Loki, I’m planning Loki,Thor with otta nian, my Loki is just at 2 star atm the Squirtle Squirt Im running circles in PvP since I’m oracle user Im running circles in PvP since I’m oracle user Shadowfax88 Legendary Archer 10/4/25, 8:56 AM Saturday, October 4, 2025 at 8:56 AM Circles aren't good for full oracle users. Either double sprite etched or if you have otta 2 with her skin at a high enough star than you could go potion spring and swords perhaps I don't use full oracle in pvp but those are two builds that I've seen work the best Ty the Squirtle Squirt Elite Archer 10/4/25, 9:05 AM Saturday, October 4, 2025 at 9:05 AM Double sprite is my personal goat as full oracle I don’t really feel dk somehow I think Thor is stronger but that’s jus my feeling tho, What’s about Loki, I’m planning Loki,Thor with otta nian, my Loki is just at 2 star atm softcorecinnamon Senior Archer 10/4/25, 10:31 AM Saturday, October 4, 2025 at 10:31 AM I believe loki skin is bugged but loki skin with griffin would probably be the best combo you could ever make. I believe loki skin is bugged but loki skin with griffin would probably be the best combo you could ever make. PartyOn Novice Explorer 10/4/25, 10:54 AM Saturday, October 4, 2025 at 10:54 AM It is they really need to fix the Loki skin, does nothing but on the description it would be great for a griffin pvp combo It is they really need to fix the Loki skin, does nothing but on the description it would be great for a griffin pvp combo softcorecinnamon Senior Archer 10/4/25, 10:59 AM Saturday, October 4, 2025 at 10:59 AM One could only hope they fix it. They haven't acknowledged me asking them if its bugged or what in the vip discord. 1 One could only hope they fix it. They haven't acknowledged me asking them if its bugged or what in the vip discord. PartyOn Novice Explorer 10/4/25, 11:39 AM Saturday, October 4, 2025 at 11:39 AM Definitely has to be bugged, I tested it and it literally does nothing (edited) Saturday, October 4, 2025 at 11:39 AM babpls Novice Explorer 10/4/25, 11:44 AM Saturday, October 4, 2025 at 11:44 AM what’s the best combo for pve? i’m thinking 6 nyanja with rolla and thor, not sure which skins to go for though TodoNuDeMeias Senior Archer 10/4/25, 1:29 PM Saturday, October 4, 2025 at 1:29 PM Rolla ice diva is a great skin at level 5 , dont know if you have that kind of budget tho might even be good for PVP October 6, 2025 NEW Ty the Squirtle Squirt Elite Archer Yesterday at 4:59 PM Monday, October 6, 2025 at 4:59 PM Any new Thor skin gameplay out there? the Squirtle Squirt Any new Thor skin gameplay out there? RB773 Mythic Archer Yesterday at 10:24 PM Monday, October 6, 2025 at 10:24 PM for 0 Thor, the new skin is surely better, right? for 5+ it's probably the old one? for 0 Thor, the new skin is surely better, right? Ty the Squirtle Squirt Elite Archer Yesterday at 11:13 PM Monday, October 6, 2025 at 11:13 PM I genuinely have no idea, I’d love too but haven’t seen the new skin anywhere I’m not even fully sure what it does for 0 Thor, the new skin is surely better, right? Sebiias Tryhard Cat MOP Range Master Yesterday at 11:18 PM Monday, October 6, 2025 at 11:18 PM both are awfully bad but old skin is better in regards of utility, summons hammers quicker October 7, 2025 Tryhard Cat MOP both are awfully bad but old skin is better in regards of utility, summons hammers quicker RB773 Mythic Archer 1:13 AM Tuesday, October 7, 2025 at 1:13 AM thx fylopian STFC Senior Archer 10/2/25, 6:51 PM Thursday, October 2, 2025 at 6:51 PM Yup I do that. Working to get third slot fylopian STFC Senior Archer 10/2/25, 6:51 PM Thursday, October 2, 2025 at 6:51 PM Yup I do that. Working to get third slot Yup I do that. Working to get third slot Will be a while yet Will be a while yet Will be a while yet Ty the Squirtle Squirt Elite Archer 10/2/25, 6:51 PM Thursday, October 2, 2025 at 6:51 PM Yupp, I grab a good portion of the rune shop every week Ty the Squirtle Squirt Elite Archer 10/2/25, 6:51 PM Thursday, October 2, 2025 at 6:51 PM Yupp, I grab a good portion of the rune shop every week Yupp, I grab a good portion of the rune shop every week Just to fill out all mine but that’s a preference thing Just to fill out all mine but that’s a preference thing Just to fill out all mine but that’s a preference thing The etched are good I think The etched are good I think The etched are good I think FIFTY Junior Archer 10/4/25, 7:00 AM Saturday, October 4, 2025 at 7:00 AM For PvP: Full Focus on otta 2 (already have 0 with Nian) + Guild Shop or buy demon blood & Demon Eye first ? FIFTY Junior Archer 10/4/25, 7:00 AM Saturday, October 4, 2025 at 7:00 AM For PvP: Full Focus on otta 2 (already have 0 with Nian) + Guild Shop or buy demon blood & Demon Eye first ? For PvP: Full Focus on otta 2 (already have 0 with Nian) + Guild Shop or buy demon blood & Demon Eye first ? For PvP: Full Focus on otta 2 (already have 0 with Nian) + Guild Shop or buy demon blood & Demon Eye first ? Ty the Squirtle Squirt Elite Archer 10/4/25, 8:12 AM Saturday, October 4, 2025 at 8:12 AM Otta 2 first 13 3 Follow Add this post to your channel list and receive notifications about it. Jump To Top September 29, 2025 correct ERocks Elite Archer 9/29/25, 9:28 AM Monday, September 29, 2025 at 9:28 AM thanks! that's very helpful info extremelyaverage Senior Archer 9/29/25, 9:28 AM Monday, September 29, 2025 at 9:28 AM and i guess atreus, although its diminished bc it applies atreus before artifacts September 30, 2025 5 Cyppie Junior Archer 9/30/25, 6:49 AM Tuesday, September 30, 2025 at 6:49 AM Hi, and only one swapping orb per week ? Hi, and only one swapping orb per week ? KaRu Elite Archer 9/30/25, 6:50 AM Tuesday, September 30, 2025 at 6:50 AM 2 Cyppie Junior Archer 9/30/25, 6:51 AM Tuesday, September 30, 2025 at 6:51 AM Damn that’s really good, thanks October 3, 2025 extremelyaverage Senior Archer 10/3/25, 7:23 AM Friday, October 3, 2025 at 7:23 AM I have a sprite griffin build but I do have star of time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "event (edited) Monday, July 14, 2025 at 5:39 PM July 16, 2025 Kay Novice Explorer 7/16/25, 10:27 AM Wednesday, July 16, 2025 at 10:27 AM i have a few questions is if anyone can help answer is the damage formula computing overall dmg or main weapon damage? does the formula vary across the different damage categories? How would +30% main weapon dmg be computed? – boost on base ATK stats or base weapon ATK stats or ? +30% on the end dmg figure doesn’t make sense to me as that includes crit and other additives (edited) Wednesday, July 16, 2025 at 10:28 AM is the damage formula computing overall dmg or main weapon damage? does the formula vary across the different damage categories? How would +30% main weapon dmg be computed? – boost on base ATK stats or base weapon ATK stats or ? +30% on the end dmg figure doesn’t make sense to me as that includes crit and other additives fierywind 7/16/25, 9:42 PM Wednesday, July 16, 2025 at 9:42 PM it's written as a main weapon damage formula, but the same formula (or at least variations of it) is used to compute all damage - for the 30% main weapon damage, it would go in category D 1 which means it will be additive with front arrow and any other main weapon damage modifiers 1 July 17, 2025 klumbzy [-301] Archer Booster 7/17/25, 8:43 AM Thursday, July 17, 2025 at 8:43 AM But luck does indirectly increase chances to get higher rarity skills if you have rabbit foot rune equipped [-301] But luck does indirectly increase chances to get higher rarity skills if you have rabbit foot rune equipped Sebiias Tryhard Cat MOP Range Master 7/17/25, 8:54 AM Thursday, July 17, 2025 at 8:54 AM Rabbit's foot acts the same way with or without luck, rabbit's foot increases chances for blue skills in 20% by decreasing chances of green skills in 20%, luck doesn't do anything Tryhard Cat MOP Rabbit's foot acts the same way with or without luck, rabbit's foot increases chances for blue skills in 20% by decreasing chances of green skills in 20%, luck doesn't do anything klumbzy [-301] Archer Booster 7/17/25, 9:20 AM Thursday, July 17, 2025 at 9:20 AM Huh. Good to know. Myrda Junior Archer 7/17/25, 10:01 AM Thursday, July 17, 2025 at 10:01 AM Does anyone know the increase in atk speed/ crit rate that frenzy potion gives Does anyone know the increase in atk speed/ crit rate that frenzy potion gives Poosti Wiki Contributor 7/17/25, 10:44 AM Thursday, July 17, 2025 at 10:44 AM !skills Poosti !skills Sapphire Bots VERIFIED APP APP 7/17/25, 10:44 AM Thursday, July 17, 2025 at 10:44 AM ⁠unknown Poosti Wiki Contributor 7/17/25, 10:44 AM Thursday, July 17, 2025 at 10:44 AM ^ September 29, 2025 Reein Novice Explorer 9/29/25, 7:04 PM Monday, September 29, 2025 at 7:04 PM Any1 knows which is better? Main weapon dmg +30% (mythic) or main weapon crit rate +15% (legendary) on full mythic oracle set RB773 Mythic Archer 9/29/25, 10:29 PM Monday, September 29, 2025 at 10:29 PM you can test it by doing a boss practice run without picking any skills it depends on how much crit you have already October 3, 2025 fierywind THIS IS A WORK IN PROGRESS If you spot any errors, pm me. This is the result of about a month of testing from myself, , and -user . The focus was on damage numbers and skills, but work is being done on runes, attack speed, etc. Eventually the goal is to be able to create a dps calculator where you select a series of toggles repsenting your runes, gear, artifacts, skills etc and you'll see how much of a dps increase a given skill choice is. If anyone thinks of good questions to add to the FAQ, lmk. lilian122 Senior Archer 10/3/25, 5:53 AM Friday, October 3, 2025 at 5:53 AM does it still updating? does it still updating? renox Legendary Archer 10/3/25, 6:03 AM Friday, October 3, 2025 at 6:03 AM not really there's only gonna be update to devil skill pool, to reflect the [not so recent anymore] change in the game, but that's about it Zizmir Junior Archer 6/1/25, 4:52 AM Sunday, June 1, 2025 at 4:52 AM Ik was just joking about his pfp bias xd 1 Zizmir Junior Archer 6/1/25, 4:52 AM Sunday, June 1, 2025 at 4:52 AM Ik was just joking about his pfp bias xd 1 Ik was just joking about his pfp bias xd Jemdhar 6/1/25, 4:53 AM Sunday, June 1, 2025 at 4:53 AM also tracking slows down youre projrctiles, which makes smaller erings (with swift arrow) hit more often cuz they have more \"time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.9999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "event that gives tidal starcores? i swear the first Thor event there was also starcores in that? Or am i misremembering? STFC Is vibrant voyage the only event that gives tidal starcores? i swear the first Thor event there was also starcores in that? Or am i misremembering? epex ⲦⲞⅪⅭ Senior Archer 9/25/25, 7:01 AM Lucky wheel event also gives starcores ⲦⲞⅪⅭ Lucky wheel event also gives starcores fylopian STFC Senior Archer 9/25/25, 7:04 AM i had a much easier time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "event if i recall. or maybe i just got lucky, dunno Pause Senior Archer 9/25/25, 7:29 AM Starcores from beach/lucky wheel are much cheaper than vibrant voyage Next month there's a new event, Moonshade Myth. Not sure if it'll have starcores Next month there's a new event, Moonshade Myth. Not sure if it'll have starcores Shadowfax88 Legendary Archer 9/25/25, 7:47 AM Has next month's calendar been released yet? Has next month's calendar been released yet? epex ⲦⲞⅪⅭ Senior Archer 9/25/25, 8:58 AM Yes in vip ⲦⲞⅪⅭ Yes in vip murvy Legendary Archer 9/25/25, 10:00 AM Can you share? ⲦⲞⅪⅭ Yes in vip Ty the Squirtle Squirt Elite Archer 9/25/25, 10:09 AM Well that is ridiculously stupid Not even dropping the calendar for players anymore is a joke. No wonder everyone’s server is dead epex ⲦⲞⅪⅭ Senior Archer 9/25/25, 10:18 AM Forwarded 2 the Squirtle Squirt Not even dropping the calendar for players anymore is a joke. No wonder everyone’s server is dead epex ⲦⲞⅪⅭ Senior Archer 9/25/25, 10:20 AM Maybe they just post it a few days later here If not thats extremly dumb since everyone will know anyway ⲦⲞⅪⅭ Maybe they just post it a few days later here Ty the Squirtle Squirt Elite Archer 9/25/25, 10:23 AM When did you get it there? People have been requesting for months to have it a week before the new month here. To see they have it done but just screw that off is annoying as hell. Another easy way they could’ve shown good faith with the community for free just on fylopian STFC Senior Archer 9/25/25, 10:52 AM would there be ideal runes to pair with the nian otta skin? I have the potion etched rune. Like giant meteor? October 4, 2025 Fandral - 2M ARC2 Legendary Archer Yesterday at 12:02 AM Are epic skins still better than leg ? Dr. Latias | -1116 Rank 1 Mythic Archer Yesterday at 3:41 AM Yes October 5, 2025 randomperson08363 Junior Archer 6:16 AM I see that nobody posted anything on the epic oracle skin yet. It looks like a decent boost for pvp Ip feet Archer Booster 7:11 AM its somewhat effective against griffins feet its somewhat effective against griffins randomperson08363 Junior Archer 7:44 AM Because they lag a bit? The reduction in attack speed looks good vs all on paper, since you basically negate a helix power up Ip feet Archer Booster 7:57 AM also movement they’re slowed down and take more time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "event? any advice appreciated Pampis44 Junior Archer 10/1/25, 9:27 AM I am in a similar situation as you. Fishing is definitely #1 event for me to spend my gems on. Other than that I mostly buy keys and a little bit of enchantium. Though recently I spent about 20k gems in the voyage/bingo event to get enough tickets for 6 cores. extremelyaverage Senior Archer 10/1/25, 10:30 AM blowing all my gems on fishing as long as I'm out of fodder for S gear upgrades. If I have fodder, I'll get mythstones with the excess gems. greenleaf10 Junior Archer 10/1/25, 2:03 PM So I have like 100 keys because I save them for events, should I just be opening more of them for progression? So I have like 100 keys because I save them for events, should I just be opening more of them for progression? Ty the Squirtle Squirt Elite Archer 10/1/25, 2:04 PM 75 is the max you would ever need at one time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "events someone from sniping you and dropping you in the rankings after you have improved your rankings. And since the arena becomes unplayable 10 minutes before the daily reset, it is recommended to start playing 20-30 minutes before the reset. You could save your tickets and use them all at once on the last day, but I don't know if I would recommend that since you would be wasting 5 tickets each day. Does tickets stack? , , Yes. If you have 0-5 tickets when daily reset, it will reset to 5 tickets. If you have 6 or more, the number won't change. Every day, you can gain 3 more by doing daily tasks, 5 more by buying with gems, 50 more by buying with guild coins. Regarding other modes, ⁠unknown Is there a way to skip the battle? , , The first option is to buy a monthly card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena, Dragoon set is recommended. However, many people concentrate on Oracle, so I have created a thread to discuss the rune build for Oracle users. ⁠[Check pinned msg] Arena Build… (edited) 6 Follow EpicJapan | for Help :D ARC2 Chat Mod 4/13/25, 9:30 PM What is the best strategy when I'm stuck in my current group? , , Deliberately demote one level and achieve a higher ranking in that group. Specifically, check the ranking rewards",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "events someone from sniping you and dropping you in the rankings after you have improved your rankings. And since the arena becomes unplayable 10 minutes before the daily reset, it is recommended to start playing 20-30 minutes before the reset. You could save your tickets and use them all at once on the last day, but I don't know if I would recommend that since you would be wasting 5 tickets each day. BonnyBoy ARC2 Junior Archer 8/13/25, 5:45 PM Is this still valid? Dragoon set is recommended for PvP? Most recommend Griffin I thought. But then some guides say to mix and match some pieces no matter what gear set. ARC2 Is this still valid? Dragoon set is recommended for PvP? Most recommend Griffin I thought. But then some guides say to mix and match some pieces no matter what gear set. Shadowfax88 Legendary Archer 8/13/25, 6:47 PM Pre-chaotic dragoon is best for pvp. Chaotic griffin is the best set but a mixed set is even better particularly chaotic oracle chest/chaotic griffin amulet combo Oracle is generally the worst pvp set but if you are an oracle user, adding a couple of dragoon pieces can help a lot (edited) Pre-chaotic dragoon is best for pvp. Chaotic griffin is the best set but a mixed set is even better particularly chaotic oracle chest/chaotic griffin amulet combo BonnyBoy ARC2 Junior Archer 8/13/25, 7:01 PM Ok yeah for FtP I’ve got gold 3 Oracle and just a few echo. But then guess it’s a dragoon set then for PvP until chaotic. I’ll focus dragoon with bow, but is it the full set or a mixed set? ARC2 Ok yeah for FtP I’ve got gold 3 Oracle and just a few echo. But then guess it’s a dragoon set then for PvP until chaotic. I’ll focus dragoon with bow, but is it the full set or a mixed set? Shadowfax88 Legendary Archer 8/13/25, 7:03 PM It depends on what you want. Full set is better for pvp but the most important dragoon pieces are xbow, boots and helm. If you wanna mix in some pve chapters and tower gameplay having the oracle chest and amulet helps. The chest could even be echo because hp will eventually not matter in chapters BonnyBoy ARC2 Junior Archer 8/13/25, 7:04 PM Ok full set, focus boots and helm ArcAngel ASHW Senior Archer 8/13/25, 7:05 PM Has anyone figured out if ticketsaving weekly is better or worse than saving for a high rank on last day? August 16, 2025 gktrkler Novice Explorer 8/16/25, 12:41 AM Hey, wasn't the griffin set for pvp? I see everyone suggest dragon, can anyone tell why. I want to focus on pvp so any advice on gear and runes are appreciated. Would like if it got an explanation as well HeneralDiddoy ARC2 Novice Explorer 8/16/25, 10:13 AM Which hero should I star up first? Dracoola or Rolla. I have 6 star helix September 5, 2025 ARC2 Ok full set, focus boots and helm 𝓗𝔢𝔰𝔥𝒚 𝔅🦀𝔦𝔦 Elite Archer 9/5/25, 5:10 PM Griffin amulet is also good if you wanna play close Hey, wasn't the griffin set for pvp? I see everyone suggest dragon, can anyone tell why. I want to focus on pvp so any advice on gear and runes are appreciated. Would like if it got an explanation as well 𝓗𝔢𝔰𝔥𝒚 𝔅🦀𝔦𝔦 Elite Archer 9/5/25, 5:11 PM Griffin set is the best at chaotic but before that dragoon is better September 8, 2025 Kriss Pill/BurnedSalad 9/8/25, 10:36 PM So i'm thinking about the following strat : Have my oracle amulet at legendary 3 during the day while I still have pve content to do and after i'm done with all the dailies I use the quality down feature and put the materials into upgrading my non-S-tier griffin amulet to use in arena, and cycle those two every day until I have enough gear to keep them both at lvl 3 (or go up a gear tier on the S rank at some point) Would this be a valid strat? Have I found a loophole of sorts? September 12, 2025 𝓗𝔢𝔰𝔥𝒚 𝔅🦀𝔦𝔦 Elite Archer 9/12/25, 4:08 PM Why are you using the claws just use the xbow September 23, 2025 Stu Novice Explorer 9/23/25, 12:54 PM I regularly lose to people 100k+ power lower than me, what am I doing wrong? Oh I can't post my screenshot I've put them in media EpicJapan | for Help :D ARC2 Chat Mod 4/13/25, 9:22 PM If you have other arena questions, feel free to ask here , What time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "events someone from sniping you and dropping you in the rankings after you have improved your rankings. And since the arena becomes unplayable 10 minutes before the daily reset, it is recommended to start playing 20-30 minutes before the reset. You could save your tickets and use them all at once on the last day, but I don't know if I would recommend that since you would be wasting 5 tickets each day. Does tickets stack? , , Yes. If you have 0-5 tickets when daily reset, it will reset to 5 tickets. If you have 6 or more, the number won't change. Every day, you can gain 3 more by doing daily tasks, 5 more by buying with gems, 50 more by buying with guild coins. Regarding other modes, ⁠unknown Is there a way to skip the battle? , , The first option is to buy a monthly card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena, Dragoon set is recommended. However, many people concentrate on Oracle, so I have created a thread to discuss the rune build for Oracle users. ⁠[Check pinned msg] Arena Build… (edited) EpicJapan | for Help :D ARC2 Chat Mod 4/13/25, 9:22 PM If you have other arena questions, feel free to ask here , What time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "events someone from sniping you and dropping you in the rankings after you have improved your rankings. And since the arena becomes unplayable 10 minutes before the daily reset, it is recommended to start playing 20-30 minutes before the reset. You could save your tickets and use them all at once on the last day, but I don't know if I would recommend that since you would be wasting 5 tickets each day. Does tickets stack? , , Yes. If you have 0-5 tickets when daily reset, it will reset to 5 tickets. If you have 6 or more, the number won't change. Every day, you can gain 3 more by doing daily tasks, 5 more by buying with gems, 50 more by buying with guild coins. Regarding other modes, ⁠unknown Is there a way to skip the battle? , , The first option is to buy a monthly card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena, Dragoon set is recommended. However, many people concentrate on Oracle, so I have created a thread to discuss the rune build for Oracle users. ⁠[Check pinned msg] Arena Build… (edited) If you have other arena questions, feel free to ask here , What time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "events someone from sniping you and dropping you in the rankings after you have improved your rankings. And since the arena becomes unplayable 10 minutes before the daily reset, it is recommended to start playing 20-30 minutes before the reset. You could save your tickets and use them all at once on the last day, but I don't know if I would recommend that since you would be wasting 5 tickets each day. Does tickets stack? , , Yes. If you have 0-5 tickets when daily reset, it will reset to 5 tickets. If you have 6 or more, the number won't change. Every day, you can gain 3 more by doing daily tasks, 5 more by buying with gems, 50 more by buying with guild coins. Regarding other modes, ⁠unknown Is there a way to skip the battle? , , The first option is to buy a monthly card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena, Dragoon set is recommended. However, many people concentrate on Oracle, so I have created a thread to discuss the rune build for Oracle users. ⁠[Check pinned msg] Arena Build… (edited) EpicJapan | for Help :D ARC2 Chat Mod 4/13/25, 9:30 PM What is the best strategy when I'm stuck in my current group? , , Deliberately demote one level and achieve a higher ranking in that group. Specifically, check the ranking rewards",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "events now) and all messages deleted so you go straight to numero uno 1 We can discuss in ⁠🏹・archero-2 or whatnot 'thulhu ARC2 ported over success rate tool to an ok UI. 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 9/12/25, 6:49 AM Oh, the dice companion? Sick, thank you! 'thulhu ARC2 ported over success rate tool to an ok UI. 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 9/12/25, 6:49 AM Oh, the dice companion? Sick, thank you! ported over success rate tool to an ok UI. Oh, the dice companion? Sick, thank you! Kai'thulhu ARC2 Chat Mod 9/12/25, 6:52 AM yea ideally I move all interactive parts out of existing guide out and retire that one. someone else can own the FAQs and other misc things around the base strategy. Kai'thulhu ARC2 Chat Mod 9/12/25, 6:52 AM yea ideally I move all interactive parts out of existing guide out and retire that one. someone else can own the FAQs and other misc things around the base strategy. yea ideally I move all interactive parts out of existing guide out and retire that one. someone else can own the FAQs and other misc things around the base strategy. 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 9/12/25, 6:59 AM Yeah, it's very nice this way :)) Are you gonna add the percentile calculator to it too? That's the one I and others too, I think, use the most. 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 9/12/25, 6:59 AM Yeah, it's very nice this way :)) Are you gonna add the percentile calculator to it too? That's the one I and others too, I think, use the most. Yeah, it's very nice this way :)) Are you gonna add the percentile calculator to it too? That's the one I and others too, I think, use the most. @🩵Josiias F2P Cat MOP PONY Yeah, it's very nice this way :)) Are you gonna add the percentile calculator to it too? That's the one I and others too, I think, use the most. Kai'thulhu ARC2 Chat Mod 9/12/25, 7:17 AM I think to avoid all this starting dice confusion im planning on just letting people track number of dice they get from board. ill have to figure out what i want to do but something like: Multiplier: (1) (2) (3) (5) (10) <-- toggle buttons Dice: (1) (2) <-- select buttons Total Rolls: [number input field] ----- Total Dice from board: some number Net Dice Used: some number Points per Dice Used: some number Percentile: some % (edited) @🩵Josiias F2P Cat MOP PONY Yeah, it's very nice this way :)) Are you gonna add the percentile calculator to it too? That's the one I and others too, I think, use the most. Kai'thulhu ARC2 Chat Mod 9/12/25, 7:17 AM I think to avoid all this starting dice confusion im planning on just letting people track number of dice they get from board. ill have to figure out what i want to do but something like: Multiplier: (1) (2) (3) (5) (10) <-- toggle buttons Dice: (1) (2) <-- select buttons Total Rolls: [number input field] ----- Total Dice from board: some number Net Dice Used: some number Points per Dice Used: some number Percentile: some % (edited) Yeah, it's very nice this way :)) Are you gonna add the percentile calculator to it too? That's the one I and others too, I think, use the most. I think to avoid all this starting dice confusion im planning on just letting people track number of dice they get from board. ill have to figure out what i want to do but something like: Multiplier: (1) (2) (3) (5) (10) <-- toggle buttons Dice: (1) (2) <-- select buttons Total Rolls: [number input field] ----- Total Dice from board: some number Net Dice Used: some number Points per Dice Used: some number Percentile: some % (edited) 'thulhu ARC2 I think to avoid all this starting dice confusion im planning on just letting people track number of dice they get from board. ill have to figure out what i want to do but something like: 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 9/12/25, 7:19 AM Oh, alright. I like starting dice because I don't have to keep track of anything but I get it confuses some people. 'thulhu ARC2 I think to avoid all this starting dice confusion im planning on just letting people track number of dice they get from board. ill have to figure out what i want to do but something like: 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 9/12/25, 7:19 AM Oh, alright. I like starting dice because I don't have to keep track of anything but I get it confuses some people. I think to avoid all this starting dice confusion im planning on just letting people track number of dice they get from board. ill have to figure out what i want to do but something like: Oh, alright. I like starting dice because I don't have to keep track of anything but I get it confuses some people. 'thulhu ARC2 ported over success rate tool to an ok UI. AbdayMinjay Senior Archer 9/12/25, 8:51 AM can't put tile 0 i meant (edited) [Data collection] S gear - Key ratio Game Mechanics September 2, 2025 Poosti Wiki Contributor 9/2/25, 10:35 AM Data collection for S gear to key ratio. Sepetate forms for chroma and mythstone chests below. 5 2 Follow Poosti Wiki Contributor 9/2/25, 10:36 AM Chromatic: Mythstone: Google Docs Key - S gear ratio (Chromatic) Collecting data for Key to S gear ratio. Please check your data carefully and do it the right way (How many keys used - How many S gears gained). Google Docs Key - S gear ratio (Mythstone) Collecting data for Key to S gear ratio. Please check your data carefully and do it the right way (How many keys used - How many S gears gained). 5 September 3, 2025 Poosti Wiki Contributor 9/3/25, 1:08 PM You can only send in 1 answer, but its possible to update your answer (edited) 4 2 gryfel Senior Archer 9/3/25, 3:19 PM What do you mean by hitting pity? oにおん Senior Archer 9/3/25, 7:44 PM It is necessary to consider that data is statistically unreliable unless it is consecutive data from the same user. におん It is necessary to consider that data is statistically unreliable unless it is consecutive data from the same user. Pontus Chat Mod 9/3/25, 10:39 PM It’s not unreliable just because of different users. It’s still random data from the global population of random events Pontus It’s not unreliable just because of different users. It’s still random data from the global population of random events oにおん Senior Archer 9/3/25, 10:51 PM Since it’s already been suggested that the probability changes on how many opens have already been made, we need to take that into account. When collecting data from multiple users, we need information on how many pulls remained until pity at the time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "event? any advice appreciated Pampis44 Junior Archer 10/1/25, 9:27 AM Wednesday, October 1, 2025 at 9:27 AM I am in a similar situation as you. Fishing is definitely #1 event for me to spend my gems on. Other than that I mostly buy keys and a little bit of enchantium. Though recently I spent about 20k gems in the voyage/bingo event to get enough tickets for 6 cores. extremelyaverage Senior Archer 10/1/25, 10:30 AM Wednesday, October 1, 2025 at 10:30 AM blowing all my gems on fishing as long as I'm out of fodder for S gear upgrades. If I have fodder, I'll get mythstones with the excess gems. greenleaf10 Junior Archer 10/1/25, 2:03 PM Wednesday, October 1, 2025 at 2:03 PM So I have like 100 keys because I save them for events, should I just be opening more of them for progression? So I have like 100 keys because I save them for events, should I just be opening more of them for progression? Ty the Squirtle Squirt Elite Archer 10/1/25, 2:04 PM Wednesday, October 1, 2025 at 2:04 PM 75 is the max you would ever need at one time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "events someone from sniping you and dropping you in the rankings after you have improved your rankings. And since the arena becomes unplayable 10 minutes before the daily reset, it is recommended to start playing 20-30 minutes before the reset. You could save your tickets and use them all at once on the last day, but I don't know if I would recommend that since you would be wasting 5 tickets each day. Does tickets stack? , , Yes. If you have 0-5 tickets when daily reset, it will reset to 5 tickets. If you have 6 or more, the number won't change. Every day, you can gain 3 more by doing daily tasks, 5 more by buying with gems, 50 more by buying with guild coins. Regarding other modes, ⁠unknown Is there a way to skip the battle? , , The first option is to buy a monthly card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena, Dragoon set is recommended. However, many people concentrate on Oracle, so I have created a thread to discuss the rune build for Oracle users. ⁠[Check pinned msg] Arena Build… (edited) Sunday, June 1, 2025 at 9:26 AM 6 Follow Add this post to your channel list and receive notifications about it. EpicJapan | for Help :D ARC2 Chat Mod 4/13/25, 9:30 PM Sunday, April 13, 2025 at 9:30 PM What is the best strategy when I'm stuck in my current group? , , Deliberately demote one level and achieve a higher ranking in that group. Specifically, check the ranking rewards",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "events someone from sniping you and dropping you in the rankings after you have improved your rankings. And since the arena becomes unplayable 10 minutes before the daily reset, it is recommended to start playing 20-30 minutes before the reset. You could save your tickets and use them all at once on the last day, but I don't know if I would recommend that since you would be wasting 5 tickets each day. BonnyBoy ARC2 Junior Archer 8/13/25, 5:45 PM Wednesday, August 13, 2025 at 5:45 PM Is this still valid? Dragoon set is recommended for PvP? Most recommend Griffin I thought. But then some guides say to mix and match some pieces no matter what gear set. ARC2 Is this still valid? Dragoon set is recommended for PvP? Most recommend Griffin I thought. But then some guides say to mix and match some pieces no matter what gear set. Shadowfax88 Legendary Archer 8/13/25, 6:47 PM Wednesday, August 13, 2025 at 6:47 PM Pre-chaotic dragoon is best for pvp. Chaotic griffin is the best set but a mixed set is even better particularly chaotic oracle chest/chaotic griffin amulet combo Oracle is generally the worst pvp set but if you are an oracle user, adding a couple of dragoon pieces can help a lot (edited) Wednesday, August 13, 2025 at 6:48 PM Pre-chaotic dragoon is best for pvp. Chaotic griffin is the best set but a mixed set is even better particularly chaotic oracle chest/chaotic griffin amulet combo BonnyBoy ARC2 Junior Archer 8/13/25, 7:01 PM Wednesday, August 13, 2025 at 7:01 PM Ok yeah for FtP I’ve got gold 3 Oracle and just a few echo. But then guess it’s a dragoon set then for PvP until chaotic. I’ll focus dragoon with bow, but is it the full set or a mixed set? ARC2 Ok yeah for FtP I’ve got gold 3 Oracle and just a few echo. But then guess it’s a dragoon set then for PvP until chaotic. I’ll focus dragoon with bow, but is it the full set or a mixed set? Shadowfax88 Legendary Archer 8/13/25, 7:03 PM Wednesday, August 13, 2025 at 7:03 PM It depends on what you want. Full set is better for pvp but the most important dragoon pieces are xbow, boots and helm. If you wanna mix in some pve chapters and tower gameplay having the oracle chest and amulet helps. The chest could even be echo because hp will eventually not matter in chapters BonnyBoy ARC2 Junior Archer 8/13/25, 7:04 PM Wednesday, August 13, 2025 at 7:04 PM Ok full set, focus boots and helm ArcAngel ASHW Senior Archer 8/13/25, 7:05 PM Wednesday, August 13, 2025 at 7:05 PM Has anyone figured out if ticketsaving weekly is better or worse than saving for a high rank on last day? August 16, 2025 gktrkler Novice Explorer 8/16/25, 12:41 AM Saturday, August 16, 2025 at 12:41 AM Hey, wasn't the griffin set for pvp? I see everyone suggest dragon, can anyone tell why. I want to focus on pvp so any advice on gear and runes are appreciated. Would like if it got an explanation as well HeneralDiddoy ARC2 Novice Explorer 8/16/25, 10:13 AM Saturday, August 16, 2025 at 10:13 AM Which hero should I star up first? Dracoola or Rolla. I have 6 star helix September 5, 2025 ARC2 Ok full set, focus boots and helm 𝓗𝔢𝔰𝔥𝒚 𝔅🦀𝔦𝔦 Elite Archer 9/5/25, 5:10 PM Friday, September 5, 2025 at 5:10 PM Griffin amulet is also good if you wanna play close Hey, wasn't the griffin set for pvp? I see everyone suggest dragon, can anyone tell why. I want to focus on pvp so any advice on gear and runes are appreciated. Would like if it got an explanation as well 𝓗𝔢𝔰𝔥𝒚 𝔅🦀𝔦𝔦 Elite Archer 9/5/25, 5:11 PM Friday, September 5, 2025 at 5:11 PM Griffin set is the best at chaotic but before that dragoon is better September 8, 2025 Kriss Pill/BurnedSalad 9/8/25, 10:36 PM Monday, September 8, 2025 at 10:36 PM So i'm thinking about the following strat : Have my oracle amulet at legendary 3 during the day while I still have pve content to do and after i'm done with all the dailies I use the quality down feature and put the materials into upgrading my non-S-tier griffin amulet to use in arena, and cycle those two every day until I have enough gear to keep them both at lvl 3 (or go up a gear tier on the S rank at some point) Would this be a valid strat? Have I found a loophole of sorts? September 12, 2025 𝓗𝔢𝔰𝔥𝒚 𝔅🦀𝔦𝔦 Elite Archer 9/12/25, 4:08 PM Friday, September 12, 2025 at 4:08 PM Why are you using the claws just use the xbow September 23, 2025 Stu Novice Explorer 9/23/25, 12:54 PM Tuesday, September 23, 2025 at 12:54 PM I regularly lose to people 100k+ power lower than me, what am I doing wrong? Oh I can't post my screenshot I've put them in media EpicJapan | for Help :D ARC2 Chat Mod 4/13/25, 9:22 PM Sunday, April 13, 2025 at 9:22 PM If you have other arena questions, feel free to ask here , What time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "events someone from sniping you and dropping you in the rankings after you have improved your rankings. And since the arena becomes unplayable 10 minutes before the daily reset, it is recommended to start playing 20-30 minutes before the reset. You could save your tickets and use them all at once on the last day, but I don't know if I would recommend that since you would be wasting 5 tickets each day. Does tickets stack? , , Yes. If you have 0-5 tickets when daily reset, it will reset to 5 tickets. If you have 6 or more, the number won't change. Every day, you can gain 3 more by doing daily tasks, 5 more by buying with gems, 50 more by buying with guild coins. Regarding other modes, ⁠unknown Is there a way to skip the battle? , , The first option is to buy a monthly card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena, Dragoon set is recommended. However, many people concentrate on Oracle, so I have created a thread to discuss the rune build for Oracle users. ⁠[Check pinned msg] Arena Build… (edited) Sunday, June 1, 2025 at 9:26 AM EpicJapan | for Help :D ARC2 Chat Mod 4/13/25, 9:22 PM Sunday, April 13, 2025 at 9:22 PM If you have other arena questions, feel free to ask here , What time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "events someone from sniping you and dropping you in the rankings after you have improved your rankings. And since the arena becomes unplayable 10 minutes before the daily reset, it is recommended to start playing 20-30 minutes before the reset. You could save your tickets and use them all at once on the last day, but I don't know if I would recommend that since you would be wasting 5 tickets each day. Does tickets stack? , , Yes. If you have 0-5 tickets when daily reset, it will reset to 5 tickets. If you have 6 or more, the number won't change. Every day, you can gain 3 more by doing daily tasks, 5 more by buying with gems, 50 more by buying with guild coins. Regarding other modes, ⁠unknown Is there a way to skip the battle? , , The first option is to buy a monthly card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena, Dragoon set is recommended. However, many people concentrate on Oracle, so I have created a thread to discuss the rune build for Oracle users. ⁠[Check pinned msg] Arena Build… (edited) Sunday, June 1, 2025 at 9:26 AM If you have other arena questions, feel free to ask here , What time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "events someone from sniping you and dropping you in the rankings after you have improved your rankings. And since the arena becomes unplayable 10 minutes before the daily reset, it is recommended to start playing 20-30 minutes before the reset. You could save your tickets and use them all at once on the last day, but I don't know if I would recommend that since you would be wasting 5 tickets each day. Does tickets stack? , , Yes. If you have 0-5 tickets when daily reset, it will reset to 5 tickets. If you have 6 or more, the number won't change. Every day, you can gain 3 more by doing daily tasks, 5 more by buying with gems, 50 more by buying with guild coins. Regarding other modes, ⁠unknown Is there a way to skip the battle? , , The first option is to buy a monthly card. The second option is to press the pause button in the upper left corner right after the battle starts and leave the battle (the result will be reflected). Which build should I use? , , In arena, Dragoon set is recommended. However, many people concentrate on Oracle, so I have created a thread to discuss the rune build for Oracle users. ⁠[Check pinned msg] Arena Build… (edited) Sunday, June 1, 2025 at 9:26 AM EpicJapan | for Help :D ARC2 Chat Mod 4/13/25, 9:30 PM Sunday, April 13, 2025 at 9:30 PM What is the best strategy when I'm stuck in my current group? , , Deliberately demote one level and achieve a higher ranking in that group. Specifically, check the ranking rewards",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "events now) and all messages deleted so you go straight to numero uno 1 We can discuss in ⁠🏹・archero-2 or whatnot 'thulhu ARC2 ported over success rate tool to an ok UI. 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 9/12/25, 6:49 AM Friday, September 12, 2025 at 6:49 AM Oh, the dice companion? Sick, thank you! 'thulhu ARC2 ported over success rate tool to an ok UI. 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 9/12/25, 6:49 AM Friday, September 12, 2025 at 6:49 AM Oh, the dice companion? Sick, thank you! ported over success rate tool to an ok UI. Oh, the dice companion? Sick, thank you! Kai'thulhu ARC2 Chat Mod 9/12/25, 6:52 AM Friday, September 12, 2025 at 6:52 AM yea ideally I move all interactive parts out of existing guide out and retire that one. someone else can own the FAQs and other misc things around the base strategy. Kai'thulhu ARC2 Chat Mod 9/12/25, 6:52 AM Friday, September 12, 2025 at 6:52 AM yea ideally I move all interactive parts out of existing guide out and retire that one. someone else can own the FAQs and other misc things around the base strategy. yea ideally I move all interactive parts out of existing guide out and retire that one. someone else can own the FAQs and other misc things around the base strategy. 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 9/12/25, 6:59 AM Friday, September 12, 2025 at 6:59 AM Yeah, it's very nice this way :)) Are you gonna add the percentile calculator to it too? That's the one I and others too, I think, use the most. 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 9/12/25, 6:59 AM Friday, September 12, 2025 at 6:59 AM Yeah, it's very nice this way :)) Are you gonna add the percentile calculator to it too? That's the one I and others too, I think, use the most. Yeah, it's very nice this way :)) Are you gonna add the percentile calculator to it too? That's the one I and others too, I think, use the most. @🩵Josiias F2P Cat MOP PONY Yeah, it's very nice this way :)) Are you gonna add the percentile calculator to it too? That's the one I and others too, I think, use the most. Kai'thulhu ARC2 Chat Mod 9/12/25, 7:17 AM Friday, September 12, 2025 at 7:17 AM I think to avoid all this starting dice confusion im planning on just letting people track number of dice they get from board. ill have to figure out what i want to do but something like: Multiplier: (1) (2) (3) (5) (10) <-- toggle buttons Dice: (1) (2) <-- select buttons Total Rolls: [number input field] ----- Total Dice from board: some number Net Dice Used: some number Points per Dice Used: some number Percentile: some % (edited) Friday, September 12, 2025 at 7:18 AM @🩵Josiias F2P Cat MOP PONY Yeah, it's very nice this way :)) Are you gonna add the percentile calculator to it too? That's the one I and others too, I think, use the most. Kai'thulhu ARC2 Chat Mod 9/12/25, 7:17 AM Friday, September 12, 2025 at 7:17 AM I think to avoid all this starting dice confusion im planning on just letting people track number of dice they get from board. ill have to figure out what i want to do but something like: Multiplier: (1) (2) (3) (5) (10) <-- toggle buttons Dice: (1) (2) <-- select buttons Total Rolls: [number input field] ----- Total Dice from board: some number Net Dice Used: some number Points per Dice Used: some number Percentile: some % (edited) Friday, September 12, 2025 at 7:18 AM Yeah, it's very nice this way :)) Are you gonna add the percentile calculator to it too? That's the one I and others too, I think, use the most. I think to avoid all this starting dice confusion im planning on just letting people track number of dice they get from board. ill have to figure out what i want to do but something like: Multiplier: (1) (2) (3) (5) (10) <-- toggle buttons Dice: (1) (2) <-- select buttons Total Rolls: [number input field] ----- Total Dice from board: some number Net Dice Used: some number Points per Dice Used: some number Percentile: some % (edited) Friday, September 12, 2025 at 7:18 AM 'thulhu ARC2 I think to avoid all this starting dice confusion im planning on just letting people track number of dice they get from board. ill have to figure out what i want to do but something like: 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 9/12/25, 7:19 AM Friday, September 12, 2025 at 7:19 AM Oh, alright. I like starting dice because I don't have to keep track of anything but I get it confuses some people. 'thulhu ARC2 I think to avoid all this starting dice confusion im planning on just letting people track number of dice they get from board. ill have to figure out what i want to do but something like: 🩵Josiias F2P Cat MOP PONY Archero 2 Helper 9/12/25, 7:19 AM Friday, September 12, 2025 at 7:19 AM Oh, alright. I like starting dice because I don't have to keep track of anything but I get it confuses some people. I think to avoid all this starting dice confusion im planning on just letting people track number of dice they get from board. ill have to figure out what i want to do but something like: Oh, alright. I like starting dice because I don't have to keep track of anything but I get it confuses some people. 'thulhu ARC2 ported over success rate tool to an ok UI. AbdayMinjay Senior Archer 9/12/25, 8:51 AM Friday, September 12, 2025 at 8:51 AM can't put tile 0 i meant (edited) Friday, September 12, 2025 at 9:04 AM [Data collection] S gear - Key ratio Game Mechanics September 2, 2025 Poosti Wiki Contributor 9/2/25, 10:35 AM Tuesday, September 2, 2025 at 10:35 AM Data collection for S gear to key ratio. Sepetate forms for chroma and mythstone chests below. 5 2 Follow Add this post to your channel list and receive notifications about it. Poosti Wiki Contributor 9/2/25, 10:36 AM Tuesday, September 2, 2025 at 10:36 AM Chromatic: Mythstone: Google Docs Key - S gear ratio (Chromatic) Collecting data for Key to S gear ratio. Please check your data carefully and do it the right way (How many keys used - How many S gears gained). Google Docs Key - S gear ratio (Mythstone) Collecting data for Key to S gear ratio. Please check your data carefully and do it the right way (How many keys used - How many S gears gained). 5 September 3, 2025 Poosti Wiki Contributor 9/3/25, 1:08 PM Wednesday, September 3, 2025 at 1:08 PM You can only send in 1 answer, but its possible to update your answer (edited) Wednesday, September 3, 2025 at 1:10 PM 4 2 gryfel Senior Archer 9/3/25, 3:19 PM Wednesday, September 3, 2025 at 3:19 PM What do you mean by hitting pity? oにおん Senior Archer 9/3/25, 7:44 PM Wednesday, September 3, 2025 at 7:44 PM It is necessary to consider that data is statistically unreliable unless it is consecutive data from the same user. におん It is necessary to consider that data is statistically unreliable unless it is consecutive data from the same user. Pontus Chat Mod 9/3/25, 10:39 PM Wednesday, September 3, 2025 at 10:39 PM It’s not unreliable just because of different users. It’s still random data from the global population of random events Pontus It’s not unreliable just because of different users. It’s still random data from the global population of random events oにおん Senior Archer 9/3/25, 10:51 PM Wednesday, September 3, 2025 at 10:51 PM Since it’s already been suggested that the probability changes on how many opens have already been made, we need to take that into account. When collecting data from multiple users, we need information on how many pulls remained until pity at the time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.8999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "event or focusing on weapon skin cores instead? the Brave I only have 1 Otta but have sacred hall lvl 4 for the skin resonance. Should I be getting cores to unlock the Otta skin this event or focusing on weapon skin cores instead? Ty the Squirtle Squirt Elite Archer 9/24/25, 6:58 AM Yes, weapon skins aren’t worth getting over character skins 1 SolarisX86 Novice Explorer 9/24/25, 9:37 PM I’m gonna just save my cores I went hard for to get without spending real money. Got 6 so I’ll hold for future weapon skins instead of wasting them on whatever this is they just released I suppose it’s time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.7999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "event? any advice appreciated RB773 Mythic Archer 10/1/25, 9:25 AM fishing, island, keys... enchantium Is this the event where you spend excess gems? I have bought the lifetime",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.7999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "events (maybe June) except Scythe and archer close range is good | for Help :D ARC2 get circle etched(pulsing orb) in fishing events (maybe June) xWake Junior Archer 5/25/25, 8:01 AM Thanks! 1 May 26, 2025 'thulhu ARC2 Sky Tower 395-400: , No paralyze/freeze. resets crab and gets annoying. Plant: stay in corner when they lay down poison as some blobs can fall off screen. Pumpkin: stay in far corner when they shoot small balls as 2 balls can fall off screen Crab: ⁠theorycrafting⁠The Boss Guide (Check Pinned Me… dareru GAG Junior Archer 5/26/25, 7:54 AM hey what about the boss in 400th floor? the jumping purple one that burst spreading GAG hey what about the boss in 400th floor? the jumping purple one that burst spreading Kai'thulhu ARC2 Chat Mod 5/26/25, 7:59 AM ideally you get weapon enchantment as you do a lot of dodging. a lot of it you gotta keep moving and only attack during punches cuz his pounce is p fast. does 3 punches where you wanna dodge left/right. the pounce you want to walk away for more time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.7999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "events におん It is necessary to consider that data is statistically unreliable unless it is consecutive data from the same user. Pontus Chat Mod 9/3/25, 10:39 PM It’s not unreliable just because of different users. It’s still random data from the global population of random events It is necessary to consider that data is statistically unreliable unless it is consecutive data from the same user. It’s not unreliable just because of different users. It’s still random data from the global population of random events April 27, 2025 Pontus Chat Mod 4/27/25, 10:18 PM Tickets ≈ 83.35Weight(kg) (edited) EpicJapan | for Help :D ARC2 Chat Mod 4/27/25, 10:25 PM good data 1 | for Help :D ARC2 good data Pontus Chat Mod 4/27/25, 10:26 PM Do you happen to know how many time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.7999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "event, including missions, stores! Pontus Chat Mod 4/27/25, 10:18 PM Tickets ≈ 83.35Weight(kg) (edited) Pontus Chat Mod 4/27/25, 10:18 PM Tickets ≈ 83.35Weight(kg) (edited) Tickets ≈ 83.35Weight(kg) (edited) EpicJapan | for Help :D ARC2 Chat Mod 4/27/25, 10:25 PM good data 1 EpicJapan | for Help :D ARC2 Chat Mod 4/27/25, 10:25 PM good data 1 | for Help :D ARC2 good data Pontus Chat Mod 4/27/25, 10:26 PM Do you happen to know how many time",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.7999999999999999,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    },
    {
      "content": "eventually? Sebiias Tryhard Cat MOP Range Master 10/5/25, 7:28 AM Sunday, October 5, 2025 at 7:28 AM each skin is individual between each other and their prices stay the same amount for every purchase mob Novice Explorer 10/5/25, 7:31 AM Sunday, October 5, 2025 at 7:31 AM roger that. appreciate the advice. Also all the like 'heart eyes' stuff is just decorative right? roger that. appreciate the advice. Also all the like 'heart eyes' stuff is just decorative right? Sebiias Tryhard Cat MOP Range Master 10/5/25, 7:31 AM Sunday, October 5, 2025 at 7:31 AM yeah 1 Tryhard Cat MOP each skin is individual between each other and their prices stay the same amount for every purchase nani Novice Explorer 10/5/25, 7:37 AM Sunday, October 5, 2025 at 7:37 AM Ahhh thanks man, yeah someone told me to buy razor cores in a previous event maybe I should of got the other cores. Thanks for the help Sebiias Tryhard Cat MOP Range Master 10/5/25, 7:37 AM Sunday, October 5, 2025 at 7:37 AM whoever told you that they're wrong terrible decision nani Novice Explorer 10/5/25, 7:40 AM Sunday, October 5, 2025 at 7:40 AM Yeah I only got 2 so it's not too much of a big deal, it is what it is Yeah I only got 2 so it's not too much of a big deal, it is what it is Sebiias Tryhard Cat MOP Range Master 10/5/25, 7:45 AM Sunday, October 5, 2025 at 7:45 AM oh well its not so bad I guess yeah Now you know nani Novice Explorer 10/5/25, 7:52 AM Sunday, October 5, 2025 at 7:52 AM Yeah thanks lucky I saw these messages early October 6, 2025 NEW Tryhard Cat MOP neither, otta nian skin and duck helix are the bests (edited) $65 Stumpy Archer Booster Yesterday at 12:15 AM Monday, October 6, 2025 at 12:15 AM what’s so good about duck helix? Is it an extra revive? @$65 Stumpy what’s so good about duck helix? Is it an extra revive? Shadowfax88 Legendary Archer Yesterday at 12:20 AM Monday, October 6, 2025 at 12:20 AM You get berserk when you revive which is +40% atk speed Tryhard Cat MOP Unlocking otta and her skin is a goal, we're gonna have dice very soon so start saving dice for that, if you spend then next time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.7999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "event? any advice appreciated RB773 Mythic Archer 10/1/25, 9:25 AM Wednesday, October 1, 2025 at 9:25 AM fishing, island, keys... enchantium Is this the event where you spend excess gems? I have bought the lifetime",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.7999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "events (maybe June) except Scythe and archer close range is good | for Help :D ARC2 get circle etched(pulsing orb) in fishing events (maybe June) xWake Junior Archer 5/25/25, 8:01 AM Sunday, May 25, 2025 at 8:01 AM Thanks! 1 May 26, 2025 'thulhu ARC2 Sky Tower 395-400: , No paralyze/freeze. resets crab and gets annoying. Plant: stay in corner when they lay down poison as some blobs can fall off screen. Pumpkin: stay in far corner when they shoot small balls as 2 balls can fall off screen Crab: ⁠theorycrafting⁠The Boss Guide (Check Pinned Me… dareru GAG Junior Archer 5/26/25, 7:54 AM Monday, May 26, 2025 at 7:54 AM hey what about the boss in 400th floor? the jumping purple one that burst spreading GAG hey what about the boss in 400th floor? the jumping purple one that burst spreading Kai'thulhu ARC2 Chat Mod 5/26/25, 7:59 AM Monday, May 26, 2025 at 7:59 AM ideally you get weapon enchantment as you do a lot of dodging. a lot of it you gotta keep moving and only attack during punches cuz his pounce is p fast. does 3 punches where you wanna dodge left/right. the pounce you want to walk away for more time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.7999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "events におん It is necessary to consider that data is statistically unreliable unless it is consecutive data from the same user. Pontus Chat Mod 9/3/25, 10:39 PM Wednesday, September 3, 2025 at 10:39 PM It’s not unreliable just because of different users. It’s still random data from the global population of random events It is necessary to consider that data is statistically unreliable unless it is consecutive data from the same user. It’s not unreliable just because of different users. It’s still random data from the global population of random events 15 3 Follow Add this post to your channel list and receive notifications about it. Jump To Top April 27, 2025 Pontus Chat Mod 4/27/25, 10:18 PM Sunday, April 27, 2025 at 10:18 PM Tickets ≈ 83.35Weight(kg) (edited) Tuesday, April 29, 2025 at 9:11 AM EpicJapan | for Help :D ARC2 Chat Mod 4/27/25, 10:25 PM Sunday, April 27, 2025 at 10:25 PM good data 1 | for Help :D ARC2 good data Pontus Chat Mod 4/27/25, 10:26 PM Sunday, April 27, 2025 at 10:26 PM Do you happen to know how many time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.7999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "event, including missions, stores! Pontus Chat Mod 4/27/25, 10:18 PM Sunday, April 27, 2025 at 10:18 PM Tickets ≈ 83.35Weight(kg) (edited) Tuesday, April 29, 2025 at 9:11 AM Pontus Chat Mod 4/27/25, 10:18 PM Sunday, April 27, 2025 at 10:18 PM Tickets ≈ 83.35Weight(kg) (edited) Tuesday, April 29, 2025 at 9:11 AM Tickets ≈ 83.35Weight(kg) (edited) Tuesday, April 29, 2025 at 9:11 AM EpicJapan | for Help :D ARC2 Chat Mod 4/27/25, 10:25 PM Sunday, April 27, 2025 at 10:25 PM good data 1 EpicJapan | for Help :D ARC2 Chat Mod 4/27/25, 10:25 PM Sunday, April 27, 2025 at 10:25 PM good data 1 | for Help :D ARC2 good data Pontus Chat Mod 4/27/25, 10:26 PM Sunday, April 27, 2025 at 10:26 PM Do you happen to know how many time",
      "source": "theorycrafting-posts-data-1759898061175.json",
      "category": "events_modes",
      "confidence": 0.7999999999999999,
      "extractedAt": "2025-10-08T05:32:39.867Z"
    },
    {
      "content": "event? any advice appreciated Is this the event where you spend excess gems? I have bought the lifetime",
      "source": "theorycrafting-posts-data-1759700707280.json",
      "category": "events_modes",
      "confidence": 0.7,
      "extractedAt": "2025-10-08T05:32:39.829Z"
    }
  ]
}