{
  "timestamp": "2025-10-05T22:36:11.116Z",
  "sources": [],
  "wikiPages": [
    {
      "url": "https://theriagames.com/archero-2-wiki/",
      "content": "Home\nWiki's\nBlog\nSupport\nAccount\nGuides\nHeroes\nChapters\n            Archero 2 Wiki\nEXPLORE\nClick on one of the buttons below to navigate to their respective page within the Archero 2 wiki.\nGuides Heroes Chapters\nPOPULAR\nArchero 2 Codes\nRead More »\nArchero 2 Rolla Guide\nRead More »\nArchero 2 Chapter 91 Silent Reach Guide\nRead More »\nArchero 2 Demon King Atreus Guide\nRead More »\nFOLLOW US\nUPDATES\nAbout the Archero 2 Wiki\nWelcome to the largest collection of Archero 2 guides, calculators and tools. This is the ultimate Archero 2 wiki which we constantly update and post new content for each update – so keep your eyes peeled!\nOur team has thousands of hours playing Archero 2, which allows us to produce the most in-depth and accurate content, giving you and your team the competitive advantage! We have a wide range of guides, calculators, and tools – be sure to check out the entire wiki, you may have find some hidden gems! \nHave ideas for the wiki? Or have a Archero 2 question? Check out our Discord:\nJOIN DISCORD\nRECENT\nArchero 2 Chapter 91 Silent Reach Guide\nApril 22, 2025\nRead More »\nArchero 2 Chapter 90 Palace Ruins Guide\nApril 22, 2025\nRead More »\nArchero 2 Chapter 89 Serene Abyss Guide\nApril 22, 2025\nRead More »\nArchero 2 Chapter 88 Drill Grounds Guide\nApril 22, 2025\nRead More »\nArchero 2 Demon King Atreus Guide\nApril 22, 2025\nRead More »\nArchero 2 Rolla Guide\nApril 22, 2025\nRead More »\nArchero 2 Chapter 87 Silent Isle Guide\nApril 21, 2025\nRead More »\nArchero 2 Chapter 86 Twilight Plains Guide\nApril 21, 2025\nRead More »\nABOUT THERIA\nEstablished in 2023, Theria is a centralized platform for mobile gamers. We focus on creating high quality and in-depth guides, as well as a collection of tools and calculators for mobile games to enhance your gaming experience.\nWe will soon be releasing APK’s for your favourite games, as well as team management tools to help organise and manage your alliance – offering you the mobile shortcut to victory.\nTHERIA PLUS\nJoin Theria Plus for a",
      "scrapedAt": "2025-10-05T22:36:26.637Z",
      "contentLength": 2975
    },
    {
      "url": "https://archero-2.game-vault.net/wiki/Characters",
      "content": "It's rollover time\nSponsored By Vanguard\nStart Now\nCharacters\n×\nIn Archero 2, characters are your playable heroes, each offering unique abilities that shape your gameplay experience. You can find and manage them within the Gear menu on the Characters Tab. Unlocking new characters requires obtaining 50 of their specific shards, which are acquired through in-game quests and activities, or by purchasing them from the shop and during special events.\nCurrently, 8 characters are available in Archero 2:\nAlex\nNyanja\nHelix\nSeraph\nDracoola\nRolla\nOtta\nAtreus\nA key feature for character progression is Resonance, available at 3 and 6 levels. This allows you to select an additional skill from another unlocked character, providing significant build customization.\nLeveling up Characters\nCollapse\nEach character can be leveled up by obtaining more shards, improving their base stats and unlocking powerful new abilities at higher star levels.\nShard Requirements for Star Levels\nStar Level Shard Requirement\n0 (unlock) 50 shards\n1 50 shards\n2 100 shards\n3 100 shards\n4 150 shards\n5 150 shards\n6 200 shards\n7 300 shards\n8 500 shards\nCharacters\nAlex's basic skin\nExpand\nAlex\nAlex is a brave demon hunter, recognizable by his family's signature white hair. When monsters threaten, he fearlessly wields his Demon Hunter's bow and sets off on adventure without hesitation.\nPowerful HP Recovery: Alex possesses strong self-healing capabilities.\nHunter Bloodline Awakening: His unique bloodline awakens over time in battle, granting him enhanced combat prowess.\nDescendant of Atreus: Alex is a direct descendant of the renowned bow hero, Atreus.\nTo view Alex's full progression details and Star-Up Attributes, expand this section.\n\nNyanja's basic skin\nExpand\nNyanja\nMeow! Nyanja is a dangerous assassin capable of unleashing arcane power with its fluffy tail.\nWind Control and Sleeping: Nyanja excels at manipulating wind and can put enemies to sleep.\nSilent Movement: The pads on Nyanja's paws allow it to move si",
      "scrapedAt": "2025-10-05T22:36:38.386Z",
      "contentLength": 5587
    },
    {
      "url": "https://archero-2.game-vault.net/wiki/Gear",
      "content": "Gear\nArchero 2 includes various equipment that give stat bonuses to the hero when equipped and buff different aspects of their builds.\nGear\nThere are 6 types of equipment in the Archero 2, and you can equip one of each in its respective slot:\nWeapon\nArmor\nHelm\nBoots\nAmulet\nRing\nIt is possible to level up equipment using Gear Scrolls & Gold that will add additional main stats to the gear. If another gear is equipped, the upgrades will carry over, so upgrades improve the gear slot.\nEach piece of gear can have different quality's as well as additional effects that can boost specific builds.\nBlacksmith\nBlacksmith allows players to merge the gear in order to improve its quality. It will require either an exact copy (duplicate) of an item of the same quality tier or same type of item of the same quality tier. (Universal material can be used in place of any \"same slot gear\" when merging, see below table)\nEquipment Merging Item requirements\nUpgraded Item Fodder Merging Result\nNormal Gear 2x Normal Duplicate Gear Fine Gear\nFine Gear 2x Fine Duplicate Gear Rare Gear\nRare Gear 2x Rare Duplicate Gear Epic Gear\nEpic Gear 1x Epic Same Slot Gear or Epic +1 Gear\nEpic +1 Gear 2x Epic Same Slot Gear or Epic +2 Gear\nEpic +2 Gear 1x Epic Duplicate +2 Gear Legendary Gear\nLegendary Gear 1x Legendary Same Slot Gear or Legendary +1 Gear\nLegendary Gear 1x Legendary Same Slot Gear or Legendary +2 Gear\nLegendary Gear 2x Legendary Same Slot Gear or Legendary +3 Gear\nLegendary +3 Gear 1x Legendary Duplicate +3 gear Mythic Gear\nMythic Gear 1x Legendary Duplicate +3 gear Mythic +1 Gear\nMythic +1 Gear 1x Legendary Duplicate +3 gear Mythic +2 Gear\nMythic +2 Gear 1x Legendary Duplicate +3 gear Mythic +3 Gear\nMythic +3 Gear 1x Legendary Duplicate +3 gear Mythic +4 Gear\nMythic +4 Gear 1x Legendary Duplicate +3 gear Chaotic Gear\nGear Sets\nYou can find set specific information for all Archero 2 Gear by clicking on one of the sets or scrolling down and viewing the whole list of available gear.\nOracle Set",
      "scrapedAt": "2025-10-05T22:36:49.441Z",
      "contentLength": 11104
    },
    {
      "url": "https://archero-2.game-vault.net/wiki/Runes",
      "content": "Runes\nRunes are Special equipment in Archero 2. They can be found in the Gear menu on the Runes Tab. Runes can be obtained via Digging in the Rune Ruins, from the Chapter rewards (are unlocked upon reaching Chapter 5 in the main portion of the game) or when there is an event they are sometimes purchasable.\nRune Workshop\nRune Workshop allows players to merge the Runes in order to improve their quality. It will require either an exact copy (duplicate) of an item of the same quality tier or same type of item of the same quality tier fodder.\nRune Workshop Merging Item requirements\nUpgraded Item Fodder Merging Result\nNormal Rune 2x Normal Duplicate Rune Fine Rune\nFine Rune 2x Fine Duplicate Rune Rare Rune\nRare Rune 2x Rare Duplicate Rune Epic Rune\nEpic Rune 2x Epic Duplicate Rune Epic +1 Rune\nEpic +1 Rune 2x Epic +1 Duplicate Rune Epic +2 Rune\nEpic +2 Rune 2x Epic +2 Duplicate Rune Legendary Rune\nLegendary Rune 2x Legendary Duplicate Rune Legendary +1 Rune\nLegendary +1 Rune 2x Legendary +1 Duplicate Rune Legendary +2 Rune\nLegendary +2 Rune 2x Legendary +2 Duplicate Rune Legendary +3 Rune\nLegendary +3 Rune 2x Legendary +3 Duplicate Rune Mythic Rune\nRunes\nThere are 4 types of runes in the Archero 2, and you can equip one of each in their respective slots:\nBlessing Rune x2\nAbility Rune x4\nEnhancement Rune x4\nEtched Rune x3\nRunes can have different quality and higher quality runes have additional powerful attributes that can boost specific builds.\nEtched Runes\nEtched Runes add Max HP and ATK when equipped. At Rare+ tier they provide unique bonuses for the rune-specific attacks.\nName Type Base Normal Fine Rare Epic Legendary Mythic\nArrow Of Echoes Etched ATK PWR +180/Max HP +720 Main Weapon damage +100 ATK PWR +100 Main weapon skills have the chance to spawn When firing 4 or more projectiles at once, they have the chance to form a web Starting skill: Diagonal Arrow Main weapon skills have a greatly increased chance to spawn\nElemental Domain Etched ATK PWR +180/Max HP +720 Ele",
      "scrapedAt": "2025-10-05T22:36:59.544Z",
      "contentLength": 12816
    },
    {
      "url": "https://archero-2.game-vault.net/wiki/Skills",
      "content": "Skills\n\nIn Archero 2, skills are fundamental abilities that shape your gameplay experience and lasting for the duration of a single run. You acquire these skills throughout various game modes: during standard runs, they are typically offered upon leveling up or through special encounters, while in specific modes like the Arena, skills are automatically assigned to your hero in groups of three per round; they can also be obtained during certain other events.\nThese abilities are crucial for designing unique and effective builds, allowing you to tailor your strategy to your hero's strengths and weaknesses, and adapt to different enemy types. Their effects are incredibly varied, ranging from offensive enhancements like poisoning enemies with Venom, to tactical advantages such as projectiles that track foes with Tracking Eye, or even crucial defensive safeguards like gaining an extra life with Revive.\nHow is Damage Calculated?\nCollapse\nDamage calculations in Archero 2 operate on a hybrid system that combines both additive and multiplicative mechanics. Your total damage output is determined by grouping certain buffs into categories, adding them together within those categories, and then multiplying the results of each category. There are 3 main categories that multiply between each other: Attack Power, Main weapon DMG and DMG.\nAttack Power (also ATK or ATK PWR). Affects all sources of damage as they all calculate their baseline damage value as N x Attack Power. There are some skills that claim to affect ATK, but don't (Swift Arrow and all the source specific buffs), and some skills that say they affect something else, but really they change Attack Power (Stand Strong).\nMain weapon DMG. Only affects non-elemental part of main weapon damage and doesn't affect explosion damage coming from bow/crossbow either. Affected by: Front Arrow, Sharp Arrow rune, Chaotic Dragoon crossbow effect.\nDMG is a mixed bag. Some skills affect a lot of damage sources (Swift Arrow, Tracking Eye, ",
      "scrapedAt": "2025-10-05T22:37:10.022Z",
      "contentLength": 6581
    },
    {
      "url": "https://archero-2.game-vault.net/wiki/Events",
      "content": "Events\nArchero 2 offers a variety of Events that happen regularly, occasionally, or as one-time occurrences. Engaging with these events is crucial for players to acquire diverse rewards and accelerate their progression.\nRegular Events\nRegular events are daily, weekly, monthly, or scheduled rotational activities that serve as a steady source of additional resources for upgrading your Hero. Most Regular events are daily activities.\nCampaign\nSky Tower\nArena\nGold Cave\nRune Ruins\nOccasional Events\nOccasional Events may reappear in the game without a specific schedule. For a full list of previous, ongoing, and upcoming events, please visit the Archero 2 Discord and check the 'Events' channel.\nIsland Treasure Hunt\nAngler's Bounty\nWorld Tree's Pulse\nDemon King Clash\nOne-time Events\nUnlike recurring events, One-time Events are singular opportunities that appear without a fixed schedule, often tied to special occasions or game milestones. Each of these unique events can only be completed once by players.\nCarnival\nCarnival 2\nArchero 2 navigation\nThis box: view • talk • edit\nMain Tabs Characters • Gear • Runes • Skills • Artifacts • Talent Cards\nGame Mechanics Events\nUseful Pages Currency and Items • Pull Rates • Reward Codes • Collection of game Tips • FAQ\nGuides All Guides • Ultimate Beginners Guide\nBuilds Oracle Build",
      "scrapedAt": "2025-10-05T22:37:19.125Z",
      "contentLength": 1330
    }
  ],
  "communityPages": [
    {
      "url": "https://www.reddit.com/r/ArcheroV2/",
      "content": "Best\nOpen sort options\nChange post view\nCommunity highlights\nComplete Archero 2 Tier List for Skills, Runes, Gear, and Characters\nMegathread\nAngler's Bounty Guide (Fishing)\nGuide\nAll Guide List Posted by EpicJapan\nMegathread\nGear Guide\nGuide\nFishing event guide - how to get 1000kg on day 3 as a F2P\nGuide\n*Cries in ranger*\nu/Norci\n•\n15 hr. ago\nReport\n*Cries in ranger*\nMeme\nUpvote\n47\nDownvote\n5\nGo to comments\nu/IAMS\n•\nPromoted\nReport\nAbout this ad\nTired of ads?\nLosing weight and staying full? Win Win. Help your cat lose weight in 2 months with IAMS™ Healthy Weight.\n0:00\n0:00 / 0:00\niams.com\nLearn More\nUpvote\nVote\nDownvote\n0\nGo to comments\nBro I just screamed at 2am\nu/fatestriker123\n•\n17 days ago\nReport\nBro I just screamed at 2am\nAchivement / Loot\nUpvote\n165\nDownvote\n30\nGo to comments\nHow do you use star cores?\nu/GenericCoffee\n•\n1 hr. ago\nReport\nHow do you use star cores?\nI have two, no clue what to do with them?\nQuestion\nUpvote\n2\nDownvote\n0\nGo to comments\nWhat does \"main weapon buff\" mean\nu/Vlachcov\n•\n1 hr. ago\nReport\nWhat does \"main weapon buff\" mean\nQuestion\nUpvote\n1\nDownvote\n0\nGo to comments\nAll my luck, this year.\nu/MR-Nom_Pang\n•\n5 days ago\nReport\nAll my luck, this year.\nGame Events\nUpvote\n90\nDownvote\n23\nGo to comments\nPvP Gear - Dragoon / Oracle ?\nu/TextPale9505\n•\n10 hr. ago\nReport\nPvP Gear - Dragoon / Oracle ?\nI’m an Oracle player and I’m trying to go for Dragoon gear right now Go for full set Dragoon for PvP or a mix of the 2 sets ? What’s ur opinion ? Thanks everyone\nQuestion\nUpvote\n2\nDownvote\n2\nGo to comments\nHELLLL YEAHHHH!\nu/Greedy-Principle-979\n•\n25 days ago\nReport\nHELLLL YEAHHHH!\nGame Events\nUpvote\n145\nDownvote\n16\nGo to comments\nPerfect start?\nu/iH8Corndogs\n•\n1 day ago\nReport\nPerfect start?\nQuestion\nUpvote\n20\nDownvote\n5\nGo to comments\nu/walmart\n•\nPromoted\nReport\nAbout this ad\nTired of ads?\nGive yourself the chills, with Halloween costumes even more perfect than you’d imagined.\nPage 1 (Current page)\nPage 2\nPage 3\nPage 4\nItem 1 of 4\nwalmart.com\nShop Now\nUpv",
      "scrapedAt": "2025-10-05T22:37:30.381Z",
      "contentLength": 6930
    }
  ],
  "guidePages": [],
  "toolPages": [],
  "totalPages": 9,
  "successfulPages": 7,
  "failedPages": 2
}